AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c

#include <stdio.h>
#include <stdarg.h>
#include <string.h>
#include <stdint.h>
#include <ctype.h>
#include "Platform.h" 
#include "NuMicro.h"
#include "lcd.h" 
 
#define WELCOME 				18
#define THANKS 					17
#define AUTOMODE 				5
#define AUTOSWON				8
#define MOBILEON 				16
#define STARTEDRUN 			16
#define RUNNINGGOOD 		25
#define MOBILEOFF 			15
#define MADEMOTOROFF		15
#define OFFCOND 				24
#define PODL 						10
#define NLOFF 					36
#define SUMPTANK 				47
#define UPPERTANK 			48
#define STOFF 					46
#define DRYRUNTIMER 		37
#define CYCLICON 				34
#define CYCLICOF 				35
#define RCTON 					45
#define RCTOF 					44
#define MAXTIMEROFF 		40
#define OKELECTRICITY 	23
#define NOELECTRICITY 	22
#define PH3PRESENT 			2
#define PH2PRESENT 			1
#define PH2PH3ON 				0
#define PH3ON 					3
#define LOWVOLTAGE			39
#define HIGHVOLTAGE			38
#define OVLOAD 					43
#define SPPOFF 					49
#define CUNRSPPOFF			33
#define REVERSEOFF			6
#define SOVOLT					30
#define SOCURRENT				9
#define SO0							32
#define SO1							20
#define SO2							29
#define SO3							28
#define SO4							13
#define SO5							12
#define SO6							27
#define SO7							26
#define SO8							11
#define SO9							19
#define THISVOLT				31
#define THISCUR					4
#define DECIMAL					21
#define VALVE						52
#define TVALVEON				53
#define DRIPCYC					54
#define GATEOF					55
#define WELCOME_LE 			18
#define THANKS_LE 			10
#define AUTOMODE_LE 		10
#define AUTOSWON_LE			18
#define MOBILEON_LE 		10
#define STARTEDRUN_LE 	18
#define RUNNINGGOOD_LE 	10
#define MOBILEOFF_LE 		18
#define MADEMOTOROFF_LE	18
#define OFFCOND_LE 			10
#define PODL_LE 				18
#define NLOFF_LE 				18
#define SUMPTANK_LE 		18
#define UPPERTANK_LE 		18
#define STOFF_LE 				18
#define DRYRUNTIMER_LE 	10
#define CYCLICON_LE 		10
#define CYCLICOF_LE 		18
#define RCTON_LE 				10
#define RCTOF_LE 				18
#define MAXTIMEROFF_LE 		18
#define OKELECTRICITY_LE 	10
#define NOELECTRICITY_LE 	10
#define PH3PRESENT_LE 		10
#define PH2PRESENT_LE 		10
#define PH2PH3ON_LE 			18
#define PH3ON_LE 				10
#define LOWVOLTAGE_LE		18
#define HIGHVOLTAGE_LE	18
#define OVLOAD_LE 			18
#define SPPOFF_LE 			18
#define CUNRSPPOFF_LE		18
#define REVERSEOFF_LE		18
#define SOVOLT_LE				6
#define SOCURRENT_LE		9
#define SO0_LE					1
#define SO1_LE					1
#define SO2_LE					1
#define SO3_LE					1
#define SO4_LE					1
#define SO5_LE					1
#define SO6_LE					1
#define SO7_LE					1
#define SO8_LE					1
#define SO9_LE					1
#define THISVOLT_LE			1
#define THISCUR_LE			1
#define DECIMAL_LE			1
#define VALVE_LE				10
#define TVALVEON_LE			12
#define DRIPCYC_LE			12
#define GATEOF_LE				12

/*Macros*/
#define OV_LOAD_TRIP_FLAG					1
#define DYRUN_LOAD_TRIP_FLAG			2
#define NO_TRIP_FLAG							0
#define DRIP_CYCLIC_TRIP_FLAG			3
#define LOW_PRESS_TRIP_FLAG    		4
#define HIGH_PRESS_TRIP_FLAG   		5
#define DRIP_NOCOM_TRIP_FLAG			6

/*Flash Related*/
#define READ_WRITE_FILE_BASE_ADDR          0x0003F000	
#define READFILE_READWORD_SIZE             4 


#define FLASH_PAGE_SIZE            4096
#define FLASH_PAGE_ADDRESS(addr) ((addr) & ~(FLASH_PAGE_SIZE - 1))

 
/*----------------------------------------------------------------------------------------------------------------------------*/
/*Global Variables Declaration																																																*/
/*----------------------------------------------------------------------------------------------------------------------------*/ 



/*Motor Function Related*/
//struct MSettings nMSettings;
nSTATE_SENDSMS STATE_SENDSMS=STATE_NO_SMS;
STATE_MOTOR nSTATE_MOTOR=STATE_MOTOR_OFF;
//STATE_MOTOR_TIMER nSTATE_MOTOR_TIMER=STATE_NO_TIMER;
STATE_MOTOR_PROBLEM nSTATE_MOTOR_PROBLEM=STATE_MOTOR_OK;
STATE_MOTOR_SMS nSTATE_MOTOR_SMS=STATE_NO_MOTOR_SMS;
STATE_MOTOR_ON_SMS nSTATE_MOTOR_ON_SMS=STATE_MOTOR_ON_DEFAULT;
STATE_STATUS_SMS nSTATE_STATUS_SMS=STATUS_MOTOROF_SMS;
STATE_STATUS_ONDELAY_SD nSTATE_STATUS_ONDELAY_SD = STATUS_MOTOR_AT_OFF;
RTC_CURRENT_STATUS nRTC_CURRENT_STATUS = NO_RTC_TIMER;
nDISPLAYMsg DISPLAYMsg = NO_COND;
CYCTimer nCYCTimer = NO_TCOND;


unsigned char PreviousTrip = NO_TRIP_FLAG;

volatile signed char Page = 0; 

uint8_t		SetToGreenFlag = 0,Stg3FirstTimer = 0,Stg2FirstTimer = 0,MassageReceived = 0,limitsmsonof,limitsmscount=0,limitsmsset,
					limitsmsflag=0,WritePhoneNumber = 0,SaveNumberPos = 1,valve_onof_msg=0,limitsmscountsmsm=0,debugon=0;

uint8_t	 	FirstTimerinProgram1 = 0,FirstTimerinProgram2 = 0,FirstTimerinProgram3 = 0,FirstTimerinProgram4 = 0,RTCCheckFirstTime=0,PrvDate = 0,OffMotorByPhone=0,
					SendSmsToAll=0,PowerCurrentCondition=0,onehour_send_flag=0,PowerIsThere,SMSDelay = 0,AllSmsSendDone = 0,SMS30MinStatus = 0,
					CallModeOn=0,checkpower,SMS30MinStatusNumber = 0,SMS30MinStatusDelay = 0,started_firsttime = 0,ModemIsReady=0,HowManyNumberFound,
					NumberOfSmsNeedToSend=0,Nooftcpsendcount=0,switchonofflag=0,FirstTimeSMS,Tpsms = 0,RTCOFFLAG=0,PrvAutoMobileKey,Appmodeon,
					gprson,power_on_flag_count=0,Displaydelay = 0,SubPage = 0,keydebouncecnt=0,keydebounceflag=0,CSQ=0,ChangeSoundStatus = 0,
					NowStarted=0,NowOff= 0,Ph2Ph3Selection=0,PrvPh2Ph3Selection=0,AutoMobileKey = 0,OnByTarget=0,checkpower=0,TargetNumberFound=0,
					ReversePhase=0, ActCycLicOnDelayPrvSec,ActCycLicOfDelayPrvSec,PlaySound = 0,PlaySoundVer = 0,PlayNumber = 0,
					HowManySoundToPlay=0,ServiceNumberFound=0,HowManySoundPlayed = 0,NumberOfSMSSend=0,NeedToSendSMSCall=0,ThisSMSisNotPowerFault = 0;				
					
uint8_t		WHRTCPRWillNext = 0,VolCurGetTimer = 0,VolCurGetTimern=0,VoicePowerCondition = 1,PrvOnOff = 0,PrvPowCond = 0,MotorTriedToStart = 0,
          Prv2ph3phstate = 4,writetorecordfirsttime = 0,Returnfromthisonly = 0,NowRestartMe = 0,spplowhighvoldelay=0,MotorReversePhaseSMS = 0,
          RecheckOlRstState = 0,livedataflag=0,livedataflag1=0,livedataflagcount1=0,livedataflagcount=0,Appmodeon=0,
          MotorReversePhse = 0,MotorReversePhasePl = 0,PowerOnDelayComPleted =0,ScrDelayCompleted = 0,pfccompleted=0,pfccompletedCnt=0,
					scrrelayTimer=0,pfcrelayTimer=0,SCRPowerOnDelay = 0,ActPoScrPrvSec = 0,ActScrPrvSec=0,NoAcceptSMS = 0,
					ActOnDelayPrvSec,ActStarDetaPrvSec,ActPrvmosHr,CatchDrAccor = 0,DryRunOccUpdate = 0,OverAllStarterTrip = 0,SendSmsflag=0,
					delayCounterSms=0,RelayConditionUpDateTimer=0,WhichPhaseHaveingProblem = 0,prvNoElePowerOfTimersec,ActSfbPrvSec,VoltageSppRecheckCounter = 0,
					VoltageSppRecheckflag=0,PrvSppTrip=0,PrvUpMotorStatus=0,PrvMSMotorStatus=0,PrvLoMotorStatus=0,PrvLocanMotorStatus=0,OnFromMobile=0,
					StaticSMSSend = 0,NumberFound=0,PowerCondCall=0,PowerOnSms=0,RegxSmsSend = 0,CallOnOfVer=0, PowerOffSMS = 0,SendSMS=0,
          NumberChangeSMS = 0,CallConnected = 0,ringflag=0;					
					 
volatile unsigned short int StatusCode=0;

int8_t    relayTimer =0;
					
int  			MotorStarterTripCount = 0,ActMotorStarterTripTimer = 0,ActDrRunTimer = 0,ActDrRunCount = 0,CurActDrRunTimer = 0,SetDrRunTimer = 0,
					CurrentSppRecheckCounter = 0,CSPPValue = 0,Mobile2Phs3Phase = 0,HighVoltageRecheck = 0,LowVoltageRecheck = 0,SmsSendOntimer = 0,
          RecheckPinCounter = 0,revalue,reTpHr,reTpMin,reTpSec,value,TpHr,TpMin,TpSec;;

uint16_t  RecheckCounterST = 0,RecheckCounterUT = 0,RecheckCounterMT = 0,RecheckCounterLT = 0,RecheckCounterLT1 = 0,RecheckCounterMT_1 = 0,
          WorkingOn3Phas = 0,OnehrPrvSec=0,Onehr_sec_timer=0,StatusSMSDelay1,StatusSMSDelay2,StrTokStrVer2=0,StrTokStrVer=0,CallErrorDelay = 0,
          NumberOfSmsAllreadySend;

uint16_t 			Tp=0,Tp1=0,Tp2=0,Tp3=0,Tp4=0,min=0,max=0,i=0,j=0;

uint8_t  (*lcd_ptr)[16];

/*UART ACK with CRC*/
const char ACK[7]="$<U>ì\r";

float     TripVoltage = 0.0,TripCurrent = 0.0,VSPPImbalanceVoltage = 0;


long 			NoElePowerOfTimer = 0,LastDayRunTimer = 0,RunTimerhr,RunTimermin,RunTimersec,RunTimer = 0,MRunTimer = 0,Runflow = 0,MRunflow = 0,
					LastDayRunflow = 0,NoElePowerOfTimerratio = 0; 

/*Remainingtime Related*/
long 			RemainingTime,RemainingCyclicOnTime,RemainingCyclicOfTime,RemainingGRTCTime,RemainingRTC1Time,RemainingRTC2Time,RemainingRTC3Time,
					RemainingRTC4Time,RemainingDrTime;

/*Struct definitions*/
struct 		MoTr nMoTr;
struct _rtc datetime;

volatile unsigned char cpbrsearchend,cpbrsearchend1,cpbrsearchend2;
static unsigned char SendLowVoltageHighVoltage = 0;
static unsigned char SendSPPLowVoltageHighVoltage = 0;
unsigned int PingHighSmsSendOntimer = 0;
unsigned int PingHighRecheckPinCounter = 0;

/*extern*/
uint8_t 	Enter=0,enter1=0,enter2=0,MakeRealyOn=0,StartByMobile=0;

int d=0;

//static uint8_t SendLowVoltageHighVoltage = 0,SendSPPLowVoltageHighVoltage = 0;

struct __SMSstrnumber
{
	char Smsstr[220];
	char Smsnumber[15];
	//char Wifistr[220];
}SmsStrNumber[25];
struct __SMSTCPstrnumber
{
	char SmsTCPstr[10];
	//char Smsnumber[15];
	//char Wifistr[220];
}SmsTCPStrNumber[25];

/*Buffers*/
char BigSMS[1100] = "TEXT";  
char BigSMS1[10] = "TEXT";
char BigSMS2[100] = "TEXT";
char TpStr[50] = "TEXT";
char Buffer1[500] = "TEXT";
char buffer[200] = "TEXT";
char StoredPhoneNumber[25][15] ={"TEXT","TEXT"};
char StoredPhoneSmscode[16][15] ={"TEXT","TEXT"};
char WhoMadeRelayOn[20]="\n";
char WhoMadeenterRelayOn[20]="\n";
int8_t DNDSMSFLAG[5];    //extern 
unsigned char TpS1tr[10]="TEXT";
unsigned char TpS2tr[10]="TEXT";
unsigned char TpS3tr[10]="TEXT";
char ServiceNumber[20] = "0000000000";
char StrTokStr2[150][20];
char StrTokStr[150][20];
volatile uint8_t lcd_row[2][16]={0};
volatile int8_t IMEI[15]={0};
char StaticSmsString[200] = "\n\r";
char PhoneNumber[20] = ""; 
char Tracebuffer[1024] ={0}; 
char SmsNumber[10][15] = {"TEXT","TEXT"}; 
char SMS_BUF[200];
char SendSMSString[350]="TEXT";
volatile int HowManySound[40];



/*Function Prototypes*/
uint8_t CheckMotor(void);
uint8_t CheckStrterTrip(void);
uint8_t CheckCurrentSpp(void);
uint8_t CheckReversePhase(void);
uint8_t Check2Phase(void);
uint8_t CheckSpp(void);
uint8_t CheckSppHys(void);
uint8_t CheckOvLoad(uint8_t Ph2Ph3);
uint8_t CheckNoLoad(uint8_t Ph2Ph3);
uint8_t CheckLowVoltage(uint8_t Ph2Ph3);
uint8_t CheckHighVoltage(uint8_t Ph2Ph3);
uint8_t CheckLowVoltageHys(uint8_t Ph2Ph3);
uint8_t CheckHighVoltageHys(uint8_t Ph2Ph3);
uint8_t CheckUpperTank(void);
uint8_t CheckLowerTank(void);
uint8_t CyclicTimerof(void);
uint8_t CyclicTimeron(void);
void FloatroString1Dig(char *String,float Number);
int FindNearsetElement(long *Pointer,int len);
unsigned char WhoIsNext(unsigned char FromWhere);
void CheckVoltageCurrent(void);
void ReadSettings(void);
void FMC_Read_Buffer(uint8_t * buffer ,uint32_t * Address,size_t size);
void checksmslimit(void);
void DrRestartTimer(void);
void set_hourly_power_data(void);
void Send_30min_Status_sms(void);
void motoron(char *phoneNumber);
void motorof(char *phoneNumber);
void runtime(void);
unsigned char CheckVoliedPhone(char *PhoneNumber);
void DTMF_Proccessor(char* dtmfbuf);
void PlayFeedbackSound(void);
void PlayFeedBackPower(void);
void CheckDigits(float Value,unsigned char Which,unsigned char *string,int *Len);
unsigned char CheckMotorStatus_Sound(void);
void copyIntArrayToCharArray(volatile int* intArray, uint32_t size, char* charArray);
int8_t SetDateTime(struct _rtc datetime);
int isValidCyclicTimerFormat(const char* timerSetting);
int isValidDRTFormat(const char* timerSetting);
void Uart_Send_Dtmf_Data(char* data); 


 
/*Function definitions*/

int isDtValidLength(const char* timerSetting) {
	   
	// Check if the length of the setting is exactly 17 characters (eg: 22/05/23/12/15/00)
    if (strlen(timerSetting) != 17)
        return 0; 

    // The format is valid
    return 1;
}

