AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
int isValidDRTFormat(const char* timerSetting) {
	   int i=0;
    // Check if the length of the setting is exactly 6 characters
    if (strlen(timerSetting) != 15)
        return 0;

    // Check if all characters are digits [scrdelay000000]
    for (i = 9; i <= 15; i++) {
        if (!isdigit(timerSetting[i]))
            return 0;
    }

    // The format is valid
    return 1;
}
 
int isValidCyclicTimerFormat(const char* timerSetting) {
	   int i=0;
    // Check if the length of the setting is exactly 6 characters
    if (strlen(timerSetting) != 4)
        return 0;

    // Check if all characters are digits
    for (i = 0; i < 4; i++) {
        if (!isdigit(timerSetting[i]))
            return 0;
    }

    // The format is valid
    return 1;
}
 
void buffer_memsets(void) {
		memset(BigSMS,NULL,sizeof(BigSMS));
		memset(BigSMS1,NULL,sizeof(BigSMS));
		memset(BigSMS2,NULL,sizeof(BigSMS2));
		memset(TpStr,NULL,sizeof(TpStr));
		memset(Buffer1,NULL,sizeof(Buffer1));
		memset(buffer,NULL,sizeof(buffer));		
		memset(StoredPhoneNumber,NULL,sizeof(StoredPhoneNumber));		
		memset(StoredPhoneSmscode,NULL,sizeof(StoredPhoneSmscode));		
		memset(StoredPhoneSmscode,NULL,sizeof(StoredPhoneSmscode));		
		memset(WhoMadeenterRelayOn,NULL,sizeof(WhoMadeenterRelayOn));		
		memset(DNDSMSFLAG,NULL,sizeof(DNDSMSFLAG));		
		memset(StrTokStr2,NULL,sizeof(StrTokStr2));		
		memset(StrTokStr,NULL,sizeof(StrTokStr));		
		memset((void *)IMEI,NULL,sizeof(IMEI));		
		memset((void *)lcd_row,NULL,sizeof(lcd_row));		
		memset(Tracebuffer,NULL,sizeof(Tracebuffer));		
		memset(SmsNumber,NULL,sizeof(SmsNumber));		
		memset(StaticSmsString,NULL,sizeof(StaticSmsString));		
		memset(PhoneNumber,NULL,sizeof(PhoneNumber));		
		memset(SendSMSString,NULL,sizeof(SendSMSString));		
		memset(SMS_BUF,NULL,sizeof(SMS_BUF));		
		memset((void *)HowManySound,NULL,sizeof(HowManySound));	
}
void copyIntArrayToCharArray(volatile int* intArray, uint32_t size, char* charArray) {
    
	uint32_t i=0;
	for ( i = 0; i < size; i++) {
        charArray[i] = (char)intArray[i];
    }
}
unsigned char CheckMotorStatus_Sound(void) {
			if(nSTATE_MOTOR == STATE_MOTOR_TRIP_LOWVOLTAGE)
			{
						PlaySound =1;
						PlayNumber=LOWVOLTAGE;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_HIGHVOLTAGE)
			{
						PlaySound =1;
						PlayNumber=HIGHVOLTAGE;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_SPP)
			{
						PlaySound =1;
						PlayNumber=SPPOFF;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_CURRENTSPP)
			{
						PlaySound =1;
						PlayNumber=CUNRSPPOFF;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_STARTER)
			{
						PlaySound =1;
						PlayNumber=STOFF;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_DRYRUN)
			{
						PlaySound =1;
						PlayNumber=NLOFF;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						if(nTimerSettings.DrReOnOf == 1)
						{
							PlaySound =1;
							PlayNumber=DRYRUNTIMER;
							HowManySound[HowManySoundToPlay] = PlayNumber;
							HowManySoundToPlay++;
						}
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_OVERLOAD)
			{
						PlaySound =1;
						PlayNumber=OVLOAD;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_LOWPRESS)
			{
						PlaySound =1;
						PlayNumber=UPPERTANK;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_HIGHPRESS)
			{
						PlaySound =1;
						PlayNumber=UPPERTANK;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_UPPERTANK)
			{
						PlaySound =1;
						PlayNumber=UPPERTANK;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_LOWERTANK)
			{
						PlaySound =1;
						PlayNumber=SUMPTANK;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_MAXTIME)
			{
						PlaySound =1;
						PlayNumber=MAXTIMEROFF;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			else if(nSTATE_MOTOR == STATE_MOTOR_TRIP_OFFDELAY)
			{
						PlaySound =1;
						PlayNumber=CYCLICOF;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						return 1;
			}
			return 0;

}
void CheckDigits(float Value,unsigned char Which,unsigned char *string,int *Len) {
    char TpStr[20];
    int Tp;
    //int len;
    if(Which == 1)
    {
				FloatroString1Dig(TpStr,Value);
    }
		else if(Which == 2)
    {
				sprintf(TpStr,"%02.0f",Value);
    }
    else
    {
				sprintf(TpStr,"%03.0f",Value);

    }
    *Len = strlen(TpStr)-1;
    for(Tp = 0; Tp<=*Len;Tp++)
    {
          if(TpStr[Tp] != '.')
							string[Tp] =  TpStr[Tp] - '0';
          else
              string[Tp] = 10;

    }
}
void PlayFeedBackPower(void) {

	unsigned char TpStr[20];
	int len;
	int Tp;
	
	if(VoicePowerCondition == 0)
	{
	
		PlaySound =1;
		PlayNumber=SOVOLT;	
		HowManySound[HowManySoundToPlay] = PlayNumber;
		HowManySoundToPlay++;

		CheckDigits(nCurretnCond.BRVoltage,0,TpStr,&len);
		
		for(Tp=0;Tp<=len;Tp++)
		{
			Debug("\r\n*****TpStr[%d] = %d  len = %d*****\n\r",Tp,TpStr[Tp],len);
			
			switch(TpStr[Tp])
			{
				case 0:
					PlayNumber=SO0;	
					break;
				case 1:
					PlayNumber=SO1;	
					break;
				case 2:
					PlayNumber=SO2;	
					break;
				case 3:
					PlayNumber=SO3;	
					break;
				case 4:
					PlayNumber=SO4;	
					break;
				case 5:
					PlayNumber=SO5;	
					break;
				case 6:
					PlayNumber=SO6;	
					break;
				case 7:
					PlayNumber=SO7;	
					break;
				case 8:
					PlayNumber=SO8;	
					break;
				case 9:
					PlayNumber=SO9;	
					break;	
				case 10:
					PlayNumber=DECIMAL;	
					break;
				default:
					PlayNumber=SO9;	
					break;							
			}						
			HowManySound[HowManySoundToPlay] = PlayNumber;
			HowManySoundToPlay++;
		}
		
