AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
		PlayNumber=THISVOLT;	
		HowManySound[HowManySoundToPlay] = PlayNumber;
		HowManySoundToPlay++;
		
		PlayNumber=SOCURRENT;	
		HowManySound[HowManySoundToPlay] = PlayNumber;
		HowManySoundToPlay++;
		
		
		CheckDigits(nCurretnCond.Bcurrent,1,TpStr,&len);
		
		for(Tp=0;Tp<=len;Tp++)
		{
			Debug("\r\n*****TpStr[%d] = %d  len = %d*****\n\r",Tp,TpStr[Tp],len);
			PlaySound =1;
			switch(TpStr[Tp])
			{
				case 0:
					PlayNumber=SO0;	
					break;
				case 1:
					PlayNumber=SO1;	
					break;
				case 2:
					PlayNumber=SO2;	
					break;
				case 3:
					PlayNumber=SO3;	
					break;
				case 4:
					PlayNumber=SO4;	
					break;
				case 5:
					PlayNumber=SO5;	
					break;
				case 6:
					PlayNumber=SO6;	
					break;
				case 7:
					PlayNumber=SO7;	
					break;
				case 8:
					PlayNumber=SO8;	
					break;
				case 9:
					PlayNumber=SO9;	
					break;	
				case 10:
					PlayNumber=DECIMAL;	
					break;
				default:
					PlayNumber=SO9;	
					break;							
			}						
			HowManySound[HowManySoundToPlay] = PlayNumber;
			HowManySoundToPlay++;
		}
		PlayNumber=THISCUR;	
		HowManySound[HowManySoundToPlay] = PlayNumber;
		HowManySoundToPlay++;
	}
	
}
void PlayFeedbackSound(void) {

	unsigned char checkpower;
	//unsigned char TpStr[20];
	//int len;
	//int Tp;

	switch(nSTATE_STATUS_SMS)
	{
		case STATUS_MOTOROF_SMS:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						PlaySound =1;
						PlayNumber=STARTEDRUN;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						PlaySound =1;
						PlayNumber=OFFCOND;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
			case STATUS_MOTOR_ON_TARGET:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						PlaySound =1;
						PlayNumber=STARTEDRUN;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						PlaySound =1;
						PlayNumber=OFFCOND;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					default:
					{
						PlaySound =1;
						PlayNumber=OFFCOND;	
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;					
						break;
					}
					
					
					
				}	


				PlaySound =1;
				PlayNumber=STARTEDRUN;							//should be target on
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
				
			}
			break;
		case STATUS_MOTOR_OFF_TARGET:
			{
				PlaySound =1;
				PlayNumber=MOBILEOFF;					//should be target off
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
			}
			break;
					default:
					{
						PlaySound =1;
						PlayNumber=OFFCOND;	
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;					
						break;
					}
					
					
					
				}								
				
			}
			break;
		case STATUS_NO_ELECTRICICY:
			{
				PlaySound =1;
				PlayNumber=NOELECTRICITY;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
			}
			break;
		case STATUS_ON_RESTART_NOLOAD:
			{
				
			}
			break;
		case STATUS_MOTOR_STARTER_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=STOFF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
			}
			break;
		case STATUS_MOTOR_TRIP_HIGHPRESS:
		    {
				PlaySound =1;
				PlayNumber=UPPERTANK;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
			}
			break;
        case STATUS_MOTOR_TRIP_LOWPRESS:
           {
				PlaySound =1;
				PlayNumber=UPPERTANK;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
			}
			break;		
		case STATUS_MOTOR_UPPERTANK_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=UPPERTANK;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
			}
			break;
		case STATUS_MOTOR_LOWERTANK_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=SUMPTANK;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
			}
			break;
		case STATUS_MOTOR_DRYRUN_TRIP_SMS:	
			{
				PlaySound =1;
				PlayNumber=NLOFF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
				if(nTimerSettings.DrReOnOf == 1)
				{
				PlaySound =1;
				PlayNumber=DRYRUNTIMER;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
				
				}
			}
			break;						
		case STATUS_MOTOR_TRIP_OVERLOAD:	
			{
				PlaySound =1;
				PlayNumber=OVLOAD;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;	
		case STATUS_MOTOR_TRIP_SPP:
			{
				PlaySound =1;
				PlayNumber=SPPOFF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;	
		case STATUS_MOTOR_TRIP_REVERSEPHASE:
			{
				PlaySound =1;
				PlayNumber=REVERSEOFF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;
		case STATUS_MOTOR_TRIP_CURRENTSPP:
			{
				PlaySound =1;
				PlayNumber=CUNRSPPOFF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;
		case STATUS_MOTOR_TRIP_LOWVOLTAGE:
			{
				PlaySound =1;
				PlayNumber=LOWVOLTAGE;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;	
		case STATUS_MOTOR_TRIP_HIGHVOLTAGE:
			{
				PlaySound =1;
				PlayNumber=HIGHVOLTAGE;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;
           case STATUS_MOTOR_GRTCOF_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=RCTOF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
					
