AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			}
			break;	
					
		case STATUS_MOTOR_RTCOF1_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=RCTOF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
					
			}
			break;	
		case STATUS_MOTOR_RTCOF2_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=RCTOF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;	
		case STATUS_MOTOR_RTCOF3_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=RCTOF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;	
		case STATUS_MOTOR_RTCOF4_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=RCTOF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;
		case STATUS_MOTOR_CYCLIC_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=CYCLICOF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;
		case STATUS_MOTOR_VCYCCOMPLE_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber = DRIPCYC;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;
			
		case STATUS_MOTOR_NOCOMMUNICATION_TRIP_SMS:
				{
						PlaySound =1;
						PlayNumber = DRIPCYC;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;	
				}
			break;
		case STATUS_MOTOR_MAX_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=MAXTIMEROFF;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;
		case STATUS_MOTOR_ON_SWITCH_TRIP_SMS:
			{
				PlaySound =1;
				PlayNumber=OFFCOND;
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
				 
			}
		  break;
		case STATUS_MOTOR_ON_DEFAULT:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
							
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
										
						break;
					}				
				}
				PlaySound =1;
				PlayNumber=MOBILEON;	
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;		
				
				PlaySound =1;
				PlayNumber=RUNNINGGOOD;	
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			}
			break;
		case STATUS_MOTOR_ON_ONDELAY:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				
				PlaySound =1;
				PlayNumber=CYCLICON;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
				
				PlaySound =1;
				PlayNumber=RUNNINGGOOD;	
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
				
			}
			break;

		case STATUS_MOTOR_ON_SWITCH:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				PlaySound =1;
				PlayNumber=AUTOSWON;
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
				
				PlaySound =1;
				PlayNumber=RUNNINGGOOD;	
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
			
			}
			break;
			case STATUS_MOTOR_ON_GRTC:
			{	
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				
				PlaySound =1;
				PlayNumber=RCTON;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
				
				if(CheckMotorStatus_Sound() == 0)
				{
					PlaySound =1;
					PlayNumber=RUNNINGGOOD;	
					HowManySound[HowManySoundToPlay] = PlayNumber;
					HowManySoundToPlay++;
				}
				
			}
			break;
		
		case STATUS_MOTOR_ON_RTC1:
			{	
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				
