AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
				PlaySound =1;
				PlayNumber=RCTON;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
				
				if(CheckMotorStatus_Sound() == 0)
				{
					PlaySound =1;
					PlayNumber=RUNNINGGOOD;	
					HowManySound[HowManySoundToPlay] = PlayNumber;
					HowManySoundToPlay++;
				}
				
			}
			break;
		case STATUS_MOTOR_ON_RTC2:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				
				PlaySound =1;
				PlayNumber=RCTON;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
				
				if(CheckMotorStatus_Sound() == 0)
				{
					PlaySound =1;
					PlayNumber=RUNNINGGOOD;	
					HowManySound[HowManySoundToPlay] = PlayNumber;
					HowManySoundToPlay++;
				}
				
			}
			break;
		case STATUS_MOTOR_ON_RTC3:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				
				PlaySound =1;
				PlayNumber=RCTON;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
				
				if(CheckMotorStatus_Sound() == 0)
				{
					PlaySound =1;
					PlayNumber=RUNNINGGOOD;	
					HowManySound[HowManySoundToPlay] = PlayNumber;
					HowManySoundToPlay++;
				}
				
			}
			break;
		case STATUS_MOTOR_ON_RTC4:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				
				PlaySound =1;
				PlayNumber=RCTON;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;		
				
				if(CheckMotorStatus_Sound() == 0)
				{
					PlaySound =1;
					PlayNumber=RUNNINGGOOD;	
					HowManySound[HowManySoundToPlay] = PlayNumber;
					HowManySoundToPlay++;
				}
				
			}
			break;
		case STATUS_MOTOR_ON_UPPERTANK:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				
				PlaySound =1;
				PlayNumber=RUNNINGGOOD;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
				
			}
			break;
		case STATUS_MOTOR_ON_LOWERTANK:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				
				PlaySound =1;
				PlayNumber=RUNNINGGOOD;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;	
				
			}
			break;
		case STATUS_MOTOR_ON_RESTARTTIMER:
			{
				switch(nSTATE_STATUS_ONDELAY_SD)
				{
					case STATUS_MOTOR_AT_POWERONDELAY:
					{
						PlaySound =1;
						PlayNumber=PODL;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
						break;
					}
					case STATUS_MOTOR_AT_STARDELTA:
					{
						PlaySound =1;
						PlayNumber=PODL;		
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;				
						break;
					}
					case STATUS_MOTOR_ON_PROPERLY:
					{
						
						break;
					}
					case STATUS_MOTOR_AT_OFF:
					{
						
						break;
					}
					default:
					{
									
						break;
					}				
				}
				
				PlaySound =1;
				PlayNumber=RUNNINGGOOD;		
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
				
			}
			break;
		default:
			{
				
			}
			break;
	}
	if(nSTATE_STATUS_SMS != STATUS_NO_ELECTRICICY)
	{
		checkpower=Check2Phase();
		if(checkpower == 3)
		{
			PlaySound =1;
			PlayNumber=PH3PRESENT;		
			HowManySound[HowManySoundToPlay] = PlayNumber;
			HowManySoundToPlay++;
		}
		else
		{
			PlaySound =1;
			PlayNumber=PH2PRESENT;		
			HowManySound[HowManySoundToPlay] = PlayNumber;
			HowManySoundToPlay++;
		}
	}
}
void DTMF_Proccessor(char* dtmfbuf) {
	#if 0
	    char ivrsbuf[15]={0};	
      			
	    memcpy(ivrsbuf,dtmfbuf,10);
      Debug("\n[%s]",dtmfbuf);
	    Debug("\n[%s]",ivrsbuf);
			if(strstr(ivrsbuf,"+rxdtmf: #")!=0)
			{   
					char charArray[50]={0};
					uint32_t size = sizeof(HowManySound)/ sizeof(HowManySound[0]);
				
					Debug("\n+RXDTMF: #"); 
				
