AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
					HowManySoundToPlay = 0;
					HowManySoundPlayed = 0;
					PlaySound = 0;
					PlaySound =1;

					PlayNumber=WELCOME;
					HowManySound[HowManySoundToPlay] = PlayNumber;
					HowManySoundToPlay++;							 
					PlayFeedbackSound();								 									
					PlayNumber=THANKS;
					HowManySound[HowManySoundToPlay] = PlayNumber;
					HowManySoundToPlay++;
					/*sending the audio file number to modem*/
					copyIntArrayToCharArray(HowManySound, size, charArray);
					Debug(charArray);
          /*sending array on UART0(modem uart)*/	
           Uart_Send_Dtmf_Data(charArray);					
					//printf("#%s;",charArray);
					
			}
			if(strstr(ivrsbuf,"+rxdtmf: 8")!=0)
			{    
				char charArray[50]={0};
				uint32_t size = sizeof(HowManySound)/ sizeof(HowManySound[0]);
				Debug("\n+RXDTMF: 8");						 
				checkpower=Check2Phase();
				HowManySoundToPlay = HowManySoundPlayed = 0;
				PlaySoundVer=0;
				PlaySound = 0;
				memset((void *)&HowManySound,0,sizeof(HowManySound));
				//DTmfValue = 0;
				//nTimerSettings.Drrestartpoweronof=0; 
				
				if(MakeRealyOn == 0)
				{
					MotorStarterTripCount = 0;
					OverAllStarterTrip = 0;
					ActMotorStarterTripTimer =0;
					MakeRealyOn = 1; 	StartByMobile = 1; OnFromMobile = 1;nMoTr.ActMaxRunTimer=0;
					NowOff = 0;
					if(PowerCurrentCondition == 0)
					{
						if(checkpower == 2  )
						{
							if (nTimerSettings.AutoStIIOnOff == 0 || Mobile2Phs3Phase == 3)
							{
								PlaySound =1;
								PlayNumber=PH3ON;
								HowManySound[HowManySoundToPlay] = PlayNumber;
								HowManySoundToPlay++;
							}
							else
							{
								NowOff = 0;
								NowStarted = 1;
								PlaySound =1;
								PlayNumber=STARTEDRUN;
								HowManySound[HowManySoundToPlay] = PlayNumber;
								HowManySoundToPlay++;
							}

						}
						else
						{
								NowOff = 0;
								NowStarted = 1;
								PlaySound =1;
								PlayNumber=STARTEDRUN;
								HowManySound[HowManySoundToPlay] = PlayNumber;
								HowManySoundToPlay++;
						}
					}
					else
					{
								NowOff = 0;
								NowStarted = 1;
								PlaySound =1;
								PlayNumber=STARTEDRUN;
								HowManySound[HowManySoundToPlay] = PlayNumber;
								HowManySoundToPlay++;
					}
					
					CLK_SysTickLongDelay(5000000); 
					/*sending the audio file number to modem*/				
					copyIntArrayToCharArray(HowManySound, size, charArray);
					Debug(charArray);
					/*sending array on UART0(modem uart)*/
					Uart_Send_Dtmf_Data(charArray);
					//printf("#%s;",charArray); 
					
					WriteSettingsFile();
				}
				else
				{
					if(NowStarted ==1)
					{
								PlaySound =1;
								PlayNumber=STARTEDRUN;
								HowManySound[HowManySoundToPlay] = PlayNumber;
								HowManySoundToPlay++;
					}
					else
					{
						if(PowerCurrentCondition == 0)
						{
						   if(checkpower == 2 )
						   {
								if (nTimerSettings.AutoStIIOnOff == 0 || Mobile2Phs3Phase == 3)
								{
									PlaySound =1;
									PlayNumber=PH3ON;
									HowManySound[HowManySoundToPlay] = PlayNumber;
									HowManySoundToPlay++;

								}
								else
								{
									PlayFeedbackSound();
								}
							}
							else
							{
								PlayFeedbackSound();
							}
						}
						else
						{
							if(PowerCurrentCondition == 1)
							{
								PlaySound =1;
								PlayNumber=NOELECTRICITY;
								HowManySound[HowManySoundToPlay] = PlayNumber;
								HowManySoundToPlay++;

							}
							else
							{
								PlayFeedbackSound();
							}
						}
					}
					CLK_SysTickLongDelay(5000000); 
					/*sending the audio file number to modem*/				
					copyIntArrayToCharArray(HowManySound, size, charArray);
					Debug(charArray);
					/*sending array on UART0(modem uart)*/
					Uart_Send_Dtmf_Data(charArray);
					//printf("#%s;",charArray); 
				}
				strcpy(WhoMadeRelayOn,WhoMadeenterRelayOn);	
				
			}  
			if(strstr((char *)ivrsbuf,"+rxdtmf: 9") !=0)
			{
				char charArray[50]={0};
				uint32_t size = sizeof(HowManySound)/ sizeof(HowManySound[0]);
				
				Debug("\n+RXDTMF: 9");						 
				HowManySoundToPlay = HowManySoundPlayed = 0;
				PlaySoundVer=0;
				PlaySound = 0;
				memset((void*)&HowManySound,0,sizeof(HowManySound));
				//DTmfValue = 0;		 
				
				if(MakeRealyOn == 1)
				{
					MotorStarterTripCount = 0;
					OverAllStarterTrip = 0;
					ActMotorStarterTripTimer =0;
					//nTimerSettings.Driprestartpoweronof=0;
					NowOff = 1;
					NowStarted = 0;
					OffMotorByPhone = 1;
					MakeRealyOn = 0;
					OnByTarget=0;
					livedataflagcount1=0;livedataflag1=1;					 
					if(nMSettings.SumpOnOff == 1)
					PrvLoMotorStatus=0;
					PrvUpMotorStatus=0;
					nCYCTimer = NO_TCOND;
					NoAcceptSMS=0;
					StartByMobile = 0;
					OnFromMobile = 0;
					nMoTr.ActMaxRunTimer=0;
					PlaySound =1;
					PlayNumber=MADEMOTOROFF;
					//PrvOnOff = 0;
					PreviousTrip = NO_TRIP_FLAG;
					HowManySound[HowManySoundToPlay] = PlayNumber;
					HowManySoundToPlay++;
					strcpy(WhoMadeRelayOn,WhoMadeenterRelayOn);
					//dtmfDebounceDelay=1;
					
					CLK_SysTickLongDelay(5000000); 
					/*sending the audio file number to modem*/				
					copyIntArrayToCharArray(HowManySound, size, charArray);
					Debug(charArray);
					/*sending array on UART0(modem uart)*/
					Uart_Send_Dtmf_Data(charArray);
					//printf("#%s;",charArray); 
					
					WriteSettingsFile();					 
				}
				else
				{
					if(NowOff == 1)
					{
						PlaySound =1;
						PlayNumber=MADEMOTOROFF;
						HowManySound[HowManySoundToPlay] = PlayNumber;
						HowManySoundToPlay++;
					}
					else
					{
						PlayFeedbackSound();
					}
					
					CLK_SysTickLongDelay(5000000); 
					/*sending the audio file number to modem*/
					copyIntArrayToCharArray(HowManySound, size, charArray);
					Debug(charArray);
					/*sending array on UART0(modem uart)*/
					Uart_Send_Dtmf_Data(charArray);
					//printf("#%s;",charArray); 

				} 
				  
			  
			}
			else if(strstr((char *)dtmfbuf,"+rxdtmf: 7") !=0 && CallConnected == 0)
			{ 
				char charArray[50]={0};
				uint32_t size = sizeof(HowManySound)/ sizeof(HowManySound[0]);
				
				Debug("\n+RXDTMF: 7");					 
				HowManySoundToPlay = HowManySoundPlayed = 0;
				PlaySoundVer=0;
				PlaySound = 0;
				memset((void *)&HowManySound,0,sizeof(HowManySound));
				PlayFeedbackSound();
				/*sending the audio file number to modem*/				
				copyIntArrayToCharArray(HowManySound, size, charArray);
				Debug(charArray);
				/*sending array on UART0(modem uart)*/
				Uart_Send_Dtmf_Data(charArray);
				//printf("#%s;",charArray);
				
