AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			}				     
			else if(strstr((char *)dtmfbuf,"+rxdtmf: *") !=0)
			{ 
        char charArray[50]={0};
				uint32_t size = sizeof(HowManySound)/ sizeof(HowManySound[0]);
   			
				Debug("\n+RXDTMF: *");
				HowManySoundToPlay = HowManySoundPlayed = 0;
				PlaySoundVer=0;
				PlaySound = 0;
				memset((void *)&HowManySound,0,sizeof(HowManySound));
				PlayFeedBackPower();
				/*sending the audio file number to modem*/
				copyIntArrayToCharArray(HowManySound, size, charArray);
				Debug(charArray);
				/*sending array on UART0(modem uart)*/
				Uart_Send_Dtmf_Data(charArray);
				//printf("#%s;",charArray);

				
			}
			else if(strstr((char *)dtmfbuf,"+rxdtmf: 2") !=0)
			{					 	 
				Debug("\n+RXDTMF: 2");
				HowManySoundToPlay = HowManySoundPlayed = 0;
				PlaySoundVer=0;
				PlaySound = 0;
				Mobile2Phs3Phase = 2;
				WriteSettingsFile();
				PlaySound =1;
				PlayNumber=PH2PH3ON;
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
				 
			}
			else if(strstr((char *)dtmfbuf,"+rxdtmf: 3") !=0)
			{				
				Debug("\n+RXDTMF: 3");
				HowManySoundToPlay = HowManySoundPlayed = 0;
				PlaySoundVer=0;
				PlaySound = 0;
				Mobile2Phs3Phase = 3;
				WriteSettingsFile();
				PlaySound =1;
				PlayNumber=PH3ON;
				HowManySound[HowManySoundToPlay] = PlayNumber;
				HowManySoundToPlay++;
				// WriteSettingsFile();					
				 
			}
			#endif	 	
}
unsigned char CheckVoliedPhone(char *PhoneNumber) {
	int Len;
	int i;
	Len = strlen(PhoneNumber);
	for(i=0;i<=Len;i++)
	{
		if(PhoneNumber[i]>'0' && PhoneNumber[i]<='9')
			return 1;
	}
	return 0;


}
void runtime(void) {		 
		//int Tp;
		long value;
		long TpHr;
		long TpMin;
		long TpSec;
		value = MRunTimer;         //This will clear when motor start again
		TpHr = value/3600;
		value = value%3600;
		TpMin = value/60;
		value = value%60;
		TpSec = value;
		/*Motor Previous total runtime it will clear after motor start*/
		RunTimerhr =TpHr;
		RunTimermin =TpMin;
		RunTimersec =TpSec;
}
void Debug(const char *format, ...) {
    va_list ap;       
    memset(Tracebuffer,NULL,sizeof(Tracebuffer));
    va_start(ap, format);
    vsnprintf(Tracebuffer,1024, format, ap);
    va_end(ap);
    debug(Tracebuffer,strlen(Tracebuffer));   
} 

void debug(char* data ,int len) {  
	size_t packet_size= len;//strlen(data);	
  size_t i;		 
	i=0;
	while(packet_size--)
	{
	   UART_WRITE(UART1, data[i++]);
		 delaym(500);
	} 
	//sending footer after CRC 
		UART_WRITE(UART1,'\n');

}
void Uart_Send_with_crc(char* data) {
	 
	size_t data_size = strlen(data);
	size_t i;
	size_t packet_size;
	uint8_t crc = crc8(data, data_size);
	data[data_size] = crc;
	packet_size = data_size + 1; // Data size plus CRC8 byte 
	
	//sending Header   
	  UART_WRITE(UART0,'$');
	
	// Send the packet through UART
	for (i = 0; i < packet_size; i++)
    UART_WRITE(UART0, data[i]);
	
	//sending footer after CRC 
	  UART_WRITE(UART0,'\r');

}
void Uart_Send_Dtmf_Data(char* data) {
	 
	size_t data_size = strlen(data);
	size_t i; 
	//sending Header    
	  UART_WRITE(UART0,'#');
	
	// Send the packet through UART
	for (i = 0; i < data_size; i++)
    UART_WRITE(UART0, data[i]);
	
	//sending footer after CRC 
	  UART_WRITE(UART0,';');

}
void motoron(char *phoneNumber) {
		if(MakeRealyOn==0)
		{
			MotorStarterTripCount = 0;
			OverAllStarterTrip = 0;
			ActMotorStarterTripTimer =0;
			nTimerSettings.Drrestartpoweronof=0;  
			strcpy(WhoMadeRelayOn,phoneNumber);
			Debug("WHO[%s]",WhoMadeRelayOn);			 
			MakeRealyOn = 1; 
			StartByMobile = 1;                                     
			OnFromMobile = 1;                                       
			nMoTr.ActMaxRunTimer=0;  
			//PrvOnOff = 0;
			// PrintfResp("\n\rMotor On \n\r");
			// PrintfResp("\n\rSMS SEND NOW\n\r");
			//strcpy(WhoMadeRelayOn,Recive_Sms_Number);

			checkpower=Check2Phase();

			if(PowerCurrentCondition == 1)
			{
					sprintf(StaticSmsString," %02d066\n",(datetime.tm_sec+2));
					if(nMSettings.gethidesmsonoff == 1)
					sprintf(StaticSmsString,"%sMOBILE ON BY : +91%s0\n\rPOWER OFF\n\rMOTOR OFF\n",StaticSmsString,WhoMadeRelayOn);
					else
						sprintf(StaticSmsString,"%sMOBILE ON BY %s\n\rPOWER OFF\n\rMOTOR OFF\n",StaticSmsString,WhoMadeRelayOn);
					sprintf(StaticSmsString,"%s MOTOR CAN'T START BEACUSE NO ELECTRICITY",StaticSmsString);
					StaticSMSSend = 1;
			}
			else if(checkpower == 2 )
			{
					if (nTimerSettings.AutoStIIOnOff == 0 || Mobile2Phs3Phase == 3)
					{
						sprintf(StaticSmsString," %02d028\n",(datetime.tm_sec+2));
						if(nMSettings.gethidesmsonoff == 1)
							sprintf(StaticSmsString,"%sMOBILE ON BY : +91%s0\n\rPOWER ON\n\rMOTOR OFF\n",StaticSmsString,WhoMadeRelayOn);
						else
							sprintf(StaticSmsString,"%sMOBILE ON BY %s\n\rPOWER ON\n\rMOTOR OFF\n",StaticSmsString,WhoMadeRelayOn);
						sprintf(StaticSmsString,"%s MOTOR CAN'T START BEACUSE 3 PHASE SELECTION ONLY",StaticSmsString);
						StaticSMSSend = 1;
					}
			}
        // WriteonofFile();
			     WriteSettingsFile();
		}

}
void motorof ( char *phoneNumber) {
		if(MakeRealyOn==1)
		{
			OnByTarget = 0;
			MotorStarterTripCount = 0;
			OverAllStarterTrip = 0;
			ActMotorStarterTripTimer =0;
			strcpy(WhoMadeRelayOn,phoneNumber);
			NoAcceptSMS=0;
			MakeRealyOn = 0;	StartByMobile = 0; OnFromMobile = 0;
			livedataflagcount1=0;livedataflag1=1;
			nMoTr.ActMaxRunTimer=0;
			nCYCTimer = NO_TCOND;
			OffMotorByPhone = 1;
			Debug("\n\rMotor OFF \n\r");
			Debug("\n\rSMS SEND NOW\n\r");
			//  strcpy(WhoMadeRelayOn,Recive_Sms_Number);
			//PrvOnOff = 0;
			if(nMSettings.SumpOnOff == 1)
			PrvLoMotorStatus=0;
			PrvUpMotorStatus=0;
			//if(nVaTr.cyclecompleted==1)
			//nDripSettings.startcontrol=1;
			//nVaTr.cyclecompleted=0;
			//nVaTr.no_fbk_flag=0;
			//dripcycledate=0;
			//dripcyclecount=0;
			//nTimerSettings.Driprestartpoweronof=0;
			PreviousTrip = NO_TRIP_FLAG;
			//if(nVaTr.REMTIM<=180)
			//{nVaTr.REMTIM=180;
			// sprintf(buf,"\n\r nVaTr.REMTIM %d on\n\r",nVaTr.REMTIM);
			//}
	
	

			if(PowerCurrentCondition == 1)
			{
				if(nMSettings.gethidesmsonoff == 1)
					sprintf(StaticSmsString,"MOBILE OFF BY : +91%s0\n\rPOWER OFF\n\rMOTOR OFF\n",WhoMadeRelayOn);
				else
					sprintf(StaticSmsString,"MOBILE OFF BY %s\n\rPOWER OFF\n\rMOTOR OFF\n",WhoMadeRelayOn);
				//by ajith	
				//StaticSMSSend = 1;
			}
			else if(checkpower == 2 )
			{
				if (nTimerSettings.AutoStIIOnOff == 0 || Mobile2Phs3Phase == 3)
				{

				 if(nMSettings.gethidesmsonoff == 1)
					 sprintf(StaticSmsString,"MOBILE OFF BY : +91%s0\n\rPOWER OFF\n\rMOTOR OFF\n",WhoMadeRelayOn);
				 else
					sprintf(StaticSmsString,"MOBILE OFF BY %s\n\rPOWER OFF\n\rMOTOR OFF\n",WhoMadeRelayOn);
					//by ajith
				  //StaticSMSSend = 1;
				}

