AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			}
			//WriteonofFile();
			WriteSettingsFile();
		}

}
void checkkeypress(void) {	    
//    if(KEY1==0 && keydebounceflag == 0)
//	 { 
//		  keydebounceflag=1;
//			SubPage = 0;
//			Page = 9;
//			Displaydelay = 20;
//	 }
	  //Debug("\n\r KEY:%d,Page:%d",KEY1,Page);
	  if(KEY1 == 0 && keydebounceflag == 0)
	 { 
		 keydebounceflag=1;
		// Page++;
		 //if(Page>=10) 
      SubPage = 0;		 
			Page = 9;
      Displaydelay = 25;		 
	 }
//	 else if(KEY3 == 0 && keydebounceflag == 0)
//	 { 
//		 keydebounceflag=1;
//		 Page--;
// 		 if(Page<=0)
//			Page = 0;
//	 }
//	 else if(KEY4 == 0 && keydebounceflag == 0 )
//	 {  
//		   keydebounceflag=1;
//		   SetToGreenFlag = 1;
//	 }  
	 
	 /*to change the Keybounce delay modify this value*/
	 if(keydebouncecnt++ >= 2)    
	 {
	   keydebounceflag=0;
		 keydebouncecnt=0;
	 }
	 
	   
}
void print_lcd(volatile uint8_t (*lcd_ptr)[16]) {
	lcd_goto(1,0);
	lcd_puts((uint8_t *)&lcd_ptr[0]);					//prints the first row of 2d					
	lcd_goto(2,0);
  lcd_ptr++;	                           //inc the address to the next row 
	lcd_puts((uint8_t *)lcd_ptr);         //Debug the second row of 2d
}
unsigned int myatoi(char *s) {
        unsigned int a = 0;
        char c;
        while ((c = *s++) != '\0')
		{
			if(c >= '0' && c<='9')
				a = a*10 + (c - '0');
        }
        return a;
}

double myatof( char *s) {
        double a = 0.0;
        int e = 0;
        int c;
        while ((c = *s++) != '\0')
		{
			if(c >= '0' && c<='9')
				a = a*10.0 + (c - '0');
			else
				break;
        }
        if (c == '.')
		{
                while ((c = *s++) != '\0')
				{
					if(c >= '0' && c<='9')
					{
                        a = a*10.0 + (c - '0');
                        e = e-1;
					}
					else
						break;
                }
        }
        if (c == 'e' || c == 'E')
		{
                int sign = 1;
                int i = 0;
                c = *s++;
                if (c == '+')
                        c = *s++;
                else if (c == '-') {
                        c = *s++;
                        sign = -1;
                }
                while (c >= '0' && c<='9')
				{
                        i = i*10 + (c - '0');
                        c = *s++;
                }
                e += i*sign;
        }
        while (e > 0)
		{
                a *= 10.0;
                e--;
        }
        while (e < 0)
		{
                a *= 0.1;
                e++;
        }
        return a;
}
void prodset(void) {                                  /*prodset-program default settings(Factory Settings)*/

	            Debug("\nEntry to prodset\n");            
	            Appmodeon=1;							 
							nTimerSettings.PoScrDlHr=0;
							nTimerSettings.PoScrDlMin=0;
							nTimerSettings.PoScrDlSec=0;
							nMSettings.gethidesmsonoff=0;
							nMSettings.SMSOnOff = 0;
							nMSettings.staticSMSOnOff = 0;
							nMSettings.SfbOnOff = 0;
							//nMSettings.PressureOnOff =0;
							nMSettings.ManualswitchOnOff = 0;
							nMSettings.TankOnOff = 0;
							nMSettings.SumpOnOff = 0;
							nMSettings.DryRunOnOff = 0;
							nMSettings.TargetOnOff = 0;
							nMSettings.VBFOnOff = 0;
							nMSettings.RelayControlOnCall = 0;
							nMSettings.SecOnOf = 0;


							nTimerSettings.POnHr = 0;
							nTimerSettings.POnMin = 0;
							nTimerSettings.POnSec = 0;
							nTimerSettings.SDHr = 0;
							nTimerSettings.SDMin = 0;
							nTimerSettings.SDSec = 0;
							nTimerSettings.SfbHr = 0;
							nTimerSettings.SfbMin = 0;
							nTimerSettings.SfbSec = 0;

							nTimerSettings.DrReOnOf = 0;
							nTimerSettings.DrReHr = 0;
							nTimerSettings.DrReMin = 0;
							nTimerSettings.DrReSec = 0;
							nTimerSettings.DrScOnOf = 0;
							nTimerSettings.DrScHr = 0;
							nTimerSettings.DrScMin = 0;
							nTimerSettings.DrScSec = 0;
							nTimerSettings.MaxRnOnOf = 0;
							nTimerSettings.MaxRnHr = 0;
							nTimerSettings.MaxRnMin = 0;
							nTimerSettings.MaxRnSec = 0;
							nTimerSettings.CycLicOnOf = 0;
							nTimerSettings.CycLicOnHr = 0;
							nTimerSettings.CycLicOnMin = 0;
							nTimerSettings.CycLicOnSec = 0;
							nTimerSettings.CycLicOfHr = 0;
							nTimerSettings.CycLicOfMin = 0;
							nTimerSettings.CycLicOfSec = 0;
							nTimerSettings.RTCOnOf = 0;
								for(i=1;i<5;i++)
							{
							nTimerSettings.RTCOnHr[i] = 0;
							nTimerSettings.RTCOnMin[i] = 0;
							nTimerSettings.RTCOnSec[i] = 0;
							nTimerSettings.RTCOfHr[i] = 0;
							nTimerSettings.RTCOfMin[i] = 0;
							nTimerSettings.RTCOfSec[i] = 0;
							}


							nTimerSettings.ScrDlOnOff = 0;
							nTimerSettings.ScrDlHr = 0;
							nTimerSettings.ScrDlMin = 0;
							nTimerSettings.ScrDlSec = 0;
							nTimerSettings.LowVoltOnOff = 0;
							nTimerSettings.LowVoltII = 0;
							nTimerSettings.LowVoltIII = 0;
							nTimerSettings.HighVoltOnOff = 0;
							nTimerSettings.HighVoltII = 0;
							nTimerSettings.HighVoltIII = 0;
							nTimerSettings.ImbVolt = 0;
							nTimerSettings.RvePhOnoff = 0;
							nTimerSettings.SppOnoff = 0;
							nTimerSettings.CurSppOnOff = 0;
							nTimerSettings.OlOnOff = 0;
							nTimerSettings.OlAmpsII = 0;
							nTimerSettings.OlAmpsIII = 0;
							nTimerSettings.OlScanHr = 0;
							nTimerSettings.OlScanMin = 0;
							nTimerSettings.OlScanSec = 0;

							nTimerSettings.DrAmpsII = 0;
							nTimerSettings.DrAmpsIII = 0;


							//nTimerSettings.AutoStIIOnOff = 0;
							nTimerSettings.AutoStIIIOnOff = 0;
							nTimerSettings.AutoOlDrRstIIOnOff = 0;
							nTimerSettings.AutoDrRunRstIIOnOff=0;
							nTimerSettings.ManualOnOff = 0;

							nTimerSettings.OlRstVolOnoff = 0;
							nTimerSettings.OlRstVol = 0;

							nTimerSettings.DrOccurOnOff = 0;
							nTimerSettings.DrOccurTimHr = 0;
							nTimerSettings.DrOccurTimMin = 0;
							nTimerSettings.DrOccurTimSec = 0;
							nTimerSettings.DrOccurNum = 0;
	
	
							nMSettings.SMSOnOff = 1;
							nMSettings.SfbOnOff = 1;//1
							nMSettings.DryRunOnOff = 0;//1

							nTimerSettings.POnHr = 0;
							nTimerSettings.POnMin = 0;
							nTimerSettings.POnSec = 10;
	
							nTimerSettings.SDHr = 0;
							nTimerSettings.SDMin = 0;
							nTimerSettings.SDSec = 5;
	
							nTimerSettings.SfbHr = 0;
							nTimerSettings.SfbMin = 0;
							nTimerSettings.SfbSec = 20;

							nTimerSettings.DrScOnOf = 1;
							nTimerSettings.DrScHr = 0;
							nTimerSettings.DrScMin = 0;
							nTimerSettings.DrScSec = 20;
							
							nTimerSettings.OlOnOff = 0;
							nTimerSettings.OlScanHr = 0;
							nTimerSettings.OlScanMin = 0;
							nTimerSettings.OlScanSec = 10;

