AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
							nTimerSettings.OlAmpsII = 40.0;
							nTimerSettings.OlAmpsIII = 40.0;
							
							nTimerSettings.DrAmpsII = 5;
							nTimerSettings.DrAmpsIII = 5;

							nTimerSettings.ScrDlOnOff = 1;
							nTimerSettings.ScrDlHr = 0;
							nTimerSettings.ScrDlMin = 0;
							nTimerSettings.ScrDlSec = 7;
							
							nTimerSettings.LowVoltOnOff = 0;
							nTimerSettings.LowVoltII = 380;
							nTimerSettings.LowVoltIII = 280;
							
							nTimerSettings.HighVoltOnOff = 0;
							nTimerSettings.HighVoltII = 560;
							nTimerSettings.HighVoltIII = 500;
							
							nTimerSettings.ImbVolt = 40;
							nTimerSettings.RvePhOnoff = 0;
							nTimerSettings.SppOnoff = 0;
							nTimerSettings.CurSppOnOff = 0;
							nTimerSettings.DiffVoltII = 80;
							nTimerSettings.DiffVoltIII = 40;
							nTimerSettings.HiDiffVoltIII = 20;
							nTimerSettings.HiDiffVoltII =20;
							nTimerSettings.CTRonoff = 1;
							nTimerSettings.CTYonoff = 1;
							nTimerSettings.CTBonoff = 1;

							nTimerSettings.DrReHr = 1;
							nTimerSettings.DrReMin = 0;
							nTimerSettings.DrReSec = 0;
              
							nTimerSettings.AutoRst2On = 1;
							nTimerSettings.AutoRstOn = 1;
							nTimerSettings.AutoOlDrRstIIOnOff = 1;
							nTimerSettings.AutoDrRunRstIIOnOff=1;
							nTimerSettings.RPhaseToPhaseFactor = 1.0;
							
							nTimerSettings.pfcOnOff = 0;
							nTimerSettings.pfcvolt = 475;
							nTimerSettings.YPhaseToPhaseFactor = 1.0;
							nTimerSettings.BPhaseToPhaseFactor = 1.0;
							nTimerSettings.R2PhaseToPhaseFactor = 1.15;
							
							Mobile2Phs3Phase = 2;
							nTimerSettings.PoScrDlOnOff = 0;
							nTimerSettings.PoScrDlHr=0;
							nTimerSettings.PoScrDlMin=0;
							nTimerSettings.PoScrDlSec=5;					 
						 
							nMSettings.TankOnOff = 0;	 
							nMSettings.SumpOnOff = 0;	 
							
							limitsmsonof = 1;
							limitsmsset=80;
							
							nTimerSettings.CalRVoltage = 0.625;
							nTimerSettings.CalYVoltage = 0.625;
							nTimerSettings.CalBVoltage = 0.625;
							nTimerSettings.CalRCurrent = 0.69;
							nTimerSettings.CalYCurrent = 0.69;
							nTimerSettings.CalBCurrent = 0.69;
							
							nMSettings.AutoMobileKeyOnOf=1;
							nMSettings.Ph2Ph3SelectOnOf=1;
							nMSettings.ModeSelect=1;  //GSM as default
							nMSettings.responseOnOf=1;							 

						  WriteSettingsFile();
						  WriteTimerSettings();
							ReadTimerSettings();
							ReadSettingsFile();
}

static int  set_data_flash_base(uint32_t u32DFBA) {
    uint32_t   au32Config[2];          /* User Configuration */

    /* Read User Configuration 0 & 1 */
    if (FMC_ReadConfig(au32Config, 2) < 0)
    {
        Debug("\nRead User Config failed!\n");       /* Error message */
        return -1;                     /* failed to read User Configuration */
    }

    /* Check if Data Flash is enabled and is expected address. */
    if ((!(au32Config[0] & 0x1)) && (au32Config[1] == u32DFBA))
        return 0;                      /* no need to modify User Configuration */

    FMC_ENABLE_CFG_UPDATE();           /* Enable User Configuration update. */

    au32Config[0] &= ~0x1;             /* Clear CONFIG0 bit 0 to enable Data Flash */
    au32Config[1] = u32DFBA;           /* Give Data Flash base address  */

    /* Update User Configuration settings. */
    if (FMC_WriteConfig(au32Config, 2) < 0)
        return -1;                     /* failed to write user configuration */

    //Debug("\nSet Data Flash base as 0x%x.\n", DATA_FLASH_TEST_BASE);  /* debug message */

    /* Perform chip reset to make new User Config take effect. */
    SYS->IPRST0 = SYS_IPRST0_CHIPRST_Msk;
    return 0;                          /* success */
}
int ReadSettingsFile(void) {
		char ReadBuf[150]={0};
		//int Tp1,Tp2,Tp3;	 
		char *Pch = NULL;
		int readedlen = 0;	
	 
	
		/*clear the ReadBuf before read from flash*/
		memset(ReadBuf,NULL,sizeof(ReadBuf));
		
		/*Read Flashmemory*/
		memcpy(ReadBuf,(uint32_t *)SETTINGS_FILE_BASE_SADDR,100);
		
		/*check the Read Size,if less than 70 Reset all the parameters*/
		readedlen=strlen(ReadBuf);
		Debug("ReadSettingsFile:%s=%d",ReadBuf,readedlen);
		
		if(readedlen<10)			
			{
				nTimerSettings.SfbHr  = 0;
				nTimerSettings.SfbMin = 0;
				nTimerSettings.SfbSec = 0;
				nMSettings.SMSOnOff = 0;
				nMSettings.staticSMSOnOff = 0;				 	 
				nMSettings.SfbOnOff = 0;				
				nMSettings.ManualswitchOnOff = 0;
				nMSettings.TankOnOff = 0;
				nMSettings.SumpOnOff = 0;
				nMSettings.DryRunOnOff = 0;
				nMSettings.TargetOnOff = 0;
				nMSettings.serviceOnOff = 0;
				nMSettings.pwrvfbOnOf=0;
				nMSettings.VBFOnOff = 0;
				nMSettings.RelayControlOnCall = 0;
				nMSettings.SecOnOf = 0;
				nTimerSettings.pfcOnOff=0;
				nTimerSettings.pfcvolt=0;
				Mobile2Phs3Phase=0;
				limitsmsonof=0;
				//limitsmsset=0;
				DNDSMSFLAG[0]=0;
				DNDSMSFLAG[1]=0;
				DNDSMSFLAG[2]=0;
				DNDSMSFLAG[3]=0;				
				
        return -1;
			}
			else
			{

				Pch = strtok((char *)ReadBuf, (char *)"," );
				StrTokStrVer = 0;
				while( Pch != NULL )
				{
					strcpy(StrTokStr[StrTokStrVer],Pch);
					StrTokStrVer++;
					Pch = strtok( NULL, "," );
				}				
				/*
				for(Tp=0;Tp<=StrTokStrVer;Tp++)			 
				  Debug(buf,"\n\rSt=%s  pos=%d\n\r",StrTokStr[Tp],Tp);	 
				*/
        nMSettings.SMSOnOff              = myatoi(StrTokStr[1]);
				nMSettings.SfbOnOff              = myatoi(StrTokStr[2]);
				nMSettings.ManualswitchOnOff     = myatoi(StrTokStr[3]);
				nMSettings.TankOnOff             = myatoi(StrTokStr[4]);
				nMSettings.SumpOnOff             = myatoi(StrTokStr[5]);
				nMSettings.DryRunOnOff           = myatoi(StrTokStr[6]);
				nMSettings.TargetOnOff           = myatoi(StrTokStr[7]);
				nMSettings.VBFOnOff              = myatoi(StrTokStr[8]);
				nMSettings.RelayControlOnCall    = myatoi(StrTokStr[9]);
				nMSettings.SecOnOf               = myatoi(StrTokStr[10]);
				nTimerSettings.pfcOnOff          = myatoi(StrTokStr[11]);
				nTimerSettings.pfcvolt           = myatoi(StrTokStr[12]);
				Mobile2Phs3Phase				         = myatoi(StrTokStr[13]);
				nMSettings.gethidesmsonoff       = myatoi(StrTokStr[14]);
				nMSettings.staticSMSOnOff        = myatoi(StrTokStr[15]);
				nTimerSettings.SfbHr             = myatoi(StrTokStr[16]);
				nTimerSettings.SfbMin            = myatoi(StrTokStr[17]);
				nTimerSettings.SfbSec            = myatoi(StrTokStr[18]);
				limitsmsonof                     = myatoi(StrTokStr[19]);
				limitsmsset                      = myatoi(StrTokStr[20]);
				nMSettings.serviceOnOff          = myatoi(StrTokStr[21]);
				nMSettings.pwrvfbOnOf            = myatoi(StrTokStr[22]);
				DNDSMSFLAG[0]                    = myatoi(StrTokStr[23]);
				DNDSMSFLAG[1]                    = myatoi(StrTokStr[24]);
				DNDSMSFLAG[2]                    = myatoi(StrTokStr[25]);
				DNDSMSFLAG[3]                    = myatoi(StrTokStr[26]);
				MakeRealyOn                      = myatoi(StrTokStr[27]);
				PrvAutoMobileKey                 = myatoi(StrTokStr[28]);
				Appmodeon                        = myatoi(StrTokStr[29]);
				gprson                           = myatoi(StrTokStr[30]);
				nMSettings.AutoMobileKeyOnOf     = myatoi(StrTokStr[31]);
				nMSettings.Ph2Ph3SelectOnOf      = myatoi(StrTokStr[32]);
				nMSettings.ModeSelect            = myatoi(StrTokStr[33]);
				nMSettings.responseOnOf          = myatoi(StrTokStr[34]);
				
