AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
				return 0;
			}
	
}

int WriteSettingsFile(void) {   
   #if 1	
		uint32_t  Addr;
		char settings_buf[500]="";
    uint32_t flash_write_buf[150];
    char ReadBuf[500]={0};
		
	  uint16_t i,j,d=0;
		
	   /* Unlock protected registers */
      SYS_UnlockReg();
	    FMC_Open();                        /* Enable FMC ISP function */	
	   
		 /*The down below enable data flash function is must without this flash access won't run*/		
     /* Enable Data Flash and set base address. */
			if (set_data_flash_base(SETTINGS_FILE_BASE_SADDR) < 0)
			{
					Debug("Failed to set Data Flash base address!\n");          /* error message */
					/* failed to configure Data Flash, aborted */
			}
		
		
	   /*Erasing the flash sector from SETTINGS_FILE_BASE_SADDR,Default sector size is 4KB */
		if (FMC_Erase(SETTINGS_FILE_BASE_SADDR) != 0)            /* Erase page */
		{
				Debug("FMC_Erase SETTINGS_FILE_BASE_SADDR failed!\n");
				return -1;
		}
		else
		{
			/*clear the settings_buf array before copy*/
			memset(settings_buf,NULL,sizeof(settings_buf));
			memset(flash_write_buf,NULL,sizeof(flash_write_buf));
			
			/*copy the settings data to be written on flash ,MS-Motor Settings*/		
			 
			sprintf(settings_buf,"MS,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%03d,%d,%d,%d,%02d,%02d,%02d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%d,%01d,%01d,\n\r",
														nMSettings.SMSOnOff,nMSettings.SfbOnOff,nMSettings.ManualswitchOnOff,nMSettings.TankOnOff,nMSettings.SumpOnOff,
														nMSettings.DryRunOnOff,nMSettings.TargetOnOff ,nMSettings.VBFOnOff,nMSettings.RelayControlOnCall,nMSettings.SecOnOf,
														nTimerSettings.pfcOnOff,nTimerSettings.pfcvolt,Mobile2Phs3Phase,
														nMSettings.gethidesmsonoff,nMSettings.staticSMSOnOff,nTimerSettings.SfbHr,
														nTimerSettings.SfbMin,nTimerSettings.SfbSec,limitsmsonof,limitsmsset,nMSettings.serviceOnOff,
														nMSettings.pwrvfbOnOf,DNDSMSFLAG[0],DNDSMSFLAG[1],DNDSMSFLAG[2],DNDSMSFLAG[3],MakeRealyOn,PrvAutoMobileKey,Appmodeon,
														gprson,nMSettings.AutoMobileKeyOnOf,nMSettings.Ph2Ph3SelectOnOf,nMSettings.responseOnOf,nMSettings.ModeSelect);
			
			 
			
			Debug("\nsettings_buf:%s-len:%d\n",settings_buf,strlen(settings_buf));										
			/*move char arr data to int arr using memcpy*/
			for (i = 0, j = 0; i < sizeof(settings_buf); i += 4, j++)
			{
					memcpy(&flash_write_buf[j], &settings_buf[i], 4);
					//Debug("\nflash_write_buf:%x\n",flash_write_buf[j]);	
			}
			 
			
			/*write the copied data to flash memory word by word*/
			for (Addr = SETTINGS_FILE_BASE_SADDR; Addr < SETTINGS_FILE_BASE_EADDR; Addr += 4)
			{
					if (FMC_Write(Addr,flash_write_buf[d]) != 0)           
					{
							Debug("FMC_Write address 0x%x failed!\n", Addr);
							return -1;
					} 
					d++;
			}   
			/*Read and varify the data from flash,the data we wrote before */
			memcpy(ReadBuf,(uint32_t *)SETTINGS_FILE_BASE_SADDR,400);
			/*Printing it on console for debug purpose*/
			Debug("\nSettings file data after flash write:%s\n",ReadBuf);		
	  }
		FMC_Close();                       /* Disable FMC ISP function */
		
		 /* Lock protected registers */
    SYS_LockReg();
		#endif
		return 0;
}
int ReadTimerSettings(void) {
	char ReadBuf[600]={0};
 // int Tp1,Tp2,Tp3;	 
	char *Pch = NULL;
	int readedlen = 0;	
	
	/*clear the ReadBuf before read from flash*/
	memset(ReadBuf,NULL,sizeof(ReadBuf));
	/*Read Flashmemory*/
	memcpy(ReadBuf,(uint32_t *)TIMER_SETTINGS_FILE_BASE_SADDR,600);
	/*check the Read Size,if less than 70 Reset all the parameters*/
	readedlen=strlen(ReadBuf);
	Debug("ReadTimerSettings:%s=%d",ReadBuf,readedlen);
	if(readedlen < 70)
	{
		nTimerSettings.POnHr = 0;
		nTimerSettings.POnMin = 0;
		nTimerSettings.POnSec = 0;
		nTimerSettings.SDHr = 0;
		nTimerSettings.SDMin = 0;
		nTimerSettings.SDSec = 0;
		nTimerSettings.DrReOnOf = 0;
		nTimerSettings.DrReHr = 0;
		nTimerSettings.DrReMin = 0;
		nTimerSettings.DrReSec = 0;
		nTimerSettings.DrScOnOf = 0;
		nTimerSettings.DrScHr = 0;
		nTimerSettings.DrScMin = 0;
		nTimerSettings.DrScSec = 0;
		nTimerSettings.MaxRnOnOf = 0;
		nTimerSettings.MaxRnHr = 0;
		nTimerSettings.MaxRnMin = 0;
		nTimerSettings.MaxRnSec = 0;
		nTimerSettings.CycLicOnOf = 0;
		nTimerSettings.CycLicOnHr = 0;
		nTimerSettings.CycLicOnMin = 0;
		nTimerSettings.CycLicOnSec = 0;
		nTimerSettings.CycLicOfHr = 0;
		nTimerSettings.CycLicOfMin = 0;
		nTimerSettings.CycLicOfSec = 0;
		nTimerSettings.fertCycLicOfMin=0;
		nTimerSettings.fertCycLicOfSec=0;
		nTimerSettings.fertCycLicOnMin=0;
		nTimerSettings.fertCycLicOnSec=0;
		nTimerSettings.RTCOnOf = 0;
		for(i=1;i<5;i++)
		{
			nTimerSettings.RTCOnHr[i] = 0;
			nTimerSettings.RTCOnMin[i] = 0;
			nTimerSettings.RTCOnSec[i] = 0;
			nTimerSettings.RTCOfHr[i] = 0;
			nTimerSettings.RTCOfMin[i] = 0;
			nTimerSettings.RTCOfSec[i] = 0;
		}
		nTimerSettings.ScrDlOnOff = 0;
		nTimerSettings.ScrDlHr = 0;
		nTimerSettings.ScrDlMin = 0;
		nTimerSettings.ScrDlSec = 0;
		nTimerSettings.PoScrDlOnOff = 0;
		nTimerSettings.PoScrDlHr = 0;
		nTimerSettings.PoScrDlMin = 0;
		nTimerSettings.PoScrDlSec = 0;
		nTimerSettings.LowVoltOnOff = 0;
		nTimerSettings.LowVoltII = 0;
		nTimerSettings.LowVoltIII = 0;
		nTimerSettings.HighVoltOnOff = 0;
		nTimerSettings.HighVoltII = 0;
		nTimerSettings.HighVoltIII = 0;
		nTimerSettings.ImbVolt = 0;
		nTimerSettings.RvePhOnoff = 0;
		nTimerSettings.SppOnoff = 0;
		nTimerSettings.CurSppOnOff = 0;
		nTimerSettings.OlOnOff = 0;
		nTimerSettings.OlAmpsII = 0;
		nTimerSettings.OlAmpsIII = 0;
		nTimerSettings.OlScanHr = 0;
		nTimerSettings.OlScanMin = 0;
		nTimerSettings.OlScanSec = 0;
		nTimerSettings.DrAmpsII = 0;
		nTimerSettings.DrAmpsIII = 0;
		nTimerSettings.calflow2 =0;
		nTimerSettings.calflow3 =0;
		//nTimerSettings.AutoStIIOnOff = 0;
		nTimerSettings.AutoStIIIOnOff = 0;
		nTimerSettings.AutoOlDrRstIIOnOff = 0;
		nTimerSettings.AutoDrRunRstIIOnOff=0;
		nTimerSettings.ManualOnOff = 0;
		nTimerSettings.OlRstVolOnoff = 0;
		nTimerSettings.OlRstVol = 0;
		nTimerSettings.DrOccurOnOff = 0;
		nTimerSettings.DrOccurTimHr = 0;
		nTimerSettings.DrOccurTimMin = 0;
		nTimerSettings.DrOccurTimSec = 0;
		nTimerSettings.DrOccurNum = 0;
		nTimerSettings.DiffVoltII = 0;
		nTimerSettings.DiffVoltIII = 0;
		nTimerSettings.CalRVoltage = 1.0;
		nTimerSettings.CalYVoltage = 1.0;
		nTimerSettings.CalBVoltage = 1.0;
		nTimerSettings.CalRCurrent = 1.0;
		nTimerSettings.CalYCurrent = 1.0;
		nTimerSettings.CalBCurrent = 1.0;
		nTimerSettings.CTRonoff = 1;
		nTimerSettings.CTYonoff = 1;
		nTimerSettings.CTBonoff = 1;
		nTimerSettings.AutoRst2On = 1;
		nTimerSettings.AutoRstOn = 1;
		nTimerSettings.HiDiffVoltII = 0;
		nTimerSettings.HiDiffVoltIII = 0;
		nTimerSettings.lowpress=0;
		nTimerSettings.highpress=0;
		nTimerSettings.lowpressOnOff=0;
		nTimerSettings.highpressOnOff=0;
    return -1;
	}
	else
	{

		Pch = strtok((char *)ReadBuf, (char *)"," );
		StrTokStrVer2 = 0;
		while( Pch != NULL )
		{		 
			strcpy(StrTokStr2[StrTokStrVer2],Pch);
			StrTokStrVer2++;
			Pch = strtok( NULL, "," );		 
		 
