AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
		}		
		/* for(int Tp=0;Tp<=StrTokStrVer;Tp++)	{			 
				Debug("\n_Str=%s  pos=%d\n",StrTokStr2[Tp],Tp);
		 } */
				nTimerSettings.POnHr = myatoi(StrTokStr2[1]);
				nTimerSettings.POnMin = myatoi(StrTokStr2[2]);
				nTimerSettings.POnSec = myatoi(StrTokStr2[3]);	 
				nTimerSettings.SDHr  = myatoi(StrTokStr2[4]);
				nTimerSettings.SDMin = myatoi(StrTokStr2[5]);
				nTimerSettings.SDSec = myatoi(StrTokStr2[6]);
				nTimerSettings.DrReOnOf = myatoi(StrTokStr2[7]);
				nTimerSettings.DrReHr = myatoi(StrTokStr2[8]);
				nTimerSettings.DrReMin = myatoi(StrTokStr2[9]);
				nTimerSettings.DrReSec = myatoi(StrTokStr2[10]);

				nTimerSettings.DrScOnOf = myatoi(StrTokStr2[11]);
				nTimerSettings.DrScHr = myatoi(StrTokStr2[12]);
				nTimerSettings.DrScMin = myatoi(StrTokStr2[13]);
				nTimerSettings.DrScSec = myatoi(StrTokStr2[14]);

				nTimerSettings.MaxRnOnOf = myatoi(StrTokStr2[15]);
				nTimerSettings.MaxRnHr = myatoi(StrTokStr2[16]);
				nTimerSettings.MaxRnMin = myatoi(StrTokStr2[17]);
				nTimerSettings.MaxRnSec = myatoi(StrTokStr2[18]);

				nTimerSettings.CycLicOnOf = myatoi(StrTokStr2[19]);
				nTimerSettings.CycLicOnHr  = myatoi(StrTokStr2[20]);
				nTimerSettings.CycLicOnMin  = myatoi(StrTokStr2[21]);
				nTimerSettings.CycLicOnSec  = myatoi(StrTokStr2[22]);

				nTimerSettings.CycLicOfHr = myatoi(StrTokStr2[23]);
				nTimerSettings.CycLicOfMin = myatoi(StrTokStr2[24]);
				nTimerSettings.CycLicOfSec = myatoi(StrTokStr2[25]);

				nTimerSettings.RTCOnOf = myatoi(StrTokStr2[26]);
				nTimerSettings.RTCOnHr[1] = myatoi(StrTokStr2[27]);
				nTimerSettings.RTCOnMin[1] = myatoi(StrTokStr2[28]);
				nTimerSettings.RTCOnSec[1] = myatoi(StrTokStr2[29]);
				nTimerSettings.RTCOfHr[1] = myatoi(StrTokStr2[30]);
				nTimerSettings.RTCOfMin[1] = myatoi(StrTokStr2[31]);
				nTimerSettings.RTCOfSec[1] = myatoi(StrTokStr2[32]);
				nTimerSettings.RTCOnHr[2] = myatoi(StrTokStr2[33]);
				nTimerSettings.RTCOnMin[2] = myatoi(StrTokStr2[34]);
				nTimerSettings.RTCOnSec[2] = myatoi(StrTokStr2[35]);
				nTimerSettings.RTCOfHr[2] = myatoi(StrTokStr2[36]);
				nTimerSettings.RTCOfMin[2] = myatoi(StrTokStr2[37]);
				nTimerSettings.RTCOfSec[2] = myatoi(StrTokStr2[38]);
				nTimerSettings.RTCOnHr[3] = myatoi(StrTokStr2[39]);
				nTimerSettings.RTCOnMin[3] = myatoi(StrTokStr2[40]);
				nTimerSettings.RTCOnSec[3] = myatoi(StrTokStr2[41]);
				nTimerSettings.RTCOfHr[3] = myatoi(StrTokStr2[42]);
				nTimerSettings.RTCOfMin[3] = myatoi(StrTokStr2[43]);
				nTimerSettings.RTCOfSec[3] = myatoi(StrTokStr2[44]);
				nTimerSettings.RTCOnHr[4] = myatoi(StrTokStr2[45]);
				nTimerSettings.RTCOnMin[4] = myatoi(StrTokStr2[46]);
				nTimerSettings.RTCOnSec[4] = myatoi(StrTokStr2[47]);
				nTimerSettings.RTCOfHr[4] = myatoi(StrTokStr2[48]);
				nTimerSettings.RTCOfMin[4] = myatoi(StrTokStr2[49]);
				nTimerSettings.RTCOfSec[4] = myatoi(StrTokStr2[50]);
				nTimerSettings.ScrDlOnOff = myatoi(StrTokStr2[51]);
				nTimerSettings.ScrDlHr = myatoi(StrTokStr2[52]);
				nTimerSettings.ScrDlMin = myatoi(StrTokStr2[53]);
				nTimerSettings.ScrDlSec = myatoi(StrTokStr2[54]);
				nTimerSettings.LowVoltOnOff = myatoi(StrTokStr2[55]);
				nTimerSettings.LowVoltII = myatoi(StrTokStr2[56]);
				nTimerSettings.LowVoltIII = myatoi(StrTokStr2[57]);
				nTimerSettings.HighVoltOnOff = myatoi(StrTokStr2[58]);
				nTimerSettings.HighVoltII = myatoi(StrTokStr2[59]);
				nTimerSettings.HighVoltIII = myatoi(StrTokStr2[60]);
				nTimerSettings.ImbVolt = myatoi(StrTokStr2[61]);
				nTimerSettings.RvePhOnoff = myatoi(StrTokStr2[62]);
				nTimerSettings.SppOnoff = myatoi(StrTokStr2[63]);
				nTimerSettings.CurSppOnOff = myatoi(StrTokStr2[64]);
				nTimerSettings.OlOnOff = myatoi(StrTokStr2[65]);
				nTimerSettings.wrOlAmpsII =myatoi(StrTokStr2[66]);
				nTimerSettings.wrOlAmpsIII =myatoi(StrTokStr2[67]);
				nTimerSettings.OlScanHr = myatoi(StrTokStr2[68]);
				nTimerSettings.OlScanMin = myatoi(StrTokStr2[69]);
				nTimerSettings.OlScanSec = myatoi(StrTokStr2[70]);
				nTimerSettings.wrDrAmpsII =myatoi(StrTokStr2[71]);
				nTimerSettings.wrDrAmpsIII =myatoi(StrTokStr2[72]);
				//nTimerSettings.AutoStIIOnOff = myatoi(StrTokStr2[73]);
				nTimerSettings.AutoStIIIOnOff = myatoi(StrTokStr2[74]);
				nTimerSettings.AutoOlDrRstIIOnOff = myatoi(StrTokStr2[75]);
				nTimerSettings.ManualOnOff = myatoi(StrTokStr2[76]);

				nTimerSettings.OlRstVolOnoff = myatoi(StrTokStr2[77]);
				nTimerSettings.OlRstVol = myatoi(StrTokStr2[78]);

				nTimerSettings.DrOccurOnOff = myatoi(StrTokStr2[79]);
				nTimerSettings.DrOccurTimHr = myatoi(StrTokStr2[80]);
				nTimerSettings.DrOccurTimMin = myatoi(StrTokStr2[81]);
				nTimerSettings.DrOccurTimSec = myatoi(StrTokStr2[82]);
				nTimerSettings.DrOccurNum = myatoi(StrTokStr2[83]);

				nTimerSettings.DiffVoltII = myatoi(StrTokStr2[84]);
				nTimerSettings.DiffVoltIII  = myatoi(StrTokStr2[85]);

				nTimerSettings.wrCalRVoltage =myatoi(StrTokStr2[86]);
				nTimerSettings.wrCalYVoltage =myatoi(StrTokStr2[87]);
				nTimerSettings.wrCalBVoltage =myatoi(StrTokStr2[88]);
				nTimerSettings.wrCalRCurrent =myatoi(StrTokStr2[89]);
				nTimerSettings.wrCalYCurrent =myatoi(StrTokStr2[90]);
				nTimerSettings.wrCalBCurrent =myatoi(StrTokStr2[91]);
				nTimerSettings.CTRonoff = myatoi(StrTokStr2[92]);
				nTimerSettings.CTYonoff = myatoi(StrTokStr2[93]);
				nTimerSettings.CTBonoff = myatoi(StrTokStr2[94]);
				nTimerSettings.AutoRst2On = myatoi(StrTokStr2[95]);
				nTimerSettings.AutoRstOn = myatoi(StrTokStr2[96]);

				nTimerSettings.HiDiffVoltII  = myatoi(StrTokStr2[97]);
				if(nTimerSettings.HiDiffVoltII>300)
				nTimerSettings.HiDiffVoltII = 0;
				nTimerSettings.HiDiffVoltIII = myatoi(StrTokStr2[98]);
				if(nTimerSettings.HiDiffVoltIII>300)
				nTimerSettings.HiDiffVoltIII = 0;

				nTimerSettings.wrRPhaseToPhaseFactor =myatoi(StrTokStr2[99]);
				nTimerSettings.wrYPhaseToPhaseFactor =myatoi(StrTokStr2[100]);
				nTimerSettings.wrBPhaseToPhaseFactor =myatoi(StrTokStr2[101]);
				nTimerSettings.wrR2PhaseToPhaseFactor =myatoi(StrTokStr2[102]);
				nTimerSettings.PoScrDlOnOff = myatoi(StrTokStr2[103]);
				nTimerSettings.PoScrDlHr = myatoi(StrTokStr2[104]);
				nTimerSettings.PoScrDlMin = myatoi(StrTokStr2[105]);
				nTimerSettings.PoScrDlSec = myatoi(StrTokStr2[106]);
				nTimerSettings.AutoDrRunRstIIOnOff =myatoi(StrTokStr2[107]);			
				//nTimerSettings.wrDrAmpsII =myatoi(StrTokStr2[108]);
				//nTimerSettings.wrDrAmpsIII =myatoi(StrTokStr2[109]);
				//nTimerSettings.calflow2=(nTimerSettings.wrDrAmpsII*0.1);
				//nTimerSettings.calflow3=(nTimerSettings.wrDrAmpsIII*0.1);
				//nTimerSettings.wrlowpress=myatoi(StrTokStr2[110]);
				//nTimerSettings.wrhighpress=myatoi(StrTokStr2[111]);
				//nTimerSettings.lowpressOnOff=myatoi(StrTokStr2[112]);
				//nTimerSettings.highpressOnOff=myatoi(StrTokStr2[113]);				
				//nTimerSettings.fertCycLicOfMin=myatoi(StrTokStr2[114]);
				//nTimerSettings.fertCycLicOfSec=myatoi(StrTokStr2[115]);
				//nTimerSettings.fertCycLicOnMin=myatoi(StrTokStr2[116]);
				//nTimerSettings.fertCycLicOnSec=myatoi(StrTokStr2[117]);
								
