AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
				nTimerSettings.OlAmpsII =(float)(nTimerSettings.wrOlAmpsII*0.1f);
				nTimerSettings.OlAmpsIII =(float)(nTimerSettings.wrOlAmpsIII*0.1f);
				nTimerSettings.DrAmpsII = (float)(nTimerSettings.wrDrAmpsII*0.1f);
				nTimerSettings.DrAmpsIII =(float)(nTimerSettings.wrDrAmpsIII*0.1f);
				
				nTimerSettings.lowpress=nTimerSettings.wrlowpress*0.1;
				nTimerSettings.highpress=nTimerSettings.wrhighpress*0.1;				

				nTimerSettings.CalRVoltage = (nTimerSettings.wrCalRVoltage*0.0001);
				nTimerSettings.CalYVoltage = (nTimerSettings.wrCalYVoltage*0.0001);
				nTimerSettings.CalBVoltage = (nTimerSettings.wrCalBVoltage*0.0001);
				nTimerSettings.CalRCurrent = (nTimerSettings.wrCalRCurrent*0.0001);
				nTimerSettings.CalYCurrent = (nTimerSettings.wrCalYCurrent*0.0001);
				nTimerSettings.CalBCurrent = (nTimerSettings.wrCalBCurrent*0.0001);
				nTimerSettings.RPhaseToPhaseFactor = (nTimerSettings.wrRPhaseToPhaseFactor*0.0001);
				nTimerSettings.YPhaseToPhaseFactor = (nTimerSettings.wrYPhaseToPhaseFactor*0.0001);
				nTimerSettings.BPhaseToPhaseFactor = (nTimerSettings.wrBPhaseToPhaseFactor*0.0001);
				nTimerSettings.R2PhaseToPhaseFactor = (nTimerSettings.wrR2PhaseToPhaseFactor*0.0001);
			
			  Debug("\n\rCalc,%0.4f,%0.4f,%0.4f\n\r",nTimerSettings.CalRCurrent,nTimerSettings.CalYCurrent,nTimerSettings.CalBCurrent);
						 
			
				if(nTimerSettings.CalRVoltage<=0||nTimerSettings.CalRVoltage>=10)
					nTimerSettings.CalRVoltage = 1.0;
				if(nTimerSettings.CalYVoltage<=0||nTimerSettings.CalYVoltage>=10)
					nTimerSettings.CalYVoltage = 1.0;
				if(nTimerSettings.CalBVoltage<=0||nTimerSettings.CalBVoltage>=10)
					nTimerSettings.CalBVoltage = 1.0;
				if(nTimerSettings.CalRCurrent<=0||nTimerSettings.CalRCurrent>=1000)
					nTimerSettings.CalRCurrent = 1.0;
				if(nTimerSettings.CalYCurrent<=0||nTimerSettings.CalYCurrent>=1000)
					nTimerSettings.CalYCurrent = 1.0;
				if(nTimerSettings.CalBCurrent<=0||nTimerSettings.CalBCurrent>=1000)
					nTimerSettings.CalBCurrent = 1.0;
				if(nTimerSettings.RPhaseToPhaseFactor<=0 || nTimerSettings.RPhaseToPhaseFactor>5)
					nTimerSettings.RPhaseToPhaseFactor = 1.0;
				if(nTimerSettings.YPhaseToPhaseFactor<=0 || nTimerSettings.YPhaseToPhaseFactor>5)
					nTimerSettings.YPhaseToPhaseFactor = 1.0;
				if(nTimerSettings.BPhaseToPhaseFactor<=0 || nTimerSettings.BPhaseToPhaseFactor>5)
					nTimerSettings.BPhaseToPhaseFactor = 1.0;
				if(nTimerSettings.R2PhaseToPhaseFactor<=0 || nTimerSettings.R2PhaseToPhaseFactor>5)
					nTimerSettings.R2PhaseToPhaseFactor = 1.0;

       return 0;
	   }
	
}
int WriteTimerSettings(void) {   
   #if 1	
		uint32_t  Addr;
		char settings_buf[600]="";
		uint32_t flash_write_buf[200];
		char ReadBuf[600]={0};	   	
		uint16_t i,j,d=0;
		
		/* Unlock protected registers */
		SYS_UnlockReg();
		/* Enable FMC ISP function */	
		FMC_Open();                        
		
	   

	   /*Erasing the flash sector from SETTINGS_FILE_BASE_SADDR,Default sector size is 4KB */
		if (FMC_Erase(TIMER_SETTINGS_FILE_BASE_SADDR) != 0)            /* Erase page */
		{
				Debug("FMC_Erase SETTINGS_FILE_BASE_SADDR failed!\n");
				return -1;
		}
		else 
		{
				/*clear the settings_buf array before copy*/
				memset(settings_buf,NULL,sizeof(settings_buf));
				memset(flash_write_buf,NULL,sizeof(flash_write_buf));
				
				/*copy the Motor Timer settings data to be written on flash */		
				 
					memset(settings_buf,NULL,sizeof(settings_buf));
								
				nTimerSettings.wrOlAmpsII =(nTimerSettings.OlAmpsII*10);
				nTimerSettings.wrOlAmpsIII =(nTimerSettings.OlAmpsIII*10);
				nTimerSettings.wrDrAmpsII = (uint16_t)(nTimerSettings.DrAmpsII*10);
				nTimerSettings.wrDrAmpsIII = (uint16_t)(nTimerSettings.DrAmpsIII*10);
				nTimerSettings.wrCalRVoltage = (nTimerSettings.CalRVoltage*10000);
				nTimerSettings.wrCalYVoltage = (nTimerSettings.CalYVoltage*10000);
				nTimerSettings.wrCalBVoltage = (nTimerSettings.CalBVoltage*10000);
				nTimerSettings.wrCalRCurrent = (nTimerSettings.CalRCurrent*10000);
				nTimerSettings.wrCalYCurrent = (nTimerSettings.CalYCurrent*10000);
				nTimerSettings.wrCalBCurrent = (nTimerSettings.CalBCurrent*10000);
				nTimerSettings.wrRPhaseToPhaseFactor = (nTimerSettings.RPhaseToPhaseFactor*10000);
				nTimerSettings.wrYPhaseToPhaseFactor = (nTimerSettings.YPhaseToPhaseFactor*10000);
				nTimerSettings.wrBPhaseToPhaseFactor = (nTimerSettings.BPhaseToPhaseFactor*10000);
				nTimerSettings.wrR2PhaseToPhaseFactor = (nTimerSettings.R2PhaseToPhaseFactor*10000);
				 /*TS-timer settings*/
				sprintf(settings_buf,"TS,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,%02d,",
				
												nTimerSettings.POnHr,
												nTimerSettings.POnMin,
												nTimerSettings.POnSec,
												nTimerSettings.SDHr,
												nTimerSettings.SDMin,
												nTimerSettings.SDSec,
												nTimerSettings.DrReOnOf,
												nTimerSettings.DrReHr,
												nTimerSettings.DrReMin,
												nTimerSettings.DrReSec,
												nTimerSettings.DrScOnOf,
												nTimerSettings.DrScHr,
												nTimerSettings.DrScMin,
												nTimerSettings.DrScSec,
												nTimerSettings.MaxRnOnOf,
												nTimerSettings.MaxRnHr,
												nTimerSettings.MaxRnMin,
												nTimerSettings.MaxRnSec,
												nTimerSettings.CycLicOnOf,
												nTimerSettings.CycLicOnHr,
												nTimerSettings.CycLicOnMin,
												nTimerSettings.CycLicOnSec,
												nTimerSettings.CycLicOfHr,
												nTimerSettings.CycLicOfMin,
												nTimerSettings.CycLicOfSec,
												nTimerSettings.RTCOnOf,
												nTimerSettings.RTCOnHr[1],nTimerSettings.RTCOnMin[1],nTimerSettings.RTCOnSec[1],
												nTimerSettings.RTCOfHr[1],nTimerSettings.RTCOfMin[1],nTimerSettings.RTCOfSec[1],
												nTimerSettings.RTCOnHr[2],nTimerSettings.RTCOnMin[2],nTimerSettings.RTCOnSec[2],
												nTimerSettings.RTCOfHr[2],nTimerSettings.RTCOfMin[2],nTimerSettings.RTCOfSec[2],
												nTimerSettings.RTCOnHr[3],nTimerSettings.RTCOnMin[3],nTimerSettings.RTCOnSec[3],
												nTimerSettings.RTCOfHr[3],nTimerSettings.RTCOfMin[3],nTimerSettings.RTCOfSec[3],
												nTimerSettings.RTCOnHr[4],nTimerSettings.RTCOnMin[4],nTimerSettings.RTCOnSec[4],
												nTimerSettings.RTCOfHr[4],nTimerSettings.RTCOfMin[4],nTimerSettings.RTCOfSec[4]);

				sprintf(settings_buf,"%s%02d,%02d,%02d,%02d,%02d,%03d,%03d,%02d,%03d,%03d,%03d,%02d,%02d,%02d,%02d,%04d,%04d,%02d,%02d,%02d,%04d,%04d,%02d,%02d,%02d,%02d,%02d,%03d,%02d,%02d,%02d,%02d,%02d,%03d,%03d,%05d,%05d,%05d,%05d,%05d,%05d,%02d,%02d,%02d,%d,%d,%03d,%03d,%05d,%05d,%05d,%05d,%02d,%02d,%02d,%02d,%02d,",settings_buf,
								nTimerSettings.ScrDlOnOff,nTimerSettings.ScrDlHr,nTimerSettings.ScrDlMin,nTimerSettings.ScrDlSec,
								nTimerSettings.LowVoltOnOff,nTimerSettings.LowVoltII,nTimerSettings.LowVoltIII,
								nTimerSettings.HighVoltOnOff,nTimerSettings.HighVoltII,nTimerSettings.HighVoltIII,
								nTimerSettings.ImbVolt,nTimerSettings.RvePhOnoff,nTimerSettings.SppOnoff,nTimerSettings.CurSppOnOff,
								nTimerSettings.OlOnOff,nTimerSettings.wrOlAmpsII,nTimerSettings.wrOlAmpsIII,nTimerSettings.OlScanHr,
								nTimerSettings.OlScanMin,nTimerSettings.OlScanSec,nTimerSettings.wrDrAmpsII,nTimerSettings.wrDrAmpsIII,
								nTimerSettings.AutoStIIOnOff,nTimerSettings.AutoStIIIOnOff,nTimerSettings.AutoOlDrRstIIOnOff,nTimerSettings.ManualOnOff,
								nTimerSettings.OlRstVolOnoff,nTimerSettings.OlRstVol,
								nTimerSettings.DrOccurOnOff,nTimerSettings.DrOccurTimHr,nTimerSettings.DrOccurTimMin,nTimerSettings.DrOccurTimSec,nTimerSettings.DrOccurNum,
								nTimerSettings.DiffVoltII,nTimerSettings.DiffVoltIII, nTimerSettings.wrCalRVoltage,nTimerSettings.wrCalYVoltage,nTimerSettings.wrCalBVoltage,
								nTimerSettings.wrCalRCurrent,nTimerSettings.wrCalYCurrent,nTimerSettings.wrCalBCurrent,
								nTimerSettings.CTRonoff,nTimerSettings.CTYonoff,nTimerSettings.CTBonoff,nTimerSettings.AutoRst2On,nTimerSettings.AutoRstOn,
								nTimerSettings.HiDiffVoltII,nTimerSettings.HiDiffVoltIII,nTimerSettings.wrRPhaseToPhaseFactor,nTimerSettings.wrYPhaseToPhaseFactor,
								nTimerSettings.wrBPhaseToPhaseFactor,nTimerSettings.wrR2PhaseToPhaseFactor,
								nTimerSettings.PoScrDlOnOff,nTimerSettings.PoScrDlHr,nTimerSettings.PoScrDlMin,
								nTimerSettings.PoScrDlSec,nTimerSettings.AutoDrRunRstIIOnOff);
				
				 
				
				//Debug("\nsettings_buf:%s-len:%d\n",settings_buf,strlen(settings_buf));										
				/*move char arr data to int arr using memcpy*/
				for (i = 0, j = 0; i < sizeof(settings_buf); i += 4, j++)
				{
					memcpy(&flash_write_buf[j], &settings_buf[i], 4);
					 
