AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
				}		 
				
				/*write the copied data to flash memory word by word*/
				for (Addr = TIMER_SETTINGS_FILE_BASE_SADDR; Addr < TIMER_SETTINGS_FILE_BASE_EADDR; Addr += 4)
				{
						if (FMC_Write(Addr,flash_write_buf[d]) != 0)           
						{
								Debug("FMC_Write address 0x%x failed!\n", Addr);
								return -1;
						} 
						d++;
				}   
				
				/*Read and varify the data from flash,the data we wrote before */
				memcpy(ReadBuf,(uint32_t *)TIMER_SETTINGS_FILE_BASE_SADDR,600);
				/*Printing it on console for debug purpose*/
				Debug("\nTimerSettings after flashwrite:%s=len:%d\n",ReadBuf,strlen(settings_buf));		
		}
		/* Disable FMC ISP function */
		FMC_Close();                      

		/* Lock protected registers */
		SYS_LockReg();
		
		#endif
		return 0;
}
void Check_Send_SMS(void) {
	#if 1
          Debug("\n\rTest:%d,%d,%d\n\r",SendSmsToAll,ModemIsReady,nMSettings.SMSOnOff);
				  if(SendSmsToAll == 1 && ModemIsReady == 1 && nMSettings.SMSOnOff == 1)
					{
					       
							unsigned char removeniagara=0;
							if(nMSettings.gethidesmsonoff == 1 )
								{
										//unsigned char Tp10;
										sprintf(buffer,"            ");
										strcpy(StoredPhoneNumber[10],buffer);


										for(Tp=0;Tp<HowManyNumberFound;Tp++)
											{
																	Debug("\n\rStoredPhoneNumber: %s WhoMadeRelayOn: %s\n\r",StoredPhoneNumber[Tp],WhoMadeRelayOn);
																	if((strstr(StoredPhoneNumber[Tp],WhoMadeRelayOn)!=0))
																	{
																			if(Tp==0)
																			{
																				sprintf(buffer,"SMSM");
																				strcpy(StoredPhoneNumber[24],buffer);
																			}
																			else if(Tp==1)
																			{
																				sprintf(buffer,"REG 1");
																				strcpy(StoredPhoneNumber[24],buffer);
																			}
																			else if(Tp==2)
																			{
																				sprintf(buffer,"REG 2");
																				strcpy(StoredPhoneNumber[24],buffer);
																			}
																			else if(Tp==3)
																			{
																				sprintf(buffer,"REG 3");
																				strcpy(StoredPhoneNumber[24],buffer);
																			}
																	}
											}
											if(strstr(StoredPhoneNumber[11],WhoMadeRelayOn)!=0)
											{
												sprintf(buffer,"SERVICE");
												strcpy(StoredPhoneNumber[24],buffer);
											}

							}
							 
								if(NumberOfSmsNeedToSend<20)
								{
								  switchonofflag=0;
									FirstTimeSMS = 0;
									Debug("\n\rFill up now \n\r");									
									limitsmscountsmsm=limitsmscount;
									Debug("\n\rHowManyNumberFound:%d\n\r",HowManyNumberFound);
									//by aj									
									HowManyNumberFound=1;
									
									for(Tpsms=0;Tpsms<=HowManyNumberFound-1;Tpsms++)
									{
                                        
										if(nSTATE_MOTOR_SMS != STATE_NO_MOTOR_SMS)
										{
											switch(nSTATE_MOTOR_SMS)
											{
												case STATE_MOTORON_SMS:
													{

														if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_DEFAULT)
														{

															if(PowerCurrentCondition == 0)
															{
																 sprintf(Buffer1,"AUTO ON \nPOWER ON\nMOTOR ON\n");
																 switchonofflag=1;

																if(WorkingOn3Phas == 1)
																{
																if(Appmodeon==1) {
																	sprintf(Buffer1," %02d001\n",(datetime.tm_sec+2));
																	StatusCode=1;
																}
																else
																sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																if(Appmodeon==1) {
																	sprintf(Buffer1," %02d002\n",(datetime.tm_sec+2));
																	StatusCode=2;
																}
																else
																sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else
															{
															   if(Appmodeon==1) {
																 sprintf(Buffer1," %02d003\n",(datetime.tm_sec+2));
																 StatusCode=3;
																 }
																 else
															   sprintf(Buffer1,"AUTO ON \nPOWER OFF\nMOTOR OFF\n");
																 switchonofflag=1;
																//sprintf(Buffer1,"MOBILE ON BY %s\nPOWER OFF\nMOTOR OFF\n",WhoMadeRelayOn);
															}
														}
														else
														{
															if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_ONDELAY)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF CYCLIC ON TIME");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d004\n",(datetime.tm_sec+2));
																		StatusCode=4;	
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d005\n",(datetime.tm_sec+2));
																		StatusCode=5;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_SWITCH_SMS)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE AUTO MOBILE SWITCH\n");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d006\n",(datetime.tm_sec+2));
																		StatusCode=6;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d007\n",(datetime.tm_sec+2));
																		StatusCode=7;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_GRTC)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF ON GRTC PROGRAM %02d ON TIME",RTCOFFLAG);
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d008\nPROG-%02d\n",(datetime.tm_sec+2),RTCOFFLAG);
																		StatusCode=8;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d009\nPROG-%02d\n",(datetime.tm_sec+2),RTCOFFLAG);
																		StatusCode=9;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}

															else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_RTC1)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF ON RTC PROGRAM 1 ON TIME");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d010\nPROG-1\n",(datetime.tm_sec+2));
																	  StatusCode=10;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d011\nPROG-1\n",(datetime.tm_sec+2));
																		StatusCode=11;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_RTC2)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF ON RTC PROGRAM 2 ON TIME");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1)
																		sprintf(Buffer1," %02d010\nPROG-2\n",(datetime.tm_sec+2));
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1)
																		sprintf(Buffer1," %02d011\nPROG-2\n",(datetime.tm_sec+2));
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_RTC3)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF ON RTC PROGRAM 3 ON TIME");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1)
																		sprintf(Buffer1," %02d010\nPROG-3\n",(datetime.tm_sec+2));
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1)
																		sprintf(Buffer1," %02d011\nPROG-3\n",(datetime.tm_sec+2));
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_RTC4)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF ON RTC PROGRAM 4 ON TIME");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1)
																		sprintf(Buffer1," %02d010\nPROG-4\n",(datetime.tm_sec+2));
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1)
																		sprintf(Buffer1," %02d011\nPROG-1\n",(datetime.tm_sec+2));
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_UPPERTANK)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF UPPER TANK EMPTY");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d012\n",(datetime.tm_sec+2));
																		StatusCode=12;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d013\n",(datetime.tm_sec+2));
																		StatusCode=13;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_LOWERTANK)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF SUMP TANK FULL");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d014\n",(datetime.tm_sec+2));
																		StatusCode=14;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d015\n",(datetime.tm_sec+2));
																		StatusCode=15;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_RESTARTTIMER)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF RESTART TIMER");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d016\n",(datetime.tm_sec+2)); 
																		StatusCode=16;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d017\n",(datetime.tm_sec+2));
																		StatusCode=17;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else if(nSTATE_MOTOR_ON_SMS == STATE_MOTOR_ON_TARGET)
															{
																sprintf(Buffer1,"MOTOR ON BECAUSE OF TARGET");
																if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d018\n",(datetime.tm_sec+2));
																		StatusCode=18;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
																}
																else
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d019\n",(datetime.tm_sec+2));
																		StatusCode=19;
																	}
																	else
																		sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
																}
															}
															else
															{
																sprintf(Buffer1,"Error Sednd this to Service DEPT nSTATE_MOTOR_ON_SMS = %d",nSTATE_MOTOR_ON_SMS);

