AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
															}
														}
													}
													break;
												case STATE_MOTOROF_SMS:
													{
														Debug("STATE_MOTOROF_SMS case");														
														if(PowerCurrentCondition == 0)
														{
															if(WorkingOn3Phas == 1)
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d020\n",(datetime.tm_sec+2));
																		StatusCode=20;
																	}
																	else
																		sprintf(Buffer1,"AUTO OFF \nPOWER ON\nMOTOR OFF\n");
																
																  switchonofflag=1;
																}
																//sprintf(Buffer1,"MOBILE OFF BY %s\nPOWER ON\nMOTOR OFF\n",WhoMadeRelayOn);
																else
																{
																	if(Appmodeon==1) {
																		sprintf(Buffer1," %02d021\n",(datetime.tm_sec+2));
																		StatusCode=21;
																	}
																	else
																		sprintf(Buffer1,"AUTO OFF \nPOWER ON\nMOTOR OFF\n");
																  switchonofflag=1;

																}


														}
														else
														{
														      if(Appmodeon==1) {
																		sprintf(Buffer1," %02d079\n",(datetime.tm_sec+2));
																		StatusCode=79;
																	 }
																else
																	sprintf(Buffer1,"AUTO OFF \nPOWER OFF\nMOTOR OFF\n");
																
																switchonofflag=1;
															//sprintf(Buffer1,"MOBILE OFF BY %s\nPOWER OFF\nMOTOR OFF\n",WhoMadeRelayOn);

														}
													}
													break;
												case STATE_MOTOR_STARTER_TRIP_SMS:

													sprintf(Buffer1,"MOTOR OFF BECAUSE OF STARTER TRIP:%d  \n",(OverAllStarterTrip+1));

													if(WorkingOn3Phas == 1)
													{
														//if(OverAllStarterTrip>3) OverAllStarterTrip=3;
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d101\nTRIP-%d\n",(datetime.tm_sec+2),(OverAllStarterTrip+1));
															StatusCode=101;
														}
														else
															sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
													}
													else
													{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d102\nTRIP-%d\n",(datetime.tm_sec+2),(OverAllStarterTrip+1));
															StatusCode=102;
														}
														else
															sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
													}
													break;
												/*case STATE_MOTOR_UPPERTANK_TRIP_SMS:
                                                    {
                                                    if(Appmodeon==1)
													sprintf(Buffer1,"%02d22\n",(datetime.tm_sec+2));
													else
													sprintf(Buffer1,"MOTOR OFF BECAUSE OF PRESSURE SWITCH OPEN");
													}
													break;*/
													case STATE_MOTOR_UPPERTANK_TRIP_SMS:
													{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d022\n",(datetime.tm_sec+2));   //Previously %02d103
															StatusCode=22;
														}
														else
															sprintf(Buffer1,"MOTOR OFF BECAUSE OF UPPER TANK FULL");    //dg_changed from MOTOR OFF BECAUSE OF PRESSURE SWITCH OPEN
													}
													break;
												case STATE_MOTOR_LOWERTANK_TRIP_SMS:
                                                    {
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d023\n",(datetime.tm_sec+2));
															StatusCode=23;
														}
														else
															sprintf(Buffer1,"MOTOR OFF BECAUSE OF SUMP TANK EMPTY");
													}
													break;

												case STATE_MOTOR_ON_SWITCH_TRIP_SMS:
												    {
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d024\n",(datetime.tm_sec+2));
															StatusCode=24;
														}
														else
															sprintf(Buffer1,"MOTOR OFF BECAUSE MOBILE AUTO SWITCH");
													}
													break;
												case STATE_MOTOR_DRYRUN_TRIP_SMS:
													{
														sprintf(Buffer1,"MOTOR OFF BECAUSE DRY RUN\n");
														if(WorkingOn3Phas == 1)
														{

															if(Appmodeon==1) {
																sprintf(Buffer1," %02d025\n",(datetime.tm_sec+2));
																StatusCode=25;
															}
															else
															{
																//FloatroString1Dig(TpS1tr,nTimerSettings.DrAmpsIII);
																sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE\n",Buffer1);
															}
														sprintf(Buffer1,"%sSET AMPS = %0.1f\n",Buffer1,nTimerSettings.DrAmpsIII);
														}
														else
														{
															 if(Appmodeon==1) {
																	sprintf(Buffer1," %02d026\n",(datetime.tm_sec+2));
																	StatusCode=26;
															 }
															else
															{
															//FloatroString1Dig(TpS1tr,nTimerSettings.DrAmpsII);
																sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE\n",Buffer1);
															}
														sprintf(Buffer1,"%sSET AMPS = %0.1f\n",Buffer1,nTimerSettings.DrAmpsII);
														}
														if(WhichPhaseHaveingProblem == 1)
														{
															//FloatroString1Dig(TpS1tr,TripCurrent);
																sprintf(Buffer1,"%sRC = %0.1f\n",Buffer1,TripCurrent);
														}
														else if(WhichPhaseHaveingProblem == 2)
														{
															//FloatroString1Dig(TpS1tr,TripCurrent);
																sprintf(Buffer1,"%sYC = %0.1f\n",Buffer1,TripCurrent);
														}
														else if(WhichPhaseHaveingProblem == 3)

														{
															//FloatroString1Dig(TpS1tr,TripCurrent);
																sprintf(Buffer1,"%sBC = %0.1f\n",Buffer1,TripCurrent);
														}

													}
													break;
												case STATE_MOTOR_CYCLIC_TRIP_SMS:
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d027\n",(datetime.tm_sec+2));
															StatusCode=27;
														}
														else												{
															sprintf(Buffer1,"MOTOR OFF BECAUSE CYCLIC OFF TIME");
													break;
												case STATE_MOTOR_MAX_TRIP_SMS:
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d104\n",(datetime.tm_sec+2));															
															StatusCode=104;
														}
												    else
															sprintf(Buffer1,"MOTOR OFF BECAUSE MAX TIMER REACHED");
													break;					 

												case STATE_MOTOR_RTCOF1_TRIP_SMS:
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d030\nPROG-1\n",(datetime.tm_sec+2));
															StatusCode=30;
														}
												    else
															sprintf(Buffer1,"MOTOR OFF BECAUSE RTC PROGRAM 1 OFF TIMER REACHED");
													break;
												case STATE_MOTOR_RTCOF2_TRIP_SMS:
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d030\nPROG-2\n",(datetime.tm_sec+2));
															StatusCode=30;
														}
												    else
															sprintf(Buffer1,"MOTOR OFF BECAUSE RTC PROGRAM 2 OFF TIMER REACHED");
													break;
												case STATE_MOTOR_RTCOF3_TRIP_SMS:
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d030\nPROG-3\n",(datetime.tm_sec+2));
															StatusCode=30;
														}
														else
															sprintf(Buffer1,"MOTOR OFF BECAUSE RTC PROGRAM 3 OFF TIMER REACHED");
													break;
												case STATE_MOTOR_RTCOF4_TRIP_SMS:
															if(Appmodeon==1) {
																sprintf(Buffer1," %02d030\nPROG-4\n",(datetime.tm_sec+2));
																StatusCode=30;
															}
															else
																sprintf(Buffer1,"MOTOR OFF BECAUSE RTC PROGRAM 4 OFF TIMER REACHED");
													break;
												case STATE_MOTOR_TRIP_OVERLOAD_SMS:
													{
														sprintf(Buffer1,"MOTOR OFF BECAUSE OVER LOAD\n");
														if(WorkingOn3Phas == 1)
														{

															if(Appmodeon==1) {
																sprintf(Buffer1," %02d105\n",(datetime.tm_sec+2));
																StatusCode=105;
															}
															else
															{
																//FloatroString1Dig(TpS1tr,nTimerSettings.DrAmpsII);
																sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE\n",Buffer1);
															}
															sprintf(Buffer1,"%sSET AMPS = %0.1f\n",Buffer1,nTimerSettings.OlAmpsIII);

