AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
														}
														else
														{
															if(Appmodeon==1) {
																sprintf(Buffer1," %02d106\n",(datetime.tm_sec+2));
																StatusCode=106;
															}
															else
															{
															//	FloatroString1Dig(TpS1tr,nTimerSettings.DrAmpsII);
																sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE\n",Buffer1);
															}
															sprintf(Buffer1,"%sSET AMPS = %0.1f\n",Buffer1,nTimerSettings.OlAmpsII);
															}
															if(WhichPhaseHaveingProblem == 1)
															{
																	//	FloatroString1Dig(TpS1tr,TripCurrent);
																	sprintf(Buffer1,"%sRC = %0.1f\n",Buffer1,TripCurrent);
															}
															else if(WhichPhaseHaveingProblem == 2)
															{
																	//	FloatroString1Dig(TpS1tr,TripCurrent);
																	sprintf(Buffer1,"%sYC = %0.1f\n",Buffer1,TripCurrent);
															}
															else if(WhichPhaseHaveingProblem == 3)
															{
																	//	FloatroString1Dig(TpS1tr,TripCurrent);
																	sprintf(Buffer1,"%sBC = %0.1f\n",Buffer1,TripCurrent);
															}
																												}
													}
													break;
													 
												case STATE_MOTOR_TRIP_SPP_SMS:
													{
															if(Appmodeon==1) {
																sprintf(Buffer1," %02d107\n",(datetime.tm_sec+2));
																StatusCode=107;
															}
															else
																sprintf(Buffer1,"MOTOR OFF BECAUSE SINGLE PHASEING\n");
															sprintf(Buffer1,"%sIMB VOLT = %0.0f\n SET IMB VOLT = %03d",Buffer1,VSPPImbalanceVoltage,nTimerSettings.ImbVolt);

													}
													break;
												case STATE_MOTOR_TRIP_REVERSEPHASE_SMS:
													{
															if(Appmodeon==1) {
																sprintf(Buffer1," %02d108\n",(datetime.tm_sec+2));
																StatusCode=108;
															}
													    else
														sprintf(Buffer1,"MOTOR OFF BECAUSE REVERSE PHASE");
													}
													break;
												case STATE_MOTOR_TRIP_CURRENTSPP_SMS:
													{
														sprintf(Buffer1,"MOTOR OFF BECAUSE CURRENT SENSEING SPP\n");
														if(Appmodeon==1) {
													    sprintf(Buffer1," %02d109\n",(datetime.tm_sec+2));
															StatusCode=109;
														}

														switch(CSPPValue)
														{
															case 1:
																sprintf(Buffer1,"%sRC LESS\n",Buffer1);
																break;
															case 2:
																sprintf(Buffer1,"%sYC LESS\n",Buffer1);
																break;
															case 3:
																sprintf(Buffer1,"%sBC LESS\n",Buffer1);
																break;
															case 4:
																sprintf(Buffer1,"%sRC AND YC BOTH DIFF MORE THAN 50%\n",Buffer1);
																break;
															case 5:
																sprintf(Buffer1,"%sYC AND BC BOTH DIFF MORE THAN 50%\n",Buffer1);
																break;
															default:
																sprintf(Buffer1,"%sYC AND BC BOTH DIFF MORE THAN 50%\n",Buffer1);;
																break;
														}
													}
													break;
												case STATE_MOTOR_TRIP_LOWVOLTAGE_SMS:
													{
															sprintf(Buffer1,"MOTOR OFF LOW VOLT\n");
															if(WorkingOn3Phas == 1)
															{
																if(Appmodeon==1)
																{
																	sprintf(Buffer1,"%02d110\n",(datetime.tm_sec+2));
																	StatusCode=110;
																/* else
																{ */

																	if(WhichPhaseHaveingProblem == 1)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nRY VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltIII,nTimerSettings.DiffVoltIII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 2)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nYB VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltIII,nTimerSettings.DiffVoltIII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 3)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nBR VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltIII,nTimerSettings.DiffVoltIII,TripVoltage);
																	}						
																	else
																	{
																		sprintf(Buffer1,"No Voltage\n");
																	}
																}
																else
																{

																	if(WhichPhaseHaveingProblem == 1)
																	{
																		sprintf(Buffer1,"%sRUNING AT 3PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nRY VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltIII,nTimerSettings.DiffVoltIII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 2)
																	{
																		sprintf(Buffer1,"%sRUNING AT 3PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nYB VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltIII,nTimerSettings.DiffVoltIII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 3)
																	{
																		sprintf(Buffer1,"%sRUNING AT 3PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nBR VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltIII,nTimerSettings.DiffVoltIII,TripVoltage);
																	}						
																	else
																	{
																		sprintf(Buffer1,"No Voltage\n");
																	}
																}
															}
															else
															{
																if(Appmodeon==1)
																{
																	StatusCode=111;
																	sprintf(Buffer1,"%02d111\n",(datetime.tm_sec+2));
																	if(WhichPhaseHaveingProblem == 1)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nRY VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltII,nTimerSettings.DiffVoltII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 2)
																	{
																		sprintf(Buffer1,"%s2PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nYB VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltII,nTimerSettings.DiffVoltII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 3)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nBR VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltII,nTimerSettings.DiffVoltII,TripVoltage);
																	}						
																	else
																	{
																		sprintf(Buffer1,"No Voltage\n");
																	}
																}
																else
																{

