AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
																	if(WhichPhaseHaveingProblem == 1)
																	{
																		sprintf(Buffer1,"%sRUNING AT 2PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nRY VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltII,nTimerSettings.DiffVoltII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 2)
																	{
																		sprintf(Buffer1,"%sRUNING AT 2PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nYB VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltII,nTimerSettings.DiffVoltII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 3)
																	{
																		sprintf(Buffer1,"%sRUNING AT 2PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nBR VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.LowVoltII,nTimerSettings.DiffVoltII,TripVoltage);
																	}						
																	else
																	{
																		sprintf(Buffer1,"No Voltage\n");
																	}
																}


															}
														}
													break;
												case STATE_MOTOR_TRIP_HIGHVOLTAGE_SMS:
												   {
															sprintf(Buffer1,"MOTOR OFF HIGH VOLT\n");
															if(WorkingOn3Phas == 1)
															{
																if(Appmodeon==1)
																{
																	StatusCode=112;
																	sprintf(Buffer1,"%02d112\n",(datetime.tm_sec+2));
																	if(WhichPhaseHaveingProblem == 1)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nRY VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltIII,nTimerSettings.HiDiffVoltIII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 2)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nYB VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltIII,nTimerSettings.HiDiffVoltIII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 3)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nBR VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltIII,nTimerSettings.HiDiffVoltIII,TripVoltage);
																	}						
																	else
																	{
																		sprintf(Buffer1,"No Voltage\n");
																	}
																}
																
																
																else
																{

																	if(WhichPhaseHaveingProblem == 1)
																	{
																		sprintf(Buffer1,"%sRUNING AT 3PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nRY VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltIII,nTimerSettings.HiDiffVoltIII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 2)
																	{
																		sprintf(Buffer1,"%sRUNING AT 3PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nYB VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltIII,nTimerSettings.HiDiffVoltIII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 3)
																	{
																		sprintf(Buffer1,"%sRUNING AT 3PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nBR VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltIII,nTimerSettings.HiDiffVoltIII,TripVoltage);
																	}						
																	else
																	{
																		sprintf(Buffer1,"No Voltage\n");
																	}
																}
															}
															else
															{
																if(Appmodeon==1)
																{
																	StatusCode=113;
																	sprintf(Buffer1,"%02d113\n",(datetime.tm_sec+2));
																	if(WhichPhaseHaveingProblem == 1)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nRY VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltII,nTimerSettings.HiDiffVoltII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 2)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nYB VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltII,nTimerSettings.HiDiffVoltII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 3)
																	{
																		sprintf(Buffer1,"%s\nSET VOLT = %03d\n  DIFF VOLT = %03d\nBR VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltII,nTimerSettings.HiDiffVoltII,TripVoltage);
																	}						
																	else
																	{
																		sprintf(Buffer1,"No Voltage\n");
																	}
																	
																}
																else
																{

																	if(WhichPhaseHaveingProblem == 1)
																	{
																		sprintf(Buffer1,"%sRUNING AT 2PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nRY VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltII,nTimerSettings.HiDiffVoltII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 2)
																	{
																		sprintf(Buffer1,"%sRUNING AT 2PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nYB VOLT = %03.0f\n",Buffer1,
																				nTimerSettings.HighVoltII,nTimerSettings.HiDiffVoltII,TripVoltage);
																	}
																	else if(WhichPhaseHaveingProblem == 3)
																	{
																		sprintf(Buffer1,"%sRUNING AT 2PH\nSET VOLT = %03d\n  DIFF VOLT = %03d\nBR VOLT = %03.0f\n",Buffer1,
																		        nTimerSettings.HighVoltII,nTimerSettings.HiDiffVoltII,TripVoltage);
																	}						
																	else
																	{
																		sprintf(Buffer1,"No Voltage\n");
																	}
																}


															}
														}

													break;
												case STATE_MOTOROF_3PHASE_ONLY_SMS:
												{
													sprintf(Buffer1,"MOTOR CAN'T START BEACUSE 3 PHASE SELECTION ONLY\n");
												}
												break;
												case STATE_STGIII_SMS:
													{
														sprintf(Buffer1,"3 Phase Current Set\n");
														if(nMSettings.DryRunOnOff == 1)
															sprintf(Buffer1,"%sDRYRUN SCAN ON\n",Buffer1);
														else
															sprintf(Buffer1,"%sDRYRUN SCAN OFF\n",Buffer1);
															FloatroString1Dig((char*)TpS1tr,nTimerSettings.DrAmpsIII);
														sprintf(Buffer1,"%sDRY RUN AMPS FOR 3 PHASE = %s\n",Buffer1,TpS1tr);

														if(nTimerSettings.OlOnOff == 1)
															sprintf(Buffer1,"%sOVER LOAD SCAN ON\n",Buffer1);
														else
															sprintf(Buffer1,"%sOVER LOAD SCAN OFF",Buffer1);
														FloatroString1Dig((char*)TpS1tr,nTimerSettings.OlAmpsIII);
														sprintf(Buffer1,"%sOVER LOAD AMPS FOR 3 PHASE = %s\n",Buffer1,TpS1tr);


													//	sprintf(Buffer1,"%sDRY RUN SCAN TIME = %02d:%02d:%02d\n",Buffer1,nTimerSettings.DrScHr,nTimerSettings.DrScMin,nTimerSettings.DrScSec);
													//	sprintf(Buffer1,"%sOVER LOAD SCAN TIME = %02d:%02d:%02d\n",Buffer1,nTimerSettings.OlScanHr,nTimerSettings.OlScanMin,nTimerSettings.OlScanSec);
													}
													break;
												case STATE_STGII_SMS:
													{
														sprintf(Buffer1,"2 Phase Current Set\n");
														if(nMSettings.DryRunOnOff == 1)
															sprintf(Buffer1,"%sDRYRUN SCAN ON\n",Buffer1);
														else
															sprintf(Buffer1,"%sDRYRUN SCAN OFF\n",Buffer1);
															FloatroString1Dig((char*)TpS1tr,nTimerSettings.DrAmpsII);
														sprintf(Buffer1,"%sDRY RUN AMPS FOR 2 PHASE = %s\n",Buffer1,TpS1tr);

														if(nTimerSettings.OlOnOff == 1)
															sprintf(Buffer1,"%sOVER LOAD SCAN ON\n",Buffer1);
														else
															sprintf(Buffer1,"%sOVER LOAD SCAN OFF",Buffer1);
														 FloatroString1Dig((char*)TpS1tr,nTimerSettings.OlAmpsIII);
														sprintf(Buffer1,"%sOVER LOAD AMPS FOR 2 PHASE = %s\n",Buffer1,TpS1tr);

													//	sprintf(Buffer1,"%sDRY RUN SCAN TIME = %02d:%02d:%02d\n",Buffer1,nTimerSettings.DrScHr,nTimerSettings.DrScMin,nTimerSettings.DrScSec);
													//	sprintf(Buffer1,"%sOVER LOAD SCAN TIME = %02d:%02d:%02d\n",Buffer1,nTimerSettings.OlScanHr,nTimerSettings.OlScanMin,nTimerSettings.OlScanSec);
													}
													break;
												default:
												{
													sprintf(Buffer1,"UnKnown Please send this to Customer Support Error : nSTATE_MOTOR_SMS = %d",nSTATE_MOTOR_SMS);

