AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
												}
												break;

											}
										}
										else if(STATE_SENDSMS != STATE_NO_SMS)
										{
											switch(STATE_SENDSMS)
											{
												case STATE_SMSON_SMS:
												{
													if(nMSettings.SMSOnOff == 1)
														sprintf(Buffer1,"SMS ON");
													else
														sprintf(Buffer1,"SMS OFF");
												}
												break;												 
												case STATE_LIMIT_SMSON_SMS:
												{
													if(limitsmsonof == 1)
														sprintf(Buffer1,"SMS LIMIT ON");
													else
														sprintf(Buffer1,"SMS LIMIT OFF");
												}
												break;

												case STATE_stSMSON_SMS:
												{
													if(nMSettings.staticSMSOnOff == 1)
														sprintf(Buffer1,"STATICSMS ON");
													else
														sprintf(Buffer1,"STATICSMS OFF");
												}
												break;
												case STATE_RESP_SMS:
												{
													if(nMSettings.responseOnOf == 1)
														sprintf(Buffer1,"RESPONSE ON");
													else
														sprintf(Buffer1,"RESPONSE OFF");
												}
												break;
//												case STATE_canSMSON_SMS:
//												{
//													if(nMSettings.canSMSOnOff == 1)
//														sprintf(Buffer1,"DELAY TIME VALVE ON OFF FUNCTION ON");
//													else
//														sprintf(Buffer1,"DELAY TIME VALVE ON OFF FUNCTION OFF");
//												}
//												break;
//												case STATE_sampleSMSON_SMS:
//												{
//													if(nMSettings.sampleSMSOnOff == 1)
//														sprintf(Buffer1,"SAMPLE SMS ON");
//													else
//														sprintf(Buffer1,"SAMPLE SMS OFF");
//												}
//												break;
//												case STATE_dataSMSON_SMS:
//												{
//													if(nMSettings.dataSMSOnOff == 1)
//														sprintf(Buffer1,"DATA SMS ON");
//													else
//														sprintf(Buffer1,"DATA SMS OFF");
//												}
//												break;

												case STATE_gethidesmson_SMS:
												{
													if(nMSettings.gethidesmsonoff == 1)
														sprintf(Buffer1,"NAME SMS ON");
													else
														sprintf(Buffer1,"NAME SMS OFF");
												}
												break;
												case STATE_SFB_SMS:
												{
													if(nMSettings.SfbOnOff == 1)
														sprintf(Buffer1,"STARTER FEEDBACK ON");
													else
														sprintf(Buffer1,"STARTER FEEDBACK OFF");
												}
												break;
//												case STATE_PRESSURE_SMS:
//												{
//													if(nMSettings.PressureOnOff == 1)
//														sprintf(Buffer1,"PRESSURE SCAN ON");
//													else
//														sprintf(Buffer1,"PRESSURE SCAN OFF");

//												}
//												break;
												case STATE_MANUALSWITCH_SMS:
												{
													if(nMSettings.ManualswitchOnOff == 1)
														sprintf(Buffer1,"MANUALSWITCH SCAN ON");
													else
														sprintf(Buffer1,"MANUALSWITCH SCAN OFF");

												}
												break;
												case STATE_TANK_SMS:
												{
													if(nMSettings.TankOnOff == 1)
														sprintf(Buffer1,"TANK LEVEL SCAN ON");
													else
														sprintf(Buffer1,"TANK LEVEL SCAN OFF");

												}
												break;
												case STATE_SUMP_SMS:
												{
													if(nMSettings.SumpOnOff == 1)
														sprintf(Buffer1,"SUMP LEVEL SCAN ON");
													else
														sprintf(Buffer1,"SUMP LEVEL SCAN OFF");

												}
												break;
//												case STATE_SUMP_RST_SMS:
//												{
//													if(nMSettings.SumprstOnOff == 1)
//														sprintf(Buffer1,"SUMP RESTART ON");
//													else
//													if(nMSettings.SumprstOnOff == 0)
//														sprintf(Buffer1,"SUMP RESTART OFF");
//												}
//												break;
												case STATE_DRYRUN_SMS:
												{
													if(nMSettings.DryRunOnOff == 1)
														sprintf(Buffer1,"DRYRUN SCAN ON");
													else
														sprintf(Buffer1,"DRYRUN SCAN OFF");

												}
												break;
												case STATE_SECONOF_SMS:
												{
													if(nMSettings.SecOnOf == 1)
														sprintf(Buffer1,"SECURITY ON");
													else
														sprintf(Buffer1,"SECURITY OFF");

												}
												break;
												case STATE_TARGET_SMS:
												{
													if(nMSettings.TargetOnOff == 1)
														sprintf(Buffer1,"TARGET CALL ON");
													else
														sprintf(Buffer1,"TARGET CALL OFF");
												}
												break;
												case STATE_PWRVFB_SMS:
												{
													if(nMSettings.pwrvfbOnOf== 1)
														sprintf(Buffer1,"POWER VFB ON\n");
													else
														sprintf(Buffer1,"POWER VFB OFF\n");
												}
												break;

												case STATE_VFB_SMS:
												{
													if(nMSettings.VBFOnOff== 1)
														sprintf(Buffer1,"VOICE FEEDBACK ON");
													else
														sprintf(Buffer1,"VOICE FEEDBACK OFF");
												}
												break;
												case STATE_ONDELAY_SMS:
												{
													sprintf(Buffer1,"ON DELAY = %02d:%02d:%02d",nTimerSettings.POnHr,nTimerSettings.POnMin,nTimerSettings.POnSec);
												}
												break;
												case STATE_SDDELAY_SMS:
												{
													sprintf(Buffer1,"STAR DELTA DELAY = %02d:%02d:%02d",nTimerSettings.SDHr,nTimerSettings.SDMin,nTimerSettings.SDSec);
												}
												break;
												case STATE_SFBDELAY_SMS:
												{
													sprintf(Buffer1,"STARTER FEEDBACK DELAY = %02d:%02d:%02d",nTimerSettings.SfbHr,nTimerSettings.SfbMin,nTimerSettings.SfbSec);
												}
												break;
												case STATE_DRRSTONOF_SMS:
												{
													if(nTimerSettings.DrReOnOf == 1)
														sprintf(Buffer1,"DRYRUN RESTART ON");
													else
														sprintf(Buffer1,"DRYRUN RESTART OFF");
												}
												break;
												case STATE_DRRST_SMS:
												{
													sprintf(Buffer1,"DRYRUN RESTART TIME=%02d:%02d:%02d",nTimerSettings.DrReHr,nTimerSettings.DrReMin,nTimerSettings.DrReSec);
												}
												break;
												case STATE_DRSCANONOF_SMS:
												{
													if(nTimerSettings.DrScOnOf == 1)
														sprintf(Buffer1,"DRYRUN SCAN ON");
													else
														sprintf(Buffer1,"DRYRUN SCAN OFF");
												}
												break;
												case STATE_DRSCAN_SMS:
												{
													sprintf(Buffer1,"DRYRUN SCAN TIME=%02d:%02d:%02d",nTimerSettings.DrScHr,nTimerSettings.DrScMin,nTimerSettings.DrScSec);
												}
												break;
												case STATE_MAXTIMONOF_SMS:
												{
													if(nTimerSettings.MaxRnOnOf == 1)
														sprintf(Buffer1,"MAXIMUM RUN TIMER ON");
													else
														sprintf(Buffer1,"MAXIMUM RUN TIMER OFF");
												}
												break;
												case STATE_MAXTIM_SMS:
												{
													sprintf(Buffer1,"MAXIMUM RUN TIMER=%02d:%02d:%02d",nTimerSettings.MaxRnHr,nTimerSettings.MaxRnMin,nTimerSettings.MaxRnSec);
												}
												break;
												case STATE_CYCLICONOF_SMS:
												{
													if(nTimerSettings.CycLicOnOf == 1)
														sprintf(Buffer1,"CYCLIC TIMER ON\n");
													else
														sprintf(Buffer1,"CYCLIC TIMER OFF\n");
													sprintf(Buffer1,"%sCYCLIC ON TIMER=%02dH:%02dM\n",Buffer1,nTimerSettings.CycLicOnHr,nTimerSettings.CycLicOnMin);

