AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
													sprintf(Buffer1,"%sCYCLIC OF TIMER=%02dH:%02dM",Buffer1,nTimerSettings.CycLicOfHr,nTimerSettings.CycLicOfMin);
												}
												break;
												case STATE_FOTA_SMS:
												{
													sprintf(Buffer1,"FOTA UPDATION FAILED"); 
 													
												}
												break;
//												case STATE_MQTT_STATUS_SMS:
//												{  
//												    if(MqttInitStatus==1)
//													sprintf(Buffer1,"MQTT CONNECTED"); 
//													else
//													sprintf(Buffer1,"MQTT DISCONNECTED"); 
// 													
//												}
//												break;										 
 
												case STATE_VLIMITSMSSET_SMS:		//valve start from on time sms
												{
													sprintf(Buffer1,"V49 SET SMS LIMIT = %03d\n",limitsmsset);
													if(limitsmsonof == 1)
														sprintf(Buffer1,"%sSMS LIMIT ON\n",Buffer1);
													else
														sprintf(Buffer1,"%sSMS LIMIT OFF\n",Buffer1);


												}
												break;

												case STATE_LIMITSMSSET_SMS:		//valve start from on time sms
												{
													sprintf(Buffer1,"SET SMS LIMIT =%03d\n",limitsmsset);
													if(limitsmsonof == 1)
														sprintf(Buffer1,"%sSMS LIMIT ON\n",Buffer1);
													else
														sprintf(Buffer1,"%sSMS LIMIT OFF\n",Buffer1);

												}
												break;
												 
												case STATE_RTCONOF_SMS:
												{
													if(nTimerSettings.RTCOnOf == 1)
														sprintf(Buffer1,"REAL TIME CLOCK ON");
													else
														sprintf(Buffer1,"REAL TIME CLOCK OFF");
												}
												break;
												case STATE_RTCTIMON1_SMS:
												{
													sprintf(Buffer1,"RTC1 ON= %02dH:%02dM\n",nTimerSettings.RTCOnHr[1],nTimerSettings.RTCOnMin[1]);

													sprintf(Buffer1,"%sRTC1 OFF= %02dH:%02dM",Buffer1,nTimerSettings.RTCOfHr[1],nTimerSettings.RTCOfMin[1]);
												}
												break;
												case STATE_RTCTIMON2_SMS:
												{
													sprintf(Buffer1,"RTC2 ON= %02dH:%02dM\n",nTimerSettings.RTCOnHr[2],nTimerSettings.RTCOnMin[2]);

													sprintf(Buffer1,"%sRTC2 OFF= %02dH:%02dM",Buffer1,nTimerSettings.RTCOfHr[2],nTimerSettings.RTCOfMin[2]);
												}
												break;
												case STATE_RTCTIMON3_SMS:
												{
													sprintf(Buffer1,"RTC3 ON= %02dH:%02dM\n",nTimerSettings.RTCOnHr[3],nTimerSettings.RTCOnMin[3]);

													sprintf(Buffer1,"%sRTC3 OFF= %02dH:%02dM",Buffer1,nTimerSettings.RTCOfHr[3],nTimerSettings.RTCOfMin[3]);
												}
												break;
												case STATE_RTCTIMON4_SMS:
												{
													sprintf(Buffer1,"RTC4 ON= %02dH:%02dM\n",nTimerSettings.RTCOnHr[4],nTimerSettings.RTCOnMin[4]);

													sprintf(Buffer1,"%sRTC4 OFF= %02dH:%02dM",Buffer1,nTimerSettings.RTCOfHr[4],nTimerSettings.RTCOfMin[4]);
												}
												break;
												case STATE_DATETIME_SMS:
												{													 
													sprintf(Buffer1,"DATE=%02d/%02d/%04d \n TIME=%02d:%02d:%02d \n STORED 4G AG4 BSD PCGv%s",datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,Version);//DSV6.3F
												}
												break;												 
												case STATE_SCRDLONOF_SMS:
												{
													if(nTimerSettings.ScrDlOnOff == 1)
														sprintf(Buffer1,"SCR TIMER ON");
													else
														sprintf(Buffer1,"SCR TIMER OFF");

												}
												break;
												case STATE_POSCRDLONOF_SMS:
												{
													if(nTimerSettings.PoScrDlOnOff == 1)
														sprintf(Buffer1,"SCR DELAY TIMER ON");
													else
														sprintf(Buffer1,"SCR DELAY TIMER OFF");

												}
												break;
												case STATE_SCRDEL_SMS:
												{
													sprintf(Buffer1,"SCR TIMER  = %02d:%02d:%02d",nTimerSettings.ScrDlHr,nTimerSettings.ScrDlMin,nTimerSettings.ScrDlSec);
												}
												break;
												case STATE_POSCRDEL_SMS:
												{
													sprintf(Buffer1,"SCR TIMER  = %02d:%02d:%02d",nTimerSettings.PoScrDlHr,nTimerSettings.PoScrDlMin,nTimerSettings.PoScrDlSec);
												}
												break;
												case STATE_LOWVOLTONOFF_SMS:
												{
													if(nTimerSettings.LowVoltOnOff == 1)
														sprintf(Buffer1,"LOW VOLTAGE SCAN ON");
													else
														sprintf(Buffer1,"LOW VOLTAGE SCAN OFF");

												}
												break;
												case STATE_LOWVOLTII_SMS:
												{
													sprintf(Buffer1,"LOW VOLTAGE TRIP FOR 2 PHASE = %03d",nTimerSettings.LowVoltII);
												}
												break;
												case STATE_LOWVOLTIII_SMS:
												{
													sprintf(Buffer1,"LOW VOLTAGE TRIP FOR 3 PHASE = %03d",nTimerSettings.LowVoltIII);
												}
												break;
												case STATE_HIGHVOLTONOFF_SMS:
												{
													if(nTimerSettings.HighVoltOnOff == 1)
														sprintf(Buffer1,"HIGH VOLTAGE SCAN ON");
													else
														sprintf(Buffer1,"HIGH VOLTAGE SCAN OFF");

												}
												break;
												case STATE_HIGHVOLTII_SMS:
												{
													sprintf(Buffer1,"HIGH VOLTAGE TRIP FOR 2 PHASE = %03d",nTimerSettings.HighVoltII);
												}
												break;
												case STATE_HIGHVOLTIII_SMS:
												{
													sprintf(Buffer1,"HIGH VOLTAGE TRIP FOR 3 PHASE = %03d",nTimerSettings.HighVoltIII);
												}
												break;
												case STATE_IMBVOLT_SMS:
												{
													sprintf(Buffer1,"IMBALANCE VOLTAGE = %03d",nTimerSettings.ImbVolt);
												}
												break;
												case STATE_PFCVOLT_SMS:
												{
													sprintf(Buffer1,"SET PFC VOLTAGE = %03d",nTimerSettings.pfcvolt);
												}
												break;
												case STATE_REVPHASE_SMS:
												{
													if(nTimerSettings.RvePhOnoff == 1)
														sprintf(Buffer1,"REVERSE PHASE SCAN ON");
													else
														sprintf(Buffer1,"REVERSE PHASE SCAN OFF");

												}
												break;
												case STATE_CURSPP_SMS:
												{
													if(nTimerSettings.CurSppOnOff == 1)
														sprintf(Buffer1,"CURRENT SPP SCAN ON");
													else
														sprintf(Buffer1,"CURRENT SPP SCAN OFF");

