AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
												}
												break;
												case STATE_SPP_SMS:
												{
													if(nTimerSettings.SppOnoff == 1)
														sprintf(Buffer1,"VOLTAGE SENSING SPP ON");
													else
														sprintf(Buffer1,"VOLTAGE SENSING SPP OFF");

												}
												break;
												case STATE_CALFLOWII_SMS:
												{
													//FloatroString1Dig(TpStr,nTimerSettings.DrAmpsII);
													sprintf(Buffer1,"CALCULATED FLOW SET FOR 2 PHASE = %03.01f",nTimerSettings.calflow2);
												}
												break;
												case STATE_CALFLOWIII_SMS:
												{
													//FloatroString1Dig(TpStr,nTimerSettings.DrAmpsII);
													sprintf(Buffer1,"CALCULATED FLOW SET FOR 3 PHASE = %03.01f",nTimerSettings.calflow3);
												}
												break;
												case STATE_DRAMPII_SMS:
												{
													//FloatroString1Dig(TpStr,nTimerSettings.DrAmpsII);
													sprintf(Buffer1,"DRY RUN AMPS FOR 2 PHASE = %03.01f",nTimerSettings.DrAmpsII);
												}
												break;
												case STATE_DRAMPIII_SMS:
												{
												    //FloatroString1Dig(TpStr,nTimerSettings.DrAmpsIII);
													sprintf(Buffer1,"DRY RUN AMPS FOR 3 PHASE = %03.01f",nTimerSettings.DrAmpsIII);
												}
												break;
												case STATE_OLINOFF_SMS:
												{
													if(nTimerSettings.OlOnOff == 1)
														sprintf(Buffer1,"OVER LOAD SCAN ON");
													else
														sprintf(Buffer1,"OVER LOAD SCAN OFF");

												}
												break;
                                                case STATE_LOWPRESSONOF_SMS:
												{
													if(nTimerSettings.lowpressOnOff == 1)
														sprintf(Buffer1,"LOW PRESSURE SCAN ON");
													else
														sprintf(Buffer1,"LOW PRESSURE SCAN OFF");

												}
												break;
												case STATE_HIGHPRESSONOF_SMS:
												{
													if(nTimerSettings.highpressOnOff == 1)
														sprintf(Buffer1,"HIGH PRESSURE SCAN ON");
													else
														sprintf(Buffer1,"HIGH PRESSURE SCAN OFF");

												}
												break;
												case STATE_LOWPRESS_SMS:
												{
												 //FloatroString1Dig(TpStr,nTimerSettings.OlAmpsII);
													sprintf(Buffer1,"SET LOW PRESSURE = %02.01f",nTimerSettings.lowpress);
												}
												break;
												case STATE_HIGHPRESS_SMS:
												{
												 //FloatroString1Di g(TpStr,nTimerSettings.OlAmpsII);
													sprintf(Buffer1,"SET HIGH PRESSURE = %02.01f",nTimerSettings.highpress);
												}
												break;
												case STATE_OLAMPSII_SMS:
												{
												 //FloatroString1Dig(TpStr,nTimerSettings.OlAmpsII);
													sprintf(Buffer1,"OVER LOAD AMPS FOR 2 PHASE = %03.01f",nTimerSettings.OlAmpsII);
												}
												break;
												case STATE_OLAMPSIII_SMS:
												{
												    //FloatroString1Dig(TpStr,nTimerSettings.OlAmpsIII);
													sprintf(Buffer1,"OVER LOAD AMPS FOR 3 PHASE = %03.01f",nTimerSettings.OlAmpsIII);
												}
												break;
												case STATE_OLSCAN_SMS:
												{
													sprintf(Buffer1,"OVER LOAD SCAN TIME = %02d:%02d:%02d",nTimerSettings.OlScanHr,nTimerSettings.OlScanMin,nTimerSettings.OlScanSec);

												}
												break;
												case STATE_AUTOSTII_SMS:
												{
													if(nTimerSettings.AutoStIIOnOff == 1)
														sprintf(Buffer1,"II PHASE ON");
													else
														sprintf(Buffer1,"II PHASE OFF");

												}
												break;
												case STATE_AUTOSTIII_SMS:
												{
													if(nTimerSettings.AutoStIIIOnOff == 1)
														sprintf(Buffer1,"MOBILE SET 3 PHASE ON ");
													else
														sprintf(Buffer1,"MOBILE SET 3 PHASE OFF");

												}
												break;
												case STATE_AUTOOLDRRST_SMS:
												{
													if(nTimerSettings.AutoOlDrRstIIOnOff == 1)
														sprintf(Buffer1,"OVER LOAD RESET ON");
													else
														sprintf(Buffer1,"OVER LOAD RESET OFF");

												}
												break;
												case STATE_AUTODRRUNRST_SMS:
												{
													if(nTimerSettings.AutoDrRunRstIIOnOff == 1)
														sprintf(Buffer1,"DRY RUN RESET ON");
													else
														sprintf(Buffer1,"DRY RUN RESET OFF");

												}
												break;
												case STATE_POWERFACTOR_SMS:
												{
													if(nTimerSettings.pfcOnOff==1)
														sprintf(Buffer1,"POWER FACTOR CORRECTION ON");
													else
														sprintf(Buffer1,"POWER FACTOR CORRECTION OFF");

												}
												break;
												case STATE_MANULONOF_SMS:
												{
													if(nTimerSettings.ManualOnOff == 1)
														sprintf(Buffer1,"MANUAL ON ");
													else
														sprintf(Buffer1,"MANUAL OFF");

												}
												break;
												case STATE_OLRSTVOLONOFF_SMS:
												{
													if(nTimerSettings.OlRstVolOnoff == 1)
														sprintf(Buffer1,"OL RESTART VOLTAGE ON");
													else
														sprintf(Buffer1,"OL RESTART VOLTAGE OFF");

												}
												break;
												case STATE_OLRSTVOL_SMS:
												{
													sprintf(Buffer1,"OL RESTART VOLTAGE = %03d",nTimerSettings.OlRstVol);
												}
												break;
												case STATE_DROCCONOFF_SMS:
												{
													if(nTimerSettings.DrOccurOnOff == 1)
														sprintf(Buffer1,"DRY RUN OCCURANCE SCAN ON");
													else
														sprintf(Buffer1,"DRY RUN OCCURANCE SCAN OFF");

												}
												break;
												case STATE_DROCCTIM_SMS:
												{
													sprintf(Buffer1,"DRY RUN OCCURANCE TIME = %02d:%02d:%02d",nTimerSettings.DrOccurTimHr,nTimerSettings.DrOccurTimMin,nTimerSettings.DrOccurTimSec);
												}
												break;
												case STATE_DROCCNUM_SMS:
												{
													sprintf(Buffer1,"NUMBER OF DRY RUN OCCURANCE  = %03d",nTimerSettings.DrOccurNum);
												}
												break;
												case STATE_DIFFVOLTII_SMS:
												{
													sprintf(Buffer1,"DIFFERENCE LOW VOLTAGE FOR 2 PHASE = %03d\n",nTimerSettings.DiffVoltII );
												}
												break;
												case STATE_DIFFVOLTIII_SMS:
												{
													sprintf(Buffer1,"DIFFERENCE LOW VOLTAGE FOR 3 PHASE = %03d\n",nTimerSettings.DiffVoltIII );
												}
												break;											 
												case STATE_CTRON_SMS:
												{
													sprintf(Buffer1,"CT R SENSING ON\n\r");
												}
												break;
												case STATE_CTROF_SMS:
												{
													sprintf(Buffer1,"CT R SENSING OFF\n\r");
												}
												break;
												case STATE_CTYON_SMS:
												{
													sprintf(Buffer1,"CT Y SENSING ON\n\r");
												}
												break;
												case STATE_CTYOF_SMS:
												{
													sprintf(Buffer1,"CT Y SENSING OFF\n\r");
												}
												break;
												case STATE_CTBON_SMS:
												{
													sprintf(Buffer1,"CT B SENSING ON\n\r");
												}
												break;
												case STATE_CTBOF_SMS:
												{
													sprintf(Buffer1,"CT B SENSING OFF\n\r");
												}
												break;
												case STATE_SERVICE_SMS:
												{
												if(nMSettings.gethidesmsonoff == 1)
												sprintf(Buffer1,"SERVICE NUMBER REG. DONE\n ");
												else
												sprintf(Buffer1,"SERVICE NUMBER REG. DONE\n NUMBER=%s",ServiceNumber);
												}
												break;
												case STATE_AUTORST2ONOFF_SMS:
												{
													if(nTimerSettings.AutoRst2On == 1)
														sprintf(Buffer1,"AUTO RESET 2 ON");
													else
														sprintf(Buffer1,"AUTO RESET 2 OFF");

