AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
												}
												break;
												case STATE_AUTORSTONOFF_SMS:
												{
													if(nTimerSettings.AutoRstOn == 1)
														sprintf(Buffer1,"MOBILE RESET ON");
													else
														sprintf(Buffer1,"MOBILE RESET OFF");

												}
												break;
												case STATE_HIDIFFVOLTII_SMS:
												{
													sprintf(Buffer1,"DIFFERENCE HIGH VOLTAGE FOR 2 PHASE = %03d\n",nTimerSettings.HiDiffVoltII );

												}
												break;
												case STATE_HIDIFFVOLTIII_SMS:
												{
													sprintf(Buffer1,"DIFFERENCE HIGH VOLTAGE FOR 3 PHASE = %03d\n",nTimerSettings.HiDiffVoltIII );
												}
												break;
												default:
												{
													sprintf(Buffer1,"UnKnown Please send this to Customer Support Error : STATE_SENDSMS = %d",STATE_SENDSMS);
												}
												break;
											}
										}
										//else if(PowerOnSms == 1)
										//else if((PowerOnSms == 1) && (creg_reset_flag==0))
										
											/*Power OnOff SMS*/
											else if(PowerOnSms == 1)
											{
											/* if(creg_reset_flag==0)
											{ */
											checkpower=Check2Phase();
											if(checkpower == 3)
											{
													if(MakeRealyOn == 1 && nTimerSettings.AutoRstOn ==1)
													{
															if(Appmodeon==1) { 
																sprintf(Buffer1," %02d031\n",(datetime.tm_sec+2));
																StatusCode=31;
															}
															else
																sprintf(Buffer1,"AUTO ON \n POWER ON WITH 3 PHASE");
													}
													else if(MakeRealyOn == 1 && nTimerSettings.AutoRstOn ==0)
													{
															if(Appmodeon==1) {
																sprintf(Buffer1," %02d032\n",(datetime.tm_sec+2));
																StatusCode=32;
															}
															else
																sprintf(Buffer1,"AUTO OFF \n POWER ON WITH 3 PHASE\n AUTO RESET OFF");
													}
													else
													{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d033\n",(datetime.tm_sec+2));
															StatusCode=33;
														}
														else
															sprintf(Buffer1,"AUTO OFF \n POWER ON WITH 3 PHASE");
													}
											}
											else
											{
													if(MakeRealyOn == 1 && nTimerSettings.AutoRstOn ==1)
													{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d034\n",(datetime.tm_sec+2));
															StatusCode=34;
														}
														else
															sprintf(Buffer1,"AUTO ON \n POWER ON WITH 2 PHASE");
													}
													else if(MakeRealyOn == 1 && nTimerSettings.AutoRstOn ==0)
													{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d035\n",(datetime.tm_sec+2));
															StatusCode=35;
														}
														else
															sprintf(Buffer1,"AUTO OFF \n POWER ON WITH 2 PHASE\n AUTO RESET OFF");
													}
													else
													{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d036\n",(datetime.tm_sec+2));
															StatusCode=36;
														}
														else
															sprintf(Buffer1,"AUTO OFF \n POWER ON WITH 2 PHASE");  //dg_changed  1 space removed before power
													}
											}
											sprintf(Buffer1,"%s\nR=%03.0f;",Buffer1,nCurretnCond.RVoltage);
											sprintf(Buffer1,"%sY=%03.0f;",Buffer1,nCurretnCond.YVoltage);   //dg_changed  removed \n
											sprintf(Buffer1,"%sB=%03.0fV\n",Buffer1,nCurretnCond.BVoltage);  //dg_changed  1 space removed after v
											value = nMoTr.ActofpowerRunTimer;
											TpHr = value/3600;
											value = value%3600;
											TpMin = value/60;
											value = value%60;
											TpSec = value;
											if(Appmodeon==1)
											sprintf(Buffer1,"%sS=%d\nPOF TIM=%02d:%02d:%02d",Buffer1,CSQ,TpHr,TpMin,TpSec);
											// sprintf(Buffer1,"%sS=%d;G=%d;W=%d;\nPOF TIM=%02d:%02d:%02d",Buffer1,CSQ,CGATT,WIFI,TpHr,TpMin,TpSec);
											else
											sprintf(Buffer1,"%sPOF TIM=%02d:%02d:%02d",Buffer1,TpHr,TpMin,TpSec);
										//	}
										}										
										else if(PowerOnSms == 2)
										{ 									        
												if(MakeRealyOn == 1 && nTimerSettings.AutoRstOn ==1)
												{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d037\n",(datetime.tm_sec+2));
															StatusCode=37;
														}
														else
														sprintf(Buffer1,"POWER OFF \n AUTO ON \n MOTOR OFF\n");
												}
												else if(MakeRealyOn == 1 && nTimerSettings.AutoRstOn ==0)
												{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d038\n",(datetime.tm_sec+2));
															StatusCode=38;
														}
														else
														sprintf(Buffer1,"POWER OFF \n AUTO OFF \n MOTOR OFF\n AUTOE RESET OFF");
												}
												else
												{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d039\n",(datetime.tm_sec+2));
															StatusCode=39;
														}
														else
														sprintf(Buffer1,"POWER OFF \n AUTO OFF \n MOTOR OFF");
												}
												//nMoTr.ActonpowerRunTimer;
												value = nMoTr.ActonpowerRunTimer;
												TpHr = value/3600;
												value = value%3600;
												TpMin = value/60;
												value = value%60;
												TpSec = value;
												sprintf(Buffer1,"%s\nPON TIM=%02d:%02d:%02d",Buffer1,TpHr,TpMin,TpSec); 											 
											 
										}
										else if(CallOnOfVer == 1)
										{
											sprintf(Buffer1,"CALL RECEIVE ON");
										}
										else if(CallOnOfVer == 2)
										{
											sprintf(Buffer1,"CALL RECEIVE OFF");
										}
										else if(SMS30MinStatus == 1)
										{
											checkpower=Check2Phase();
											sprintf(Buffer1,"AUTO ON \n\rPOWER ON\n\rMOTOR ON\n\r");
											if(checkpower == 3)
											{
												sprintf(Buffer1,"%sMOTOR STARTED WITH 3 PHASE",Buffer1);
											}
											else
											{
												sprintf(Buffer1,"%sMOTOR STARTED WITH 2 PHASE",Buffer1);
											}
										}
										else if(RegxSmsSend == 1)
										{
											sprintf(Buffer1,"%s",SendSMSString);
										}
										else if(MakeRealyOn == 1)
										{
											if(PowerCurrentCondition == 0)
											{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d040\n",(datetime.tm_sec+2));
															StatusCode=40;
														}
														else
														sprintf(Buffer1,"AUTO ON \nPOWER ON\nMOTOR OFF\n");
														switchonofflag=1;
														// sprintf(Buffer1,"MOBILE ON BY %s\nPOWER ON\nMOTOR OFF\n",WhoMadeRelayOn);
											}
											else
											{
														if(Appmodeon==1) {
															sprintf(Buffer1," %02d041\n",(datetime.tm_sec+2));
															StatusCode=41;
														}
														else
														sprintf(Buffer1,"AUTO ON \nPOWER OFF\nMOTOR OFF\n");
														switchonofflag=1;
														//sprintf(Buffer1,"MOBILE ON BY %s\nPOWER OFF\nMOTOR OFF\n",WhoMadeRelayOn);
											}
										}
										else if(MakeRealyOn == 0)
										{
											if(PowerCurrentCondition == 0)
											{
												if(Appmodeon==1) {
													sprintf(Buffer1," %02d042\n",(datetime.tm_sec+2));
													StatusCode=42;
												}
												else
												sprintf(Buffer1,"MOTOR OFF \nPOWER ON\nMOTOR OFF\n");
												switchonofflag=1;
												  // sprintf(Buffer1,"MOTOR OFF BY %s\nPOWER ON\nMOTOR OFF\n",WhoMadeRelayOn);										
											}

											else
											{
												if(Appmodeon==1) {
													sprintf(Buffer1," %02d043\n",(datetime.tm_sec+2));
													StatusCode=43;
												}
												else
												sprintf(Buffer1,"MOTOR OFF \nPOWER OFF\nMOTOR OFF\n");
												switchonofflag=1;

										//	sprintf(Buffer1,"MOTOR OFF BY %s\nPOWER OFF\nMOTOR OFF\n",WhoMadeRelayOn);

