AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
											}
										}
										else
										{
											Debug("\n\rNo SMS Found SO Exit\n\r"); 
											break;
										}									 
										Debug("\n\r+++++++++++++++SmsNumber[Tpsms] = %s++++++++++\n\r",SmsNumber[Tpsms]);									 
										if(strstr(SmsNumber[Tpsms],"*") != 0)
										{

										}
										else if (strstr(SmsNumber[Tpsms],"#") != 0)
										{

										}
										else if (CheckVoliedPhone(SmsNumber[Tpsms]) == 0)
										{

										}
										else if (((strstr(SmsNumber[Tpsms],StoredPhoneNumber[0]) && (strlen(StoredPhoneNumber[0])>5)) != 0) && DNDSMSFLAG[0]==1)
										{

										}
										else if (((strstr(SmsNumber[Tpsms],StoredPhoneNumber[1])&& (strlen(StoredPhoneNumber[1])>5)) != 0) && DNDSMSFLAG[1]==1)
										{

										}
										else if (((strstr(SmsNumber[Tpsms],StoredPhoneNumber[2])&& (strlen(StoredPhoneNumber[2])>5)) != 0) && DNDSMSFLAG[2]==1)
										{

										}
										else if (((strstr(SmsNumber[Tpsms],StoredPhoneNumber[3])&& (strlen(StoredPhoneNumber[3])>5)) != 0) && DNDSMSFLAG[3]==1)
										{

										}
										else
										{

											runtime(); 
											if(nMSettings.gethidesmsonoff == 1 && switchonofflag==1   )
											{
												sprintf("\n\r+++++++++++++++SmsNumber[Tpsms] = %s++++++++++\n\r",SmsNumber[Tpsms]);											
												sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsstr,"%s\nDATE=%02d/%02d/%04d \nTIME=%02d:%02d:%02d\nOPERATED BY:%s\nFLO:%d\nM TIM=%02ld:%02ld:%02ld-%03d/%03d\n\r",(char *)Buffer1,datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,StoredPhoneNumber[10],MRunflow,RunTimerhr,RunTimermin,RunTimersec,limitsmscount,limitsmsset);
											}

											else if(nMSettings.gethidesmsonoff == 0 && switchonofflag==1)
											{
												Debug("\n\r+++++++++++++++SmsNumber[Tpsms] = %s++++++++++\n\r",SmsNumber[Tpsms]);											
												sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsstr,"%s\nDATE=%02d/%02d/%04d \nTIME=%02d:%02d:%02d\nOPERATED BY:%s\nFLO:%d\nM TIM=%02ld:%02ld:%02ld-%03d/%03d\n\r",(char *)Buffer1,datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,WhoMadeRelayOn,MRunflow,RunTimerhr,RunTimermin,RunTimersec,limitsmscount,limitsmsset);
											}
											else
											{
													Debug("\n\r+++++++++++++++SmsNumber[Tpsms] = %s++++++++++\n\r",SmsNumber[Tpsms]);
													if(removeniagara==0)
													{												
														sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsstr,"%s\nDATE=%02d/%02d/%04d \nTIME=%02d:%02d:%02d\nFLO:%d\nM TIM=%02ld:%02ld:%02ld-%03d/%03d\n\r",(char *)Buffer1,datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,MRunflow,RunTimerhr,RunTimermin,RunTimersec,limitsmscount,limitsmsset);
													}
													else
														sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsstr,"%s\nDATE=%02d/%02d/%04d \nTIME=%02d:%02d:%02d\nM TIM=%02ld:%02ld:%02ld-%03d/%03d\n\r",(char *)Buffer1,datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,RunTimerhr,RunTimermin,RunTimersec,limitsmscount,limitsmsset);
 
											}

											sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsnumber,"%s",SmsNumber[Tpsms]);    //DG_CHANGED
											//sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsnumber,"%s%s",StoredPhoneSmscode[Tpsms],SmsNumber[Tpsms]);
											Debug("\n\r+++++++++++++++SmsStrNumber[%d].Smsstr = %s++++++++++\n\r",NumberOfSmsNeedToSend,SmsStrNumber[NumberOfSmsNeedToSend].Smsstr);
										  sprintf(SmsTCPStrNumber[NumberOfSmsNeedToSend].SmsTCPstr,"");
											NumberOfSmsNeedToSend++;
											limitsmscount++;
										}

									}
									Debug("\n\rSER:%d,%d\n\r",ServiceNumberFound,nMSettings.serviceOnOff );
									
									if(ServiceNumberFound == 1 && nMSettings.serviceOnOff==1)
									{
									   if (CheckVoliedPhone(ServiceNumber) == 0)
										{

										}
										/* else if (strstr(ServiceNumber,StoredPhoneNumber[11]) != 0)
										{

										}*/
										else
										{
														#if _RTC
														ReadDateTime();                            /*Reading Date and Time*/
														#endif
														runtime();
			 

														if(nMSettings.gethidesmsonoff == 1 && switchonofflag==1)
														{
																Debug("\n\r+++++++++++++++SmsNumber[Tpsms] = %s++++++++++\n\r",SmsNumber[Tpsms]);											 
																sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsstr,"%s\nDATE=%02d/%02d/%04d \nTIME=%02d:%02d:%02d\nOPERATED BY:%s\nFLO:%d\nM TIM=%02ld:%02ld:%02ld-%03d/%03d\n\r",(char *)Buffer1,datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,StoredPhoneNumber[10],MRunflow,RunTimerhr,RunTimermin,RunTimersec,limitsmscount,limitsmsset);
														}

														else if(nMSettings.gethidesmsonoff == 0 && switchonofflag==1)
														{
																Debug("\n\r+++++++++++++++SmsNumber[Tpsms] = %s++++++++++\n\r",SmsNumber[Tpsms]);											
																sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsstr,"%s\nDATE=%02d/%02d/%04d \nTIME=%02d:%02d:%02d\nOPERATED BY:%s\nFLO:%d\nM TIM=%02ld:%02ld:%02ld-%03d/%03d\n\r",(char *)Buffer1,datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,WhoMadeRelayOn,MRunflow,RunTimerhr,RunTimermin,RunTimersec,limitsmscount,limitsmsset);
														}
														else
														{
																Debug("\n\r+++++++++++++++SmsNumber[Tpsms] = %s++++++++++\n\r",SmsNumber[Tpsms]);
															
																if(removeniagara==0)
																{    
																	sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsstr,"%s\nDATE=%02d/%02d/%04d \nTIME=%02d:%02d:%02d\nFLO:%d\nM TIM=%02ld:%02ld:%02ld-%03d/%03d\n\r",(char *)Buffer1,datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,MRunflow,RunTimerhr,RunTimermin,RunTimersec,limitsmscount,limitsmsset);
																}  
																else
																	sprintf(SmsStrNumber[NumberOfSmsNeedToSend].Smsstr,"%s\nDATE=%02d/%02d/%04d \nTIME=%02d:%02d:%02d\nM TIM=%02ld:%02ld:%02ld-%03d/%03d\n\r",(char *)Buffer1,datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,RunTimerhr,RunTimermin,RunTimersec,limitsmscount,limitsmsset);

