AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
														}

														sprintf((char *)SmsStrNumber[NumberOfSmsNeedToSend].Smsnumber,"%s%s",StoredPhoneSmscode[11],ServiceNumber);
														sprintf(SmsTCPStrNumber[NumberOfSmsNeedToSend].SmsTCPstr,"");
														limitsmscount++;
														NumberOfSmsNeedToSend++;
                    }
							}


							sprintf(SMS_BUF,"%s\nDATE=%02d/%02d/%04d\nTIME=%02d:%02d:%02d\nFLO:%d\nM TIM=%02ld:%02ld:%02ld-%03d/%03d\n\r",(char *)Buffer1,datetime.tm_mday,datetime.tm_mon,datetime.tm_year,datetime.tm_hour, datetime.tm_min, datetime.tm_sec,MRunflow,RunTimerhr,RunTimermin,RunTimersec,limitsmscountsmsm,limitsmsset);
							////eat_send_msg_to_user(EAT_USER_0, EAT_USER_2, EAT_FALSE, 4, "SMST", EAT_NULL);
							}
							NumberOfSMSSend = 20;
							SendSmsToAll = 0;
							ThisSMSisNotPowerFault = 0;
							NeedToSendSMSCall = 0;
							PowerOnSms = 0;
							//AllSmsSendDone = 1;
							SMS30MinStatus = 0;
							CallOnOfVer = 0;
							RegxSmsSend = 0;
							PowerOffSMS = 0;
							STATE_SENDSMS = STATE_NO_SMS;
							nSTATE_MOTOR_SMS = STATE_NO_MOTOR_SMS;
							nSTATE_MOTOR_ON_SMS=STATE_MOTOR_ON_DEFAULT;
						}
						else if(ModemIsReady == 1 && nMSettings.SMSOnOff == 0)
						{
							NumberOfSMSSend = 20;
							SendSmsToAll = 0;
							ThisSMSisNotPowerFault = 0;
							NeedToSendSMSCall = 0;
							PowerOnSms = 0;
						    // AllSmsSendDone = 1;
							SMS30MinStatus = 0;
							CallOnOfVer = 0;
							RegxSmsSend = 0;
							PowerOffSMS = 0;
							STATE_SENDSMS = STATE_NO_SMS;
							nSTATE_MOTOR_SMS = STATE_NO_MOTOR_SMS;
							NumberOfSmsAllreadySend = NumberOfSmsNeedToSend = 0;    
							SendSMS = 0;                                            
						}
						
	#endif					
}
void Power_event_check(void) {
	
	#if 1
			if(started_firsttime == 0)
			{
				HowManySoundToPlay = 0;
				HowManySoundPlayed = 0;
				PlaySound = 0;
				//aj 	PlayFeedbackSound();
				HowManySoundToPlay = 0;
				HowManySoundPlayed = 0;
				PlaySound = 0;
				started_firsttime = 1;
				power_on_flag_count=1;
			}
			else
			{
				uint8_t pinlevel;
				//SC_GPIOReturnCode pinlevel;
				// sAPI_GpioSetDirection(SPP_PIN,SC_GPIO_IN_PIN);
				//iret = sAPI_GpioGetValue(SPP_PIN);
				//pinlevel= iret;	
				
				/*Raeding Power pin status*/
				pinlevel =POWER_PIN; 
				if(nMSettings.ndebugonof==1)					
				Debug("\n\rPower Pin=%d\n\r",pinlevel);			 
				if(cpbrsearchend == 1 || cpbrsearchend == 0)
				{
					if(pinlevel == 0)
					{
						if(SmsSendOntimer == 0)
						{
							RecheckPinCounter++;
							Debug("RecheckPinCounter is %d",RecheckPinCounter);                                            
							if(RecheckPinCounter>=20)
							{
								RecheckPinCounter = 0;
								if(NumberFound==1 && HowManyNumberFound>0)    									 
								{													 
									if(PowerIsThere!=0 && PowerCurrentCondition!=1)
									{
										CallErrorDelay = 0;
										PowerCondCall = 1;
									}
									MotorStarterTripCount = 0;
									OverAllStarterTrip = 0;
									ActMotorStarterTripTimer =0;
									SendSmsToAll = 1;
									SmsSendOntimer = 1;
									PowerOnSms = 2;
									//skipfbk=0;
									PowerIsThere = 0;
									NoAcceptSMS=0;
									nMoTr.ActofpowerRunTimer=0;
									SendLowVoltageHighVoltage =0;
									SendSPPLowVoltageHighVoltage = 0;
									spplowhighvoldelay=0;
									PowerCurrentCondition = 1;
									PingHighSmsSendOntimer = 0;
									PingHighRecheckPinCounter = 0;
									livedataflagcount1=0;
									livedataflag1=1;
									nCurretnCond.RVoltage = 0;
									nCurretnCond.YVoltage =0;
									nCurretnCond.BVoltage = 0;
									nCurretnCond.RYVoltage = 0;
									nCurretnCond.YBVoltage = 0;
									nCurretnCond.BRVoltage = 0;
									nCurretnCond.Rcurrent =0;
									nCurretnCond.Bcurrent = 0;
									nCurretnCond.Ycurrent = 0;
									//if(nVaTr.REMTIM<=180)   //dg_check
									//{nVaTr.REMTIM=180;
									//Debug("\n\r nVaTr.REMTIM %d on\n\r",nVaTr.REMTIM);}													 
									//if(nMSettings.motor4ctrlonof>=1)
									//valvetimernlightcounter=0;   //dg_added
								  //firstvalenlightsmsonof=1;	 //dg_added
								}
							}
						}
						else
							RecheckPinCounter = 0;
					}
					else
					{                                      
						if(PingHighSmsSendOntimer == 0)
						{											 
							PingHighRecheckPinCounter++;
							if(PingHighRecheckPinCounter>=30)
							{   										      
								PingHighRecheckPinCounter = 0;
								if(NumberFound==1 && HowManyNumberFound>0)  											
								{													
									
									//Debug("POWER IS THERE");
									if(PowerIsThere!=1&& PowerCurrentCondition!=0)
									{
										CallErrorDelay = 0;
										PowerCondCall = 1;
									}													 
									MotorStarterTripCount = 0;
									OverAllStarterTrip = 0;
									ActMotorStarterTripTimer =0;
									PingHighSmsSendOntimer = 1;
									SendSmsToAll = 1;
									PowerOnSms = 1;
									PowerIsThere = 1;
									NoAcceptSMS=0;
									nMoTr.ActonpowerRunTimer=0;
									nMoTr.ActlnightlightRunTimer=0;
									nMoTr.ActllightRunTimer=0;
									nMoTr.ActlfanRunTimer=0;
									SendLowVoltageHighVoltage =0;
									SendSPPLowVoltageHighVoltage = 0;
									spplowhighvoldelay=0;
									PowerCurrentCondition = 0;
									SmsSendOntimer = 0;
									RecheckPinCounter = 0;
									sprintf(buffer,"AUTO START");
									strcpy(WhoMadeRelayOn,buffer);
									livedataflagcount1=0;
									livedataflag1=1;
								}
							}
						}
						else
							PingHighRecheckPinCounter = 0;
					}
				}
			}
			#endif
}
void check_voicefeedback_status(void) {
	#if 0
   if(nMSettings.VBFOnOff == 1&& Callreceiv == 0 )
	{
		IamCalling = 1;
		if(PowerCondCall == 1&& nMSettings.pwrvfbOnOf==1 )
		{
			CallingBecError = 1;
			PowerCondCall = 0;
			PowerCondVoice = 1;
		}
		else if(nSTATE_MOTOR_SMS != STATE_NO_MOTOR_SMS && GCallingBecError != nSTATE_MOTOR_SMS)
		{
			GCallingBecError = nSTATE_MOTOR_SMS;
			switch(nSTATE_MOTOR_SMS)
			{
				case STATE_MOTORON_SMS:
					break;
				case STATE_MOTOROF_SMS:
					break;
				case STATE_MOTOR_STARTER_TRIP_SMS:
					CallingBecError = 1;
					break;
				case STATE_MOTOR_UPPERTANK_TRIP_SMS:
					break;
				case STATE_MOTOR_LOWERTANK_TRIP_SMS:
				   CallingBecError = 1;
					break;
				case STATE_MOTOR_DRYRUN_TRIP_SMS:
					CallingBecError = 1;
					break;
				case STATE_MOTOR_CYCLIC_TRIP_SMS:
					//CallingBecError = 1;
					break;
				case STATE_MOTOR_MAX_TRIP_SMS:
					//CallingBecError = 1;
					break;
				case STATE_MOTOR_RTCOF1_TRIP_SMS:
					//CallingBecError = 1;
					break;
				case STATE_MOTOR_RTCOF2_TRIP_SMS:
					//CallingBecError = 1;
					break;
				case STATE_MOTOR_RTCOF3_TRIP_SMS:
					//CallingBecError = 1;
					break;
				case STATE_MOTOR_TRIP_CURRENTSPP_SMS:
					CallingBecError = 1;
					break;
				case STATE_MOTOR_TRIP_SPP_SMS:
					CallingBecError = 1;
					break;
				case STATE_MOTOR_RTCOF4_TRIP_SMS:
					//CallingBecError = 1;
					break;
				case STATE_MOTOR_TRIP_LOWVOLTAGE_SMS:
					CallingBecError = 1;
					break;
				case STATE_MOTOR_TRIP_HIGHVOLTAGE_SMS:
					CallingBecError = 1;
					break;
				case STATE_MOTOR_TRIP_OVERLOAD_SMS:
					CallingBecError = 1;
					break;
				case STATE_MOTOR_TRIP_HIGHPRESS_SMS:
					CallingBecError = 1;
					break;
				case STATE_MOTOR_TRIP_LOWPRESS_SMS:
					CallingBecError = 1;
					break;
			   default :
				break;

