AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			}
		}
	}
	#endif
}
void Send_30min_Status_sms(void) {	
	#if 0
	 if(PowerIsThere == 1 && AllSmsSendDone == 1 && CallModeOn == 0 && nMSettings.staticSMSOnOff==1 )
		{
			checkpower=Check2Phase();
			if(checkpower == 2)
			{
				if (nTimerSettings.AutoStIIOnOff == 0 || Mobile2Phs3Phase == 3)
				{
					StatusSMSDelay1 = 0;
					SMS30MinStatus = 0;
				}
			}
			StatusSMSDelay1++;
			if(StatusSMSDelay1>=200)
			{
				StatusSMSDelay1 = 0;
				StatusSMSDelay2++;
				if(StatusSMSDelay2>=180)
				{
					SMS30MinStatus = 1;
					Debug("\n\rNow Sending 30 tm_min Status SMS\n\r");									 
					SMS30MinStatusNumber = 0;
					SMS30MinStatusDelay = 0;
					StatusSMSDelay2 = 0;
				}
			}
		}
		else
		{
			StatusSMSDelay1 = 0;
			StatusSMSDelay2 = 0;
			SMS30MinStatus = 0;
			SMS30MinStatusDelay = 0;
		}
		 
		if(SMS30MinStatus == 1)
		{
			if(SMS30MinStatusDelay++>=15)
			{
				SMS30MinStatusDelay = 0;
				  Debug("\n\r*******30 tm_min Status SMS SMS30MinStatusNumber = %d********\n\r",SMS30MinStatusNumber);
				  
				sprintf((char *)Status30MinPhNo,"0%s",SmsNumber[0]);
				//StopTimer(&timer);
				send_test_smsStatus(Status30MinPhNo);
				//timer.timeoutPeriod = 300;
				//timer.timerId = StartTimer(&timer);
				//SMS30MinStatusNumber++;
				//if(SMS30MinStatusNumber>=HowManyNumberFound)
				//{
				SMS30MinStatusNumber = 0;
				SMS30MinStatus = 0;
				Debug("\n\rNow 30 tm_min Status SMS Sendng Completed\n\r");								 
				//}
			}
		}
		if(StaticSMSSend == 1)
		{
			if(StaticSMSDelay++>=15)
			{
				StaticSMSDelay = 0;
				Debug("\n\r*******Static SMS SMS30MinStatusNumber = %d********\n\r",SMS30MinStatusNumber);
				if(strstr(SmsNumber[SMS30MinStatusNumber],"*") == 0)
				sprintf((char *)Status30MinPhNo,"0%s",SmsNumber[SMS30MinStatusNumber]);
				SendSMSStr(StaticSmsString,Status30MinPhNo);
				SMS30MinStatusNumber++;
				if(SMS30MinStatusNumber>=HowManyNumberFound)
				{
					SMS30MinStatusNumber = 0;
					SMS30MinStatus = 0;
					StaticSMSSend = 0;
					Debug("\n\rNow 30 tm_min Status SMS Sendng Completed\n\r");								
				}
			}
		}
		 
	#endif
}
void set_hourly_power_data(void){
	  if(datetime.tm_sec != OnehrPrvSec) 
		{												
		   OnehrPrvSec = datetime.tm_sec;
		   Onehr_sec_timer++;
	
			if((Onehr_sec_timer>=3600) && Enter > 70)
			{						 
				Onehr_sec_timer=0;						
				onehour_send_flag=1;
				//sgetflag_2=1;
				Debug("\n\r Entry to onehour_time =1 line %d ",__LINE__);
			}
		}
}
void checksmslimit(void){
	if(limitsmscount>limitsmsset && limitsmsonof==1)						 
		limitsmsflag=1;						 
	else
		limitsmsflag=0;
}
void DrRestartTimer(void){
		if(nTimerSettings.Drrestartpoweronof==1 && MakeRealyOn == 1 )
		{
			//sAPI_GetRealTimeClock(&datetime);
			if(nTimerSettings.DrReOnOf == 1)
			{
				if(datetime.tm_sec != ActStarDetaPrvSec)
				{
					nMoTr.ActDrRunRestart++;
					ActStarDetaPrvSec = datetime.tm_sec;
				}
				Debug("\n\rnnMoTr.ActDrRunRestart = %ld  nMoTr.DrRunRestart = %ld\n\r",nMoTr.ActDrRunRestart,nMoTr.DrRunRestart);
				 
				if(nMoTr.ActDrRunRestart>=nMoTr.DrRunRestart)
				{
					if(PowerCurrentCondition == 0)
						nSTATE_MOTOR = STATE_MOTOR_TRIP_RESTART;
					else
						nSTATE_STATUS_SMS =STATUS_NO_ELECTRICICY;
					
					Debug("\n\rReStart Time Completed\n\r");				
					nTimerSettings.Drrestartpoweronof=0;
					SendSmsToAll = 1;
				}
				else
				{
					if(PowerCurrentCondition == 0)
						nSTATE_STATUS_SMS =STATUS_MOTOR_DRYRUN_TRIP_SMS;
					else
						Debug("STATUS_NO_ELECTRICICY;");                 
						nSTATE_STATUS_SMS =STATUS_NO_ELECTRICICY;
						nSTATE_MOTOR_SMS = STATE_MOTOR_DRYRUN_TRIP_SMS;
						nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
				}
			}
		}
} 
uint8_t CheckAutoMobile(void){	 
	  uint8_t pinlevelab;
	
		pinlevelab =AUTOMOBILE_KEY;
		//Debug("\n\rAutoMobile Key:%d",pinlevelab);	 
		if(pinlevelab == 0)
		{
			return 0;
		}
		else
		{
			return 1;
		}		
		
}
// Calculate CRC8 checksum for a block of data
uint8_t crc8(const void *data, size_t size){
    uint8_t crc = CRC8_INIT;
    const uint8_t *ptr = (const uint8_t *)data;
    uint8_t j;size_t i;
	  //Debug("size:%d",size);
    for(i = 0; i < size; i++)
    {
			  //Debug("DATA:ox%X",ptr[i]);
        crc ^= ptr[i];
        for ( j = 0; j < 8; j++)
        {
            if (crc & 0x80)
                crc = (crc << 1) ^ CRC8_POLY;
            else
                crc <<= 1;
        }
    }

    return crc;
}
int CheckPH2PH3Selection(void){
	 
		uint8_t pinlevelab;
		 
		pinlevelab = PH3OR2SELECTION_KEY;
		//Debug("Phase selection Key:%d",pinlevelab);	
		if(pinlevelab == 1)
		{
			return 1;
		}
		else
		{
			return 0;
		}	
		
}
unsigned char CyclicTimeron(void){
	if(nMoTr.CycLicOnDelay>0)
	{
		if(datetime.tm_sec != ActCycLicOnDelayPrvSec)
		{
			nMoTr.ActCycLicOnDelay++;
			ActCycLicOnDelayPrvSec = datetime.tm_sec;
		}

	   Debug("\n\rnMoTr.ActCycLicOnDelay = %ld  nMoTr.CycLicOnDelay = %ld\n\r",nMoTr.ActCycLicOnDelay,nMoTr.CycLicOnDelay);
     	   RemainingCyclicOnTime = nMoTr.CycLicOnDelay-nMoTr.ActCycLicOnDelay;
		if(nMoTr.ActCycLicOnDelay>nMoTr.CycLicOnDelay)
		{
			Debug("\n\rCYCLIC ON Completed\n\r");
			return 1;
		}
	}
	else
	{
		//PrintfResp("\n\rNo CYCLIC ON DELAY\n\r");

	}
	return 0;

}
unsigned char CyclicTimerof(void){
	if(nMoTr.CycLicOfDelay>0)
	{
		if(datetime.tm_sec != ActCycLicOfDelayPrvSec)
		{
			nMoTr.ActCycLicOfDelay++;
			ActCycLicOfDelayPrvSec = datetime.tm_sec;
		}
		Debug("\n\rnMoTr.ActCycLicOfDelay = %ld  nMoTr.CycLicOfDelay = %ld\n\r",nMoTr.ActCycLicOfDelay,nMoTr.CycLicOfDelay);
		 
		RemainingCyclicOfTime = nMoTr.CycLicOfDelay-nMoTr.ActCycLicOfDelay;
		if(nMoTr.ActCycLicOfDelay>nMoTr.CycLicOfDelay)
		{
			nSTATE_STATUS_SMS =STATUS_MOTOR_ON_ONDELAY;
			nSTATE_MOTOR_ON_SMS=STATE_MOTOR_ON_ONDELAY;
			Debug("\n\rCYCLIC OFF Completed\n\r");
			return 1;
		}
	}
	return 0;

}
uint8_t CheckReversePhase(void){

	if(nTimerSettings.RvePhOnoff == 1)
    {
		if(ReversePhase == 1)
		{
			Debug("\n\rReverse Phasee off\n\r");
			return 1;
		}
		else
			return 0;
	}
	else
		return 0;


