AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
}
uint8_t CheckMotor(void){	
	#if 1
	   NoAcceptSMS=0;
		if(CheckStrterTrip() == 1)
		{
			nSTATE_MOTOR_PROBLEM=STATE_MOTOR_STARTER;
		}
		else if(CheckCurrentSpp() == 1 && WorkingOn3Phas == 1)
		{
			nSTATE_MOTOR_PROBLEM=STATE_MOTOR_CSPP;
		}
		else if(CheckSpp() == 1 && WorkingOn3Phas == 1)
		{
			nSTATE_MOTOR_PROBLEM=STATE_MOTOR_SPP;
		}
		else if(CheckLowerTank() == 1)
		{
			if(nMSettings.SumpOnOff == 1)
				nSTATE_MOTOR_PROBLEM=STATE_MOTOR_LOWERTANK;
			else
				nSTATE_MOTOR_PROBLEM=STATE_MOTOR_OK;
		}
		else if(CheckNoLoad(WorkingOn3Phas) >= 1)
		{
			nSTATE_MOTOR_PROBLEM=STATE_MOTOR_NOLOAD;
		}
		else if(CheckOvLoad(WorkingOn3Phas) >= 1)
		{
			nSTATE_MOTOR_PROBLEM=STATE_MOTOR_OVERLOAD;
		}
		else if(CheckLowVoltage(WorkingOn3Phas) >= 1)
		{
			nSTATE_MOTOR_PROBLEM=STATE_MOTOR_LOWVOLTAGE;
		}
		else if(CheckHighVoltage(WorkingOn3Phas) >= 1)
		{
			nSTATE_MOTOR_PROBLEM=STATE_MOTOR_HIGHVOLTAGE;
		}
		else if(CheckUpperTank() == 1)
		{
			nSTATE_MOTOR_PROBLEM=STATE_MOTOR_UPPERTANK;			 
		}		 
		else
			nSTATE_MOTOR_PROBLEM=STATE_MOTOR_OK;
		
		
		#endif
		return 0;

}  
void FloatroString1Dig(char* String,float Number){
	int i,j;
	unsigned char c;
	//float Itp;
  	c = 0; 
	if(Number < 0)
	{
	  c = 1;
	  Number = -Number;
	}
	i = (int)Number; 
	Number = Number-(float)i;
	j = (int)((Number * 10.0f));//+0.5); 
	if(c == 0)
		sprintf(String,"%02d.%01d",i,j);
	else
		sprintf(String,"-%02d.%01d",i,j);
	
		//Debug("String %s",String);
		
}
uint8_t CheckSpp(void){
		int MaxVoltage,MinVoltage;
		//float PerDifference;
		int Tp,Tp1,Tp2,Tp3;

    if(nTimerSettings.SppOnoff == 1)
    {
				MaxVoltage = nCurretnCond.RVoltage;
				if(nCurretnCond.YVoltage>MaxVoltage)
				MaxVoltage = nCurretnCond.YVoltage;
				if(nCurretnCond.BVoltage>MaxVoltage)
				MaxVoltage = nCurretnCond.BVoltage;

				MinVoltage = nCurretnCond.RVoltage;
				if(MinVoltage>nCurretnCond.YVoltage)
				MinVoltage = nCurretnCond.YVoltage;
				if(MinVoltage>nCurretnCond.BVoltage)
				MinVoltage = nCurretnCond.BVoltage;

				Tp=nTimerSettings.ImbVolt;
				Tp=Tp/2.4;
				Tp=Tp*MaxVoltage;
				Tp=Tp*0.01;

				if(Tp<=nTimerSettings.ImbVolt)
				Tp1=Tp;
				else
				Tp1=nTimerSettings.ImbVolt;
				Tp2 = MaxVoltage-Tp1;
				Tp3=nTimerSettings.ImbVolt;
				Tp3=Tp3*0.2;
				Tp3=Tp2+Tp3;
				if(MinVoltage<Tp2&& PrvSppTrip == 0)
				{
					VSPPImbalanceVoltage = MaxVoltage-MinVoltage;
					VoltageSppRecheckCounter++;
					Debug("\n\rVoltage Spp Trip=%d\n\r",VoltageSppRecheckCounter);				
					if(VoltageSppRecheckCounter>=10)
					{
						//PrintfResp("\n\rVoltage Spp Trip\n\r");
						VoltageSppRecheckCounter = 0;
						PrvSppTrip =1;
						return 1;
					}
					else
					return 0;
				}
				else if(MinVoltage>Tp3 && PrvSppTrip == 1)
				{

					VSPPImbalanceVoltage = MaxVoltage-MinVoltage;
					Debug("\n\rVoltage Spp Trip=%d\n\r",VoltageSppRecheckCounter);					
					VoltageSppRecheckCounter++;
					if(VoltageSppRecheckCounter>=30)
					{
						//sprintf(buf,"\n\rVoltage Spp Trip=%d\n\r",VoltageSppRecheckCounter);
						// PrintfResp(buf);
						VoltageSppRecheckCounter = 0;
						PrvSppTrip = 0;
						return 0;
					}
					else
					return 1;
				}
				else if(PrvSppTrip == 1)
				{
					VoltageSppRecheckCounter = 0;
					return 1;
				}
				else
				VoltageSppRecheckCounter = 0;
    }

    return 0;
}
uint8_t CheckSppHys(void){

	int MaxVoltage,MinVoltage;
	//float PerDifference;
    int Tp,Tp1,Tp2,Tp3;

    if(nTimerSettings.SppOnoff == 1)
    {
						MaxVoltage = nCurretnCond.RVoltage;
						if(nCurretnCond.YVoltage>MaxVoltage)
						MaxVoltage = nCurretnCond.YVoltage;
						if(nCurretnCond.BVoltage>MaxVoltage)
						MaxVoltage = nCurretnCond.BVoltage;

						MinVoltage = nCurretnCond.RVoltage;
						if(MinVoltage>nCurretnCond.YVoltage)
						MinVoltage = nCurretnCond.YVoltage;
						if(MinVoltage>nCurretnCond.BVoltage)
						MinVoltage = nCurretnCond.BVoltage;

						Tp=nTimerSettings.ImbVolt;
						Tp=Tp/2.4;
						Tp=Tp*MaxVoltage;
						Tp=Tp*0.01;

						if(Tp<=nTimerSettings.ImbVolt)
						Tp1=Tp;
						else
						Tp1=nTimerSettings.ImbVolt;
						Tp2 = MaxVoltage-Tp1;
						Tp3=nTimerSettings.ImbVolt;
						Tp3=Tp3*0.2;
						Tp3=Tp2+Tp3;
						if(MinVoltage<Tp2&& PrvSppTrip == 0)
						{
								VSPPImbalanceVoltage = MaxVoltage-MinVoltage;
								VoltageSppRecheckCounter++;
								Debug("\n\rVoltage Spp Trip=%d\n\r",VoltageSppRecheckCounter);			
								if(VoltageSppRecheckCounter>0)
								{
									//PrintfResp("\n\rVoltage Spp Trip\n\r");
									VoltageSppRecheckCounter = 0;
									PrvSppTrip =1;
									return 1;
								}
								else
								return 0;
						}
						else if(MinVoltage>Tp3 && PrvSppTrip == 1)
						{

								VSPPImbalanceVoltage = MaxVoltage-MinVoltage;
								Debug("\n\rVoltage Spp Trip=%d\n\r",VoltageSppRecheckCounter);			
								VoltageSppRecheckCounter++;
								if(VoltageSppRecheckCounter>=30)
								{
									//sprintf(buf,"\n\rVoltage Spp Trip=%d\n\r",VoltageSppRecheckCounter);
									// PrintfResp(buf);
									VoltageSppRecheckCounter = 0;
									PrvSppTrip = 0;
									return 0;
								}
								else
								return 1;
						}
						else if(PrvSppTrip == 1)
						{
							VoltageSppRecheckCounter = 0;
							return 1;
						}
						else
							VoltageSppRecheckCounter = 0;
						}
						return 0;
}
unsigned char CheckNoLoad(unsigned char Ph2Ph3){
	float PerCheck;
    //float perlowct;

	if(Ph2Ph3 == 1)
		PerCheck = nTimerSettings.DrAmpsIII;
	else
		PerCheck = nTimerSettings.DrAmpsII;

    if(nMSettings.DryRunOnOff == 1 && PerCheck >0.0f)
    {
        if(nCurretnCond.Rcurrent<PerCheck && nCurretnCond.Rcurrent>2 && nTimerSettings.CTRonoff == 1)
		{
			WhichPhaseHaveingProblem = 1;
			TripCurrent = nCurretnCond.Rcurrent;
			TripVoltage = nCurretnCond.RYVoltage;
            return 1;
		}
        else if(nCurretnCond.Ycurrent<PerCheck && nCurretnCond.Ycurrent>2 && nTimerSettings.CTYonoff == 1 && Ph2Ph3 == 1)
		{
			WhichPhaseHaveingProblem = 2;
			TripCurrent = nCurretnCond.Ycurrent;
			TripVoltage = nCurretnCond.YBVoltage;
            return 2;
		}
        else if(nCurretnCond.Bcurrent<PerCheck && nCurretnCond.Bcurrent>2 && nTimerSettings.CTBonoff == 1)
		{
			WhichPhaseHaveingProblem = 3;
			TripCurrent = nCurretnCond.Bcurrent;
			TripVoltage = nCurretnCond.BRVoltage;
            return 3;
		}
        return 0;
    }

