AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
    return 0;
}
uint8_t CheckOvLoad(unsigned char Ph2Ph3){
	 float PerCheck;
   // float perlowct;

		if(Ph2Ph3 == 1)
			PerCheck = nTimerSettings.OlAmpsIII;
		else
			PerCheck = nTimerSettings.OlAmpsII;

    if(nTimerSettings.OlOnOff == 1 && PerCheck>0.0f)
    {
        if(nCurretnCond.Rcurrent>PerCheck && nTimerSettings.CTRonoff == 1)
				{
					WhichPhaseHaveingProblem = 1;
					TripCurrent = nCurretnCond.Rcurrent;
					TripVoltage = nCurretnCond.RYVoltage;
								return 1;
				}
        else if(nCurretnCond.Ycurrent>PerCheck && nTimerSettings.CTYonoff == 1 && Ph2Ph3 == 1)
				{
					WhichPhaseHaveingProblem = 2;
					TripCurrent = nCurretnCond.Ycurrent;
					TripVoltage = nCurretnCond.YBVoltage;
								return 2;
				}
        else if(nCurretnCond.Bcurrent>PerCheck && nTimerSettings.CTBonoff == 1)
				{
					WhichPhaseHaveingProblem = 3;
					TripCurrent = nCurretnCond.Bcurrent;
					TripVoltage = nCurretnCond.BRVoltage;
								return 3;
				}
    }

    return 0;
}
uint8_t CheckLowVoltage(unsigned char Ph2Ph3){
	float PerCheck;
   // float perlowct;

	if(Ph2Ph3 == 1)
		PerCheck = nTimerSettings.LowVoltIII-nTimerSettings.DiffVoltIII;
	else
		PerCheck = nTimerSettings.LowVoltII-nTimerSettings.DiffVoltII;

	if(Ph2Ph3 == 1)
	{
		if(nTimerSettings.LowVoltIII == 0 || nTimerSettings.DiffVoltIII == 0)
		{
			LowVoltageRecheck = 0;
			return 0;
		}

	}
	else
	{
		if(nTimerSettings.LowVoltII == 0 || nTimerSettings.DiffVoltII == 0)
		{
			LowVoltageRecheck = 0;
			return 0;
		}
	}

	if(nTimerSettings.LowVoltOnOff == 1)
    {
        if(nCurretnCond.RYVoltage<PerCheck && Ph2Ph3 == 1)
		{
			WhichPhaseHaveingProblem = 1;
			TripVoltage = nCurretnCond.RYVoltage;
			LowVoltageRecheck++;
			if(LowVoltageRecheck>=60)
            {
				LowVoltageRecheck = 61;
				return 1;
			}
			else
				return 0;
		}
        else if(nCurretnCond.YBVoltage<PerCheck && Ph2Ph3 == 1)
		{
			WhichPhaseHaveingProblem = 2;
			TripVoltage = nCurretnCond.YBVoltage;
			LowVoltageRecheck++;
			if(LowVoltageRecheck>=60)
            {
				LowVoltageRecheck = 61;
				return 2;
			}
			else
				return 0;
		}
        else if(nCurretnCond.BRVoltage<PerCheck)
		{
			WhichPhaseHaveingProblem = 3;
			TripVoltage = nCurretnCond.BRVoltage;
			LowVoltageRecheck++;
			if(LowVoltageRecheck>=60)
            {
				LowVoltageRecheck = 61;
				return 3;
			}
			else
				return 0;
		}

		LowVoltageRecheck = 0;
        return 0;

    }
	LowVoltageRecheck = 0;
    return 0;

}


uint8_t CheckLowVoltageHys(unsigned char Ph2Ph3){
		float PerCheck;
		//float perlowct;
		if(Ph2Ph3 == 1)
			PerCheck = nTimerSettings.LowVoltIII;
		else
			PerCheck = nTimerSettings.LowVoltII;

		if(Ph2Ph3 == 1)
		{
			if(nTimerSettings.LowVoltIII == 0 || nTimerSettings.DiffVoltIII == 0)
				return 0;

		}
		else
		{
			if(nTimerSettings.LowVoltII == 0 || nTimerSettings.DiffVoltII == 0)
				return 0;
		}

		if(nTimerSettings.LowVoltOnOff == 1)
    {
        if(nCurretnCond.RYVoltage<PerCheck && Ph2Ph3 == 1)
				{
					WhichPhaseHaveingProblem = 1;
					TripVoltage = nCurretnCond.RYVoltage;
					return 1;
				}
        else if(nCurretnCond.YBVoltage<PerCheck && Ph2Ph3 == 1)
				{
					WhichPhaseHaveingProblem = 2;
					TripVoltage = nCurretnCond.YBVoltage;
					return 2;
				}
        else if(nCurretnCond.BRVoltage<PerCheck)
				{
					WhichPhaseHaveingProblem = 3;
					TripVoltage = nCurretnCond.BRVoltage;
					return 3;
				}
        return 0;
    }

    return 0;

}
uint8_t CheckHighVoltage(unsigned char Ph2Ph3){
	  float PerCheck;
    //float perlowct;

	 if(Ph2Ph3 == 1)
		PerCheck = nTimerSettings.HighVoltIII;
	 else
		PerCheck = nTimerSettings.HighVoltII;


		if(Ph2Ph3 == 1)
		{
			if(nTimerSettings.HighVoltIII == 0 || nTimerSettings.HiDiffVoltIII == 0)
			{
				HighVoltageRecheck =0;
				return 0;
			}

		}
		else
		{
			if(nTimerSettings.HighVoltII == 0 || nTimerSettings.HiDiffVoltII == 0)
			{
				 HighVoltageRecheck =0;
				return 0;
				}
		}




		if(nTimerSettings.HighVoltOnOff == 1)
			{
					if(nCurretnCond.RYVoltage>PerCheck && Ph2Ph3 == 1)
			{
				WhichPhaseHaveingProblem = 1;
				TripVoltage = nCurretnCond.RYVoltage;
				HighVoltageRecheck++;
				if(HighVoltageRecheck>=60)
							{
					HighVoltageRecheck = 61;
					return 1;
					}

				else
					return 0;
			}
					else if(nCurretnCond.YBVoltage>PerCheck && Ph2Ph3 == 1)
			{
				WhichPhaseHaveingProblem = 2;
				TripVoltage = nCurretnCond.YBVoltage;
				HighVoltageRecheck++;
				if(HighVoltageRecheck>=60)
							{
					HighVoltageRecheck = 61;
					return 2;
				}
				else
					return 0;
			}
					else if(nCurretnCond.BRVoltage>PerCheck)
			{
				WhichPhaseHaveingProblem = 3;
				TripVoltage = nCurretnCond.BRVoltage;
				HighVoltageRecheck++;
				if(HighVoltageRecheck>=60)
							{
					HighVoltageRecheck = 61;
					return 3;
				}
				else
					return 0;
			}
			//sprintf(buf,"\n\rnCurretnCond.RYVoltage=%03.0f   %03.0f    %03.0f  PerCheck = %d\n\r",nCurretnCond.RYVoltage,nCurretnCond.YBVoltage,nCurretnCond.BRVoltage,PerCheck);
			// PrintfResp(buf);
			HighVoltageRecheck = 0;
					return 0;
			}
		HighVoltageRecheck = 0;
		return 0;
}
uint8_t CheckHighVoltageHys(unsigned char Ph2Ph3){
			float PerCheck;
			//float perlowct;

			if(Ph2Ph3 == 1)
				PerCheck = nTimerSettings.HighVoltIII-nTimerSettings.HiDiffVoltIII;
			else
				PerCheck = nTimerSettings.HighVoltII-nTimerSettings.HiDiffVoltII;

			if(Ph2Ph3 == 1)
			{
				if(nTimerSettings.HighVoltIII == 0 || nTimerSettings.HiDiffVoltIII == 0)
					return 0;
			}
			else
			{
				if(nTimerSettings.HighVoltII == 0 || nTimerSettings.HiDiffVoltII == 0)
					return 0;
			}


			Debug("\n\rPerCheck = %f\n\r",PerCheck);	
			if(nTimerSettings.HighVoltOnOff == 1)
			{
					if(nCurretnCond.RYVoltage>PerCheck && Ph2Ph3 == 1)
			{
				WhichPhaseHaveingProblem = 1;
				TripVoltage = nCurretnCond.RYVoltage;
							return 1;
			}
					else if(nCurretnCond.YBVoltage>PerCheck && Ph2Ph3 == 1)
			{
				WhichPhaseHaveingProblem = 2;
				TripVoltage = nCurretnCond.YBVoltage;
							return 2;
			}
					else if(nCurretnCond.BRVoltage>PerCheck)
			{
				WhichPhaseHaveingProblem = 3;
				TripVoltage = nCurretnCond.BRVoltage;
							return 3;
			}
			Debug("\n\rnCurretnCond.RYVoltage=%03.0f   %03.0f    %03.0f  PerCheck = %f\n\r",nCurretnCond.RYVoltage,nCurretnCond.YBVoltage,nCurretnCond.BRVoltage,PerCheck);
					
