AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			return 0;

			}

    return 0;

}
uint8_t Check2Phase(void){
	if(nCurretnCond.YVoltage>=110)
	{
		Debug("\n\rWorking on 3 phase\n\r");
		return 3;
	}
	else if(nCurretnCond.YVoltage<=109)
	{
		Debug("\n\rWorking on 2 phase\n\r");
		return 2;
	}
	return 0;
}
uint8_t CheckManualSwitch(void){
 #if 0
	uint8_t pinlevelab;
	uint8_t pinlevelabc;
	if(nMSettings.ManualswitchOnOff == 1)
	{
		//pinlevelab = sAPI_GpioGetValue(UPTANK_PIN2);
		//pinlevelabc = sAPI_GpioGetValue(UPTANK_PIN2);
		if(pinlevelab == 0 && pinlevelabc == 0)
		{
				RecheckCounterMT=0; //RecheckCounterMT_1++;
		   //	if(RecheckCounterMT_1>=20)
	     //		{
		   //RecheckCounterMT_1 = 0;
			PrvMSMotorStatus = 0;
			return 0;
	     //		}
		} 
		else if(pinlevelab == 1 && pinlevelabc == 1)
		{
			RecheckCounterMT++;
			if(RecheckCounterMT>=20)
			{
				RecheckCounterMT = 21;
				if(PrvMSMotorStatus==0)
				Send_manualswitch(SmsNumber[0]);
				PrvMSMotorStatus = 1;
				return 1;
			}
			else
			{
				PrvMSMotorStatus = 0;
		    //RecheckCounterMT_1=0;
				return 0;
			}
		}
		else
		{
	   //RecheckCounterMT=0;
		 return PrvMSMotorStatus;
		}

	}
	RecheckCounterMT = 0;

	#endif
		return 0;
}
uint8_t CheckUpperTank(void){
	 
	uint8_t pinlevelab;
	uint8_t pinlevelabc;	 
	 
	if(nMSettings.TankOnOff== 1)
	{		 
				//pinlevelab = UPTANK_PIN1;
				//pinlevelabc = UPTANK_PIN2;   //UPTANK_PIN1
				if(nMSettings.ndebugonof==1)		 
					Debug("\n\r UPTANK_PIN1 is %d UPTANK_PIN2 is %d",pinlevelab,pinlevelabc);
				 
				 
				if(pinlevelab == 0 && pinlevelabc == 0)
				{
					RecheckCounterUT = 0;
					PrvUpMotorStatus = 0;
					return PrvUpMotorStatus;
				}
				else if(pinlevelab == 1 && pinlevelabc == 1)
				{
					RecheckCounterUT++;	 
					if(RecheckCounterUT>=5)  
					{
						RecheckCounterUT = 21;		 
						PrvUpMotorStatus = 1;
						return 1;
					}
					else
					{
						PrvUpMotorStatus = 0;
						return 0;
					}
				}
				else

		 return PrvUpMotorStatus;

	}
	RecheckCounterUT = 0;
	return 0;
}
uint8_t CheckLowerTank(void){
	//INT32 iret;
	uint8_t pinlevelab;
	uint8_t pinlevelabc;
	if(nMSettings.SumpOnOff == 1)
	{
		pinlevelab = LOTANK_PIN1;
		pinlevelabc = LOTANK_PIN2;
		PrvLocanMotorStatus=0;
		//pinlevelab = sumplevel;
		//pinlevelabc = sumplevel;
		if(nMSettings.ndebugonof==1)	 
		 Debug("\n\r LOTANK_PIN1 is %d LOTANK_PIN2 is %d",pinlevelab,pinlevelabc);		
		 
		if(pinlevelab == 0 && pinlevelabc == 0)
		{

			if(PrvLoMotorStatus==1)
			{
				RecheckCounterLT++;
				if(RecheckCounterLT>25)
				{
					RecheckCounterLT=0;
					PrvLoMotorStatus = 0;
			        return 0;
				}
			}
			else
			{
			RecheckCounterLT = 0;
			PrvLoMotorStatus = 0;
			return 0;
			}

		}
		else if(pinlevelab == 1 && pinlevelabc == 1)
		{
			RecheckCounterLT++;
			if(RecheckCounterLT>=20)
			{
				RecheckCounterLT = 21;
				PrvLoMotorStatus = 1;
				return 1;
			}
			else
			{
				PrvLoMotorStatus = 0;
				return 0;
			}
		}
		else
			if(PrvLoMotorStatus==1)
			{
				RecheckCounterLT=21;
			}
			//***********//
		//	else
		//		RecheckCounterLT=0;   //dg_added for checking   only for agritel sir site.
			//***********//

			return PrvLoMotorStatus;
	}
  /*	else if(nMSettings.TankOnOff == 1)
		{
		//pinlevelab = sAPI_GpioGetValue(LOTANK_PIN1);
		//pinlevelabc = sAPI_GpioGetValue(LOTANK_PIN2);
		pinlevelab = sumplevel;
		pinlevelabc = sumplevel;
		PrvLoMotorStatus=0;
		if(pinlevelab == 0 && pinlevelabc == 0)
		{
			RecheckCounterLT = 0;
			PrvLocanMotorStatus = 0;
			return 0;
		}
		else if(pinlevelab == 1 && pinlevelabc == 1)
		{
			RecheckCounterLT++;
			if(RecheckCounterLT>=20)
			{
				RecheckCounterLT = 21;
				if(PrvLocanMotorStatus==0)
				Send_tankempty(SmsNumber[0]);

				PrvLocanMotorStatus = 1;
				return 1;
			}
			else
			{
				PrvLocanMotorStatus = 0;
				return 0;
			}
		}
		else
			return PrvLocanMotorStatus;
	} */
	RecheckCounterLT = 0;
	return 0;
}
uint8_t CheckCurrentSpp(void){

	//float perlowct;
	float per,per1;

	if(nTimerSettings.CTRonoff == 0 || nTimerSettings.CTYonoff == 0 || nTimerSettings.CTBonoff == 0)
	{
		CurrentSppRecheckCounter = 0;
		return 0;
	}

	if(nTimerSettings.CurSppOnOff == 1)
    {
			if(nCurretnCond.Rcurrent<2 && nCurretnCond.Ycurrent<2 && nCurretnCond.Bcurrent<2)
			{
				CurrentSppRecheckCounter = 0;		
				return 0;			 
			}

			per = (nCurretnCond.Rcurrent/nCurretnCond.Ycurrent)*100;
			per1 = (nCurretnCond.Ycurrent/nCurretnCond.Bcurrent)*100;
			//Debug("\n\r***CurrentSppRecheckCounter = %d\n\r*****",CurrentSppRecheckCounter);		 
			if(nCurretnCond.Rcurrent<2)
			{
				CSPPValue = 1;
				CurrentSppRecheckCounter++;
				if(CurrentSppRecheckCounter>=50)
				{
					Debug("\n\rCurrent SPP Trip\n\r");
					return 1;
				}
			}
					else if(nCurretnCond.Ycurrent<2)
			{
				CSPPValue = 2;
				CurrentSppRecheckCounter++;
				if(CurrentSppRecheckCounter>=50)
				{
					Debug("\n\rCurrent SPP Trip\n\r");
					return 1;
				}
			}
					else if(nCurretnCond.Bcurrent<2)
			{
				CSPPValue = 3;
				CurrentSppRecheckCounter++;
				if(CurrentSppRecheckCounter>=50)
				{
					Debug("\n\rCurrent SPP Trip\n\r");
					return 1;
				}
			}
			else if(per>200 || per<50)
			{
				CSPPValue = 4;
				CurrentSppRecheckCounter++;
				if(CurrentSppRecheckCounter>=50)
				{
					Debug("\n\rCurrent SPP Trip\n\r");
					return 1;
				}
			}
			else if(per1>200 || per1<50)
			{
				CSPPValue = 5;
				CurrentSppRecheckCounter++;
				if(CurrentSppRecheckCounter>=50)
				{
					Debug("\n\rCurrent SPP Trip\n\r");
					return 1;
				}
			}
			else
				CurrentSppRecheckCounter = 0;
		}


    return 0;
}
uint8_t CheckStrterTrip(void){
		if(nMSettings.SfbOnOff == 1)
		{
				if(nCurretnCond.Rcurrent<2 && nCurretnCond.Ycurrent<2 && nCurretnCond.Bcurrent<2)
				{
				        if(datetime.tm_sec != ActSfbPrvSec)
								{
									nMoTr.ActSfbDelay++;
									ActSfbPrvSec = datetime.tm_sec;
								}
					//RecheckCounterST++;
					if(nMoTr.ActSfbDelay>=nMoTr.SfbDelay)
						return 1;
				}
				else
				{
					if(MotorStarterTripCount!=0)
					MotorStarterTripCount = 0;
					nMoTr.ActSfbDelay=0;
					RecheckCounterST = 0;
				}
		}
		else
		{ 				 
				if(MotorStarterTripCount!=0)
				MotorStarterTripCount = 0;
				RecheckCounterST = 0;
				nMoTr.ActSfbDelay=0;
		}
		return 0;
}
void UpdateVoicePowerCondition(unsigned char PowerCondition){
	VoicePowerCondition = PowerCondition;
}
int FindNearsetElement(long *Pointer,int len){
	int Tp;
	int Small,NextSmall;

	Small=NextSmall = 0;
	for(Tp=1;Tp<len;Tp++)
	{
		if(Pointer[Small] != 0)
		{
			if(Pointer[Small]>Pointer[Tp] && Pointer[Tp]!=0)
				Small = Tp;
			NextSmall = 1;
		}
		else
		{
			NextSmall++;
			Small++;
		}
	}
	if(Small == NextSmall)
		return -1;
	
	return Small;
}
uint8_t WhoIsNext(unsigned char FromWhere){

