AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			//long on1,on2,on3;
			//long Difference1;
			long RTCValues[5];

			if(FromWhere == 1)
			{
				RTCValues[0] = nMoTr.RTCON[2];
				RTCValues[1] = nMoTr.RTCON[3];
				RTCValues[2] = nMoTr.RTCON[4];
				return (FindNearsetElement(RTCValues,3)+1);
			}
			else if(FromWhere == 2)
			{
				RTCValues[0] = nMoTr.RTCON[1];
				RTCValues[1] = nMoTr.RTCON[3];
				RTCValues[2] = nMoTr.RTCON[4];
				return (FindNearsetElement(RTCValues,3)+1);
			}
			else if(FromWhere == 3)
			{
				RTCValues[0] = nMoTr.RTCON[1];
				RTCValues[1] = nMoTr.RTCON[2];
				RTCValues[2] = nMoTr.RTCON[4];
				return (FindNearsetElement(RTCValues,3)+1);
			}
			else if(FromWhere == 4)
			{
				RTCValues[0] = nMoTr.RTCON[1];
				RTCValues[1] = nMoTr.RTCON[2];
				RTCValues[2] = nMoTr.RTCON[3];
				return (FindNearsetElement(RTCValues,3)+1);
			}
			
				return 0;
}





uint8_t CheckRTC(void){
	#if 0
	//CLK_SysTickDelay(1);      //delay of 1 ns
	int8_t ret,i;
	long CurrentSec;
	
	if(RTCCheckFirstTime == 0)
	{
						RTCCheckFirstTime = 1;
						//ReadTimerSettings();
						if(nTimerSettings.RTCOnOf == 1)
						{
							
							for(i=1;i<5;i++)
							{
								nMoTr.RTCON[i] = (nTimerSettings.RTCOnHr[i]*3600)+(nTimerSettings.RTCOnMin[i]*60)+nTimerSettings.RTCOnSec[i];
								nMoTr.RTCOf[i] = (nTimerSettings.RTCOfHr[i]*3600)+(nTimerSettings.RTCOfMin[i]*60)+nTimerSettings.RTCOfSec[i];
							}

							for(i=1;i<5;i++)
							{
								if(nMoTr.RTCON[i]>86400)
								nMoTr.RTCON[i] = 86400;
								if(nMoTr.RTCOf[i]>86400)
								nMoTr.RTCOf[i] = 86400;
							}
							for(i=1;i<5;i++)
							{
								if(nMoTr.RTCON[i]>=nMoTr.RTCOf[i])
								{
									nMoTr.RTCON[i] = 0;
									nMoTr.RTCOf[i] = 0;
								}
							}
						}
						else
						{			 
								for(i=1;i<5;i++)
								{
									nMoTr.RTCON[i] = 0;
									nMoTr.RTCOf[i] = 0;
								}		
						}
						FirstTimerinProgram1 = 0;
						FirstTimerinProgram2 = 0;
						FirstTimerinProgram3 = 0;
						FirstTimerinProgram4 = 0;

	}
	else
	{	 
			//aj sAPI_GetRealTimeClock(&datetime);
			//aj CurrentSec = (datetime.tm_hour*3600)+(datetime.tm_min*60)+datetime.tm_sec;
			//aj if(PrvDate !=datetime.tm_mday)
			{
						NoElePowerOfTimer = 0;
						//nMoTr.ActMaxRunTimer = 0;
						LastDayRunTimer = RunTimer;
						LastDayRunflow = Runflow;
						nMoTr.Actl2powerRunTimer = nMoTr.Act2powerRunTimer;
						nMoTr.Actl3powerRunTimer = nMoTr.Act3powerRunTimer;
						nMoTr.ActlnopowerRunTimer = nMoTr.ActnopowerRunTimer;
						nMoTr.Act2powerRunTimer=0;
						nMoTr.Act3powerRunTimer=0;
						nMoTr.ActnopowerRunTimer=0;
						limitsmsflag=0;
						limitsmscount=0;
						RunTimer = 0;
						Runflow = 0;
						//aj PrvDate= datetime.tm_mday;			
						//ServiceNumberFound  = 0;
			}	
				
			
			//Debug("\n\r------RTC nMoTr.RTCOf1 = %ld  nMoTr.RTCON1 = %ld  CurrentSec=%ld \n\r",nMoTr.RTCOf[1],nMoTr.RTCON[1],CurrentSec);
			 
			if(CurrentSec<nMoTr.RTCOf[1] && CurrentSec>nMoTr.RTCON[1] && nMoTr.RTCON[1] !=0 && nMoTr.RTCOf[1]!=0)
			{
						if(FirstTimerinProgram1 == 0)
						{
							OffMotorByPhone = 0;
							FirstTimerinProgram2 = 0;
							FirstTimerinProgram3 = 0;
							FirstTimerinProgram4 = 0;

							FirstTimerinProgram1 = 1;
						}
						//Debug("**** OffMotorByPhone = %d ****** ",OffMotorByPhone);		
						
						if(OffMotorByPhone == 0)
						{

							nSTATE_STATUS_SMS = STATUS_MOTOR_ON_RTC1;
							nSTATE_MOTOR_ON_SMS=STATE_MOTOR_ON_RTC1;
							nRTC_CURRENT_STATUS = RTC1_TIMER_ON;
							RemainingRTC1Time = nMoTr.RTCOf[1]-CurrentSec;
							return 1;
						}
						else
							return 0;
			}
			else
			{
						if(FirstTimerinProgram1 == 1)
						{
							nSTATE_STATUS_SMS = STATUS_MOTOR_RTCOF1_TRIP_SMS;
							SendSmsToAll = 1;
							nSTATE_MOTOR_SMS = STATE_MOTOR_RTCOF1_TRIP_SMS;
							nSTATE_MOTOR = STATE_MOTOR_TRIP_RTCOF1;
							WHRTCPRWillNext = WhoIsNext(1);
						}
						FirstTimerinProgram1 = 0;
			}

			if(CurrentSec<nMoTr.RTCOf[2] && CurrentSec>nMoTr.RTCON[2] && nMoTr.RTCON[2] !=0 && nMoTr.RTCOf[2]!=0)
			{
						if(FirstTimerinProgram2 == 0)
						{
							OffMotorByPhone = 0;
							FirstTimerinProgram1 = 0;
							FirstTimerinProgram3 = 0;
							FirstTimerinProgram4 = 0;

							FirstTimerinProgram2 = 1;
						}
						if(OffMotorByPhone == 0)
						{
							nSTATE_STATUS_SMS = STATUS_MOTOR_ON_RTC2;
							nSTATE_MOTOR_ON_SMS=STATE_MOTOR_ON_RTC2;
							nRTC_CURRENT_STATUS = RTC2_TIMER_ON;
							RemainingRTC2Time = nMoTr.RTCOf[2]-CurrentSec;
							return 1;
						}
						else
							return 0;

			}
			else
			{
						if(FirstTimerinProgram2 == 1)
						{
							nSTATE_STATUS_SMS = STATUS_MOTOR_RTCOF2_TRIP_SMS;
							SendSmsToAll = 1;
							nSTATE_MOTOR_SMS = STATE_MOTOR_RTCOF2_TRIP_SMS;
							nSTATE_MOTOR = STATE_MOTOR_TRIP_RTCOF2;
							WHRTCPRWillNext = WhoIsNext(2);
						}
						FirstTimerinProgram2 = 0;
			}

			if(CurrentSec<nMoTr.RTCOf[3] && CurrentSec>nMoTr.RTCON[3] && nMoTr.RTCON[3] !=0 && nMoTr.RTCOf[3]!=0)
			{
						if(FirstTimerinProgram3 == 0)
						{
							OffMotorByPhone = 0;
							FirstTimerinProgram1 = 0;
							FirstTimerinProgram2 = 0;
							FirstTimerinProgram4 = 0;

							FirstTimerinProgram3 = 1;
						}
						if(OffMotorByPhone == 0)
						{
							nSTATE_STATUS_SMS = STATUS_MOTOR_ON_RTC3;
							nSTATE_MOTOR_ON_SMS=STATE_MOTOR_ON_RTC3;
							nRTC_CURRENT_STATUS = RTC3_TIMER_ON;
							RemainingRTC3Time = nMoTr.RTCOf[3]-CurrentSec;
							return 1;
						}
						else
							return 0;
			}
			else
			{
						if(FirstTimerinProgram3 == 1)
						{
							nSTATE_STATUS_SMS = STATUS_MOTOR_RTCOF3_TRIP_SMS;
							SendSmsToAll = 1;
							nSTATE_MOTOR_SMS = STATE_MOTOR_RTCOF3_TRIP_SMS;
							nSTATE_MOTOR = STATE_MOTOR_TRIP_RTCOF3;
							WHRTCPRWillNext = WhoIsNext(3);
						}
						FirstTimerinProgram3 = 0;
			}

			if(CurrentSec<nMoTr.RTCOf[4] && CurrentSec>nMoTr.RTCON[4] && nMoTr.RTCON[4] !=0 && nMoTr.RTCOf[4]!=0)
			{
						if(FirstTimerinProgram4 == 0)
						{
							OffMotorByPhone = 0;
							FirstTimerinProgram1 = 0;
							FirstTimerinProgram2 = 0;
							FirstTimerinProgram3 = 0;

							FirstTimerinProgram4 = 1;
						}
						if(OffMotorByPhone == 0)
						{
							nSTATE_STATUS_SMS = STATUS_MOTOR_ON_RTC4;
							nSTATE_MOTOR_ON_SMS=STATE_MOTOR_ON_RTC4;
							nRTC_CURRENT_STATUS = RTC4_TIMER_ON;
							RemainingRTC4Time = nMoTr.RTCOf[4]-CurrentSec;
							return 1;
						}
						else
							return 0;
			}
			else
			{
						if(FirstTimerinProgram4 == 1)
						{
							SendSmsToAll = 1;
							nSTATE_STATUS_SMS = STATUS_MOTOR_RTCOF4_TRIP_SMS;
							nSTATE_MOTOR_SMS = STATE_MOTOR_RTCOF4_TRIP_SMS;
							nSTATE_MOTOR = STATE_MOTOR_TRIP_RTCOF4;
							WHRTCPRWillNext = WhoIsNext(4);
						}
						FirstTimerinProgram4 = 0;
			}

