AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
	}
	
	nRTC_CURRENT_STATUS = NO_RTC_TIMER;
	FirstTimerinProgram1 = 0;
	FirstTimerinProgram2 = 0;
	FirstTimerinProgram3 = 0;
	FirstTimerinProgram4 = 0;
	
	
	#endif
	return 0;
}

void RunMotor(unsigned char OnOff,unsigned char PowerCondition){
   #if 1
	 
		 
		static uint8_t RecheckTankStatus = 0;	  
		uint16_t value,Tp,TpHr,TpMin,TpSec,i;
		 
		float TpCur;		
    
  
		UpdateVoicePowerCondition(PowerCondition);

		VolCurGetTimer++;
		if(PowerCondition == 0 && VolCurGetTimer>=5)
		{
			VolCurGetTimer = 0;
			CheckVoltageCurrent();
		}
		else if(PowerCondition == 1)	//else if(PowerCondition == 1&& VolCurGetTimer>=5)
		{
			VolCurGetTimer = 0;
			CheckVoltageCurrent();
		}
    if(debugon == 1)
    Debug("\n\rRunMotor Entry,%d,%d,%d",OnOff,PowerCondition,PrvOnOff);
		if((OnOff == 1) && PowerCondition == 0)
		{
					if(PrvOnOff != OnOff || PrvPowCond != PowerCondition)
					{
					 
						/* "closing all the relay before proceeding" */
						RELAY1=0;					
						RELAY2=0; 
						RELAY4=0;
						RELAY5=0;
				
			 
					if(PrvOnOff != OnOff)
							MotorTriedToStart = 1;
					
					if(Returnfromthisonly == 0 || Returnfromthisonly == 1)
					{
									if(spplowhighvoldelay>=30)
											spplowhighvoldelay=0;



									if(SendLowVoltageHighVoltage ==1 ||SendSPPLowVoltageHighVoltage == 1||MotorReversePhaseSMS==1)
									{
										if(spplowhighvoldelay>=28&& spplowhighvoldelay<=30)
										{
											//ReadSettingsFile();
											//ReadTimerSettings();
											//	spplowhighvoldelay=0;

										}
									}
									else
									{
											//	if(spplowhighvoldelay==0)
											// 	{
											ReadSettingsFile();
								      ReadTimerSettings();	
											//	 spplowhighvoldelay=0;

											// 	}

											// 	spplowhighvoldelay++;
											//	if(spplowhighvoldelay>=28&& spplowhighvoldelay<=30)
											//   {
											//	spplowhighvoldelay=0;

											//	}
									}
									Returnfromthisonly = 0;
									
									nMoTr.OnDelay = (nTimerSettings.POnHr*3600)+(nTimerSettings.POnMin*60)+nTimerSettings.POnSec;
									if(nMoTr.OnDelay>3600)
											nMoTr.OnDelay = 3600;
									
									nMoTr.StarDetaDelay = (nTimerSettings.SDHr*3600)+(nTimerSettings.SDMin*60)+nTimerSettings.SDSec;
									nMoTr.SfbDelay = (nTimerSettings.SfbHr*3600)+(nTimerSettings.SfbMin*60)+nTimerSettings.SfbSec;
									if(nMoTr.StarDetaDelay>31)
											nMoTr.StarDetaDelay = 30;

									if(nTimerSettings.DrReOnOf == 1)
									{
										nMoTr.DrRunRestart = (nTimerSettings.DrReHr*3600)+(nTimerSettings.DrReMin*60)+nTimerSettings.DrReSec;
										if(nMoTr.DrRunRestart>86400)
												nMoTr.DrRunRestart = 86400;
									}
									else
									nMoTr.DrRunRestart = 0;


									nMoTr.DrRunScan = (nTimerSettings.DrScHr*3600)+(nTimerSettings.DrScMin*60)+nTimerSettings.DrScSec;
									if(nMoTr.DrRunScan>300)
											nMoTr.DrRunScan = 300;

									if(nTimerSettings.MaxRnOnOf == 1)
									{
										nMoTr.MaxRunTimer = (nTimerSettings.MaxRnHr*3600)+(nTimerSettings.MaxRnMin*60)+nTimerSettings.MaxRnSec;
										if(nMoTr.MaxRunTimer>86400)
												nMoTr.MaxRunTimer = 86400;
									}
									else
									nMoTr.MaxRunTimer = 0;

									if(nTimerSettings.CycLicOnOf == 1)
									{
										nMoTr.CycLicOnDelay = (nTimerSettings.CycLicOnHr*3600)+(nTimerSettings.CycLicOnMin*60)+nTimerSettings.CycLicOnSec;
										nMoTr.CycLicOfDelay = (nTimerSettings.CycLicOfHr*3600)+(nTimerSettings.CycLicOfMin*60)+nTimerSettings.CycLicOfSec;
										if(nMoTr.CycLicOnDelay>86400)
										nMoTr.CycLicOnDelay = 86400;
										if(nMoTr.CycLicOfDelay>86400)
										nMoTr.CycLicOfDelay = 86400;
									}
									else
									{
										nMoTr.CycLicOnDelay = 0;
										nMoTr.CycLicOfDelay = 0;
									}
									if(nTimerSettings.ScrDlOnOff == 1)
									{
										nMoTr.Scrdl = (nTimerSettings.ScrDlHr*3600)+(nTimerSettings.ScrDlMin*60)+nTimerSettings.ScrDlSec;
									}
									else
									{
										nMoTr.Scrdl = 0;
									}

									if(nTimerSettings.PoScrDlOnOff == 1)
									{
										nMoTr.PoScrdl = (nTimerSettings.PoScrDlHr*3600)+(nTimerSettings.PoScrDlMin*60)+nTimerSettings.PoScrDlSec;
									}
									else
									{
										nMoTr.PoScrdl = 0;
									}

									if(nTimerSettings.OlOnOff == 1)
									nMoTr.OlScan = (nTimerSettings.OlScanHr*3600)+(nTimerSettings.OlScanMin*60)+nTimerSettings.OlScanSec;

									if(nTimerSettings.DrOccurOnOff == 1)
									{
										nMoTr.DrOccurTim = (nTimerSettings.DrOccurTimHr*3600)+(nTimerSettings.DrOccurTimMin*60)+nTimerSettings.DrOccurTimSec;
										nMoTr.DrOccurNum = nMoTr.DrOccurNum;
									}
									if(nTimerSettings.RTCOnOf == 1)
									{
											for(i=1;i<5;i++)
											{
												nMoTr.RTCON[i] = (nTimerSettings.RTCOnHr[i]*3600)+(nTimerSettings.RTCOnMin[i]*60)+nTimerSettings.RTCOnSec[i];
												nMoTr.RTCOf[i] = (nTimerSettings.RTCOfHr[i]*3600)+(nTimerSettings.RTCOfMin[i]*60)+nTimerSettings.RTCOfSec[i];
											}

											for(i=1;i<5;i++)
											{
												if(nMoTr.RTCON[i]>86400)
													nMoTr.RTCON[i] = 86400;
												if(nMoTr.RTCOf[i]>86400)
													nMoTr.RTCOf[i] = 86400;

											}
											for(i=1;i<5;i++)
											{
												if(nMoTr.RTCON[i]>=nMoTr.RTCOf[i])
												{
													nMoTr.RTCON[i] = 0;
													nMoTr.RTCOf[i] = 0;
												}
											}
									}
									else
									{
											for(i=1;i<5;i++)
											{
												nMoTr.RTCON[i] = 0;
												nMoTr.RTCOf[i] = 0;

											}		
									}
									
									if(nTimerSettings.ScrDlOnOff == 1)
									{
										nMoTr.Scrdl = (nTimerSettings.ScrDlHr*3600)+(nTimerSettings.ScrDlMin*60)+nTimerSettings.ScrDlSec;
									}
									else
									{
										nMoTr.Scrdl = 0;
									}

									if(nTimerSettings.PoScrDlOnOff == 1)
									{
										nMoTr.PoScrdl = (nTimerSettings.PoScrDlHr*3600)+(nTimerSettings.PoScrDlMin*60)+nTimerSettings.PoScrDlSec;
									}
									else
									{
										nMoTr.PoScrdl = 0;
									}

									if(nTimerSettings.OlOnOff == 1)
										nMoTr.OlScan = (nTimerSettings.OlScanHr*3600)+(nTimerSettings.OlScanMin*60)+nTimerSettings.OlScanSec;

