AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
									if(nTimerSettings.DrOccurOnOff == 1)
									{
										nMoTr.DrOccurTim = (nTimerSettings.DrOccurTimHr*3600)+(nTimerSettings.DrOccurTimMin*60)+nTimerSettings.DrOccurTimSec;
										nMoTr.DrOccurNum = nMoTr.DrOccurNum;
									}
					}


					nMoTr.ActOnDelay = 0;
					//nMoTr.ActDrRunRestart = 0;		//made zero in the ON DEL Timer condition
					//nTimerSettings.Drrestartpoweronof=0;
					nMoTr.ActDrRunScan = 0;
					nMoTr.ActStarDetaDelay = 0;
					nMoTr.ActSfbDelay = 0;

					RecheckCounterST = 0;
					RecheckTankStatus = 0;
					RecheckOlRstState = 0;

					nMoTr.ActPoScrdl = 0;
					nMoTr.ActScrdl = 0;
					nMoTr.ActDrOccurTim = 0;
					nMoTr.ActDrOccurNum = 0;
					nMoTr.ActOlScan = 0;
								nMoTr.ActHPScan = 0;
					nMoTr.ActLPScan = 0;
					Tp = Check2Phase();
					if(Tp == 3)
						WorkingOn3Phas = 1;
					else if(Tp == 2)
						WorkingOn3Phas = 0;
					else
						return;

					Debug("**********NowRestartMe = %d****************\n\r",NowRestartMe);		 
					if(nTimerSettings.AutoOlDrRstIIOnOff == 0 && NowRestartMe == 0)
					{
						if(PreviousTrip == OV_LOAD_TRIP_FLAG)
						{
							nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_OVERLOAD;
							nSTATE_MOTOR = STATE_MOTOR_TRIP_OVERLOAD;
							Returnfromthisonly = 1;
							if(spplowhighvoldelay++>=30)
							spplowhighvoldelay=0;
							if(nSTATE_STATUS_SMS != STATUS_MOTOR_GRTCOF_TRIP_SMS &&	nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF1_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF2_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF3_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF4_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_ON_SWITCH_TRIP_SMS )
								
							nSTATE_STATUS_SMS = STATUS_MOTOR_TRIP_OVERLOAD;
							NowRestartMe = 0;
							return;
						}

					}
					
					if(nTimerSettings.AutoDrRunRstIIOnOff == 0 && NowRestartMe == 0)
					{
						if(PreviousTrip == DYRUN_LOAD_TRIP_FLAG)
						{
							nSTATE_STATUS_SMS =STATUS_MOTOR_DRYRUN_TRIP_SMS;
							nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
							Returnfromthisonly = 1;
							if(spplowhighvoldelay++>=30)
								spplowhighvoldelay=0;
							if(	nSTATE_STATUS_SMS != STATUS_MOTOR_GRTCOF_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF1_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF2_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF3_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF4_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_ON_SWITCH_TRIP_SMS )
							
								nSTATE_STATUS_SMS = STATUS_MOTOR_DRYRUN_TRIP_SMS;
								NowRestartMe = 0;
							return;
						}
						/*else if(PreviousTrip == LOW_PRESS_TRIP_FLAG)
						{
							nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_LOWPRESS;
							//nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_LOWPRESS_SMS;
							nSTATE_MOTOR = STATE_MOTOR_TRIP_LOWPRESS;
							//nSTATE_STATUS_SMS =STATUS_MOTOR_DRYRUN_TRIP_SMS;
							//nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
							Returnfromthisonly = 1;
							if(spplowhighvoldelay++>=30)
									spplowhighvoldelay=0;
							if(	nSTATE_STATUS_SMS != STATUS_MOTOR_GRTCOF_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF1_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF2_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF3_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF4_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_ON_SWITCH_TRIP_SMS )
								
								nSTATE_STATUS_SMS = STATUS_MOTOR_TRIP_LOWPRESS;
								NowRestartMe = 0;
							return;
						}
						else if(PreviousTrip == HIGH_PRESS_TRIP_FLAG)
						{
								nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_HIGHPRESS;
								//nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_LOWPRESS_SMS;
								nSTATE_MOTOR = STATE_MOTOR_TRIP_HIGHPRESS;
								//nSTATE_STATUS_SMS =STATUS_MOTOR_DRYRUN_TRIP_SMS;
								//nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
								Returnfromthisonly = 1;
								if(spplowhighvoldelay++>=30)
										spplowhighvoldelay=0;
								if(	nSTATE_STATUS_SMS != STATUS_MOTOR_GRTCOF_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF1_TRIP_SMS &&
										nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF2_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF3_TRIP_SMS &&
										nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF4_TRIP_SMS && nSTATE_STATUS_SMS != STATUS_MOTOR_ON_SWITCH_TRIP_SMS )
								
								nSTATE_STATUS_SMS = STATUS_MOTOR_TRIP_HIGHPRESS;
								NowRestartMe = 0;
								return;
						} */  

					}   
			 
					/*if(nTimerSettings.Drrestartpoweronof==1)
					{
						nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
						nTimerSettings.Drrestartpoweronof=0;
					}
					*/
			if(nTimerSettings.CycLicOnOf == 1 )
			{
							if(nCYCTimer == NO_TCOND)
							{
											nMoTr.ActCycLicOnDelay = 0;
											nMoTr.ActCycLicOfDelay = 0;
											nCYCTimer = NO_TCOND;
							}
							else if(nCYCTimer == ON_DELAY)
							{
											Debug("Last On Delay\n\r");
											//nMoTr.ActCycLicOnDelay=NoElePowerOfTimer+nMoTr.ActCycLicOnDelay;
											//NoElePowerOfTimerratio=nMoTr.CycLicOfDelay;
											if(nMoTr.CycLicOnDelay>0)
											{
											NoElePowerOfTimerratio=nMoTr.CycLicOfDelay;
											NoElePowerOfTimerratio=NoElePowerOfTimerratio/nMoTr.CycLicOnDelay;
											NoElePowerOfTimerratio=NoElePowerOfTimerratio*nMoTr.ActCycLicOnDelay;
											Debug("nMoTr.ActCycLicOnDelay= %ld\n\r",nMoTr.ActCycLicOnDelay);					 
											}
											if(nMoTr.ActCycLicOnDelay<=nMoTr.CycLicOnDelay)
											{
												if((NoElePowerOfTimer>=nMoTr.CycLicOfDelay)||(NoElePowerOfTimer>=NoElePowerOfTimerratio))
												{
													nCYCTimer = ON_DELAY;
													nMoTr.ActCycLicOnDelay = 0;
													Debug("No Electricity Timer more Do Started Directly\n\r");							 
												}
												else
												{
													nCYCTimer = ON_DELAY;
													Debug("Keeping On Delay As it is\n\r");
												}
											}
											else
											{
												nCYCTimer = OF_DELAY;
												Debug("Going to be Off delay\n\r");

											}

								}
								else
								{
											nMoTr.ActCycLicOfDelay=NoElePowerOfTimer+nMoTr.ActCycLicOfDelay;					
											Debug("nMoTr.ActCycLicOfDelay= %ld\n\r",nMoTr.ActCycLicOfDelay);					 
											if(nMoTr.ActCycLicOfDelay>=nMoTr.CycLicOfDelay)
											{
												Debug("Going to be on delay\n\r");
												nCYCTimer = ON_DELAY;
												nMoTr.ActCycLicOnDelay = 0;
											}
											else
											{
												nCYCTimer = OF_DELAY;
												Debug("Keeping off Delay As it is\n\r");
											}
								}
								NoElePowerOfTimer = 0;
			}
			else
			{
				nMoTr.ActCycLicOnDelay = 0;
				nMoTr.ActCycLicOfDelay = 0;
				nCYCTimer = NO_TCOND;
			}

