AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			if(nTimerSettings.AutoRstOn == 0 && NowRestartMe == 0)
			{
						Debug("\n\r*******MOTOR OFF AutoRst  == 0 *************\n\r");						 

						/* "closing all the relay before proceeding" */
						RELAY1=0;					
						RELAY2=0; 
						RELAY4=0;
						RELAY5=0;

						Returnfromthisonly = 1;
						if(spplowhighvoldelay++>=30)
							spplowhighvoldelay=0;
						NowRestartMe = 0;
							if(	nSTATE_STATUS_SMS != STATUS_MOTOR_GRTCOF_TRIP_SMS &&
									nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF1_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF2_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF3_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF4_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_ON_SWITCH_TRIP_SMS )
								nSTATE_STATUS_SMS = STATUS_MOTOROF_SMS;
						return;

				}

			if(nTimerSettings.AutoStIIOnOff == 0 && WorkingOn3Phas == 0)
			{
						Debug("\n\r*******MOTOR OFF AutoStII == 0 *************\n\r");
						/* "closing all the relay before proceeding" */
						RELAY1=0;					
						RELAY2=0; 
						RELAY4=0;
						RELAY5=0;
				
							if(	nSTATE_STATUS_SMS != STATUS_MOTOR_GRTCOF_TRIP_SMS &&
									nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF1_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF2_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF3_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF4_TRIP_SMS &&
								nSTATE_STATUS_SMS != STATUS_MOTOR_ON_SWITCH_TRIP_SMS )
								nSTATE_STATUS_SMS = STATUS_MOTOROF_SMS;
						spplowhighvoldelay++;
						Debug("\n\r*******spplowhighvoldelay ==%03d  *************  SendLowVoltageHighVoltage %d \n\r",spplowhighvoldelay,SendLowVoltageHighVoltage);
						if(SendLowVoltageHighVoltage == 0 && spplowhighvoldelay>=29)
						{
							SendLowVoltageHighVoltage = 1;
							SendSmsToAll = 1;//livedataflagcount1=0;livedataflag1=1;getdataflag=1;enter2=0;
							spplowhighvoldelay =0;
							nSTATE_MOTOR_SMS = STATE_MOTOROF_3PHASE_ONLY_SMS;
						}
						Returnfromthisonly = 1;
						 
						return;
			}
			else if(Mobile2Phs3Phase == 3 && nTimerSettings.AutoStIIOnOff == 1 && WorkingOn3Phas == 0)
			{
				Debug("\n\r*******MOTOR OFF Because Mobile 3 Key Presswed *************\n\r");
				/* "closing all the relay before proceeding" */
						RELAY1=0;					
						RELAY2=0; 
						RELAY4=0;
						RELAY5=0;
				Returnfromthisonly = 1;
				if(spplowhighvoldelay++>=30)
					spplowhighvoldelay=0;
					if(nSTATE_STATUS_SMS != STATUS_MOTOR_GRTCOF_TRIP_SMS &&
					    nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF1_TRIP_SMS &&
						nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF2_TRIP_SMS &&
						nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF3_TRIP_SMS &&
						nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF4_TRIP_SMS &&
						nSTATE_STATUS_SMS != STATUS_MOTOR_ON_SWITCH_TRIP_SMS )
						nSTATE_STATUS_SMS = STATUS_MOTOROF_SMS;
				return;
			}
			else if(nTimerSettings.AutoStIIOnOff == 1 && WorkingOn3Phas == 0 && nTimerSettings.AutoRst2On == 0 && NowRestartMe == 0)
			{
			Debug("\n\r*******MOTOR OFF Because AutoRst2On ==0  *************\n\r");
				/* "closing all the relay before proceeding" */
						RELAY1=0;					
						RELAY2=0; 
						RELAY4=0;
						RELAY5=0;
				Returnfromthisonly = 1;
				if(spplowhighvoldelay++>=30)
					spplowhighvoldelay=0;

				NowRestartMe = 0;
					if(	nSTATE_STATUS_SMS != STATUS_MOTOR_GRTCOF_TRIP_SMS &&
					    nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF1_TRIP_SMS &&
						nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF2_TRIP_SMS &&
						nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF3_TRIP_SMS &&
						nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF4_TRIP_SMS &&
						nSTATE_STATUS_SMS != STATUS_MOTOR_ON_SWITCH_TRIP_SMS )
						nSTATE_STATUS_SMS = STATUS_MOTOROF_SMS;
				return;
			}

			VoltageSppRecheckflag=1;
			if(CheckSppHys() == 1 && WorkingOn3Phas == 1)
			{
			/* "closing all the relay before proceeding" */
						RELAY1=0;					
						RELAY2=0; 
						RELAY4=0;
						RELAY5=0;
				
				nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_SPP;
					nSTATE_MOTOR = STATE_MOTOR_TRIP_SPP;
					if(CheckSppHys() == 0)
					{
						nSTATE_MOTOR_ON_SMS = STATE_MOTOR_ON_SPP;
						PrvOnOff = 0;
					}
					spplowhighvoldelay++;
					Debug("\n\r*******spplowhighvoldelay ==%03d  *************\n\r",spplowhighvoldelay);
				if(SendSPPLowVoltageHighVoltage == 0 && spplowhighvoldelay>=29)
				{
					SendSPPLowVoltageHighVoltage = 1;
					spplowhighvoldelay=0;
					SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
					//nSTATE_MOTOR_SMS = STATUS_MOTOR_TRIP_SPP;
					nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_SPP_SMS;
					nSTATE_MOTOR = STATE_MOTOR_TRIP_SPP;
				}
				Returnfromthisonly = 1;
				return;

			}


			VoltageSppRecheckflag=0;
			if(CheckLowVoltageHys(WorkingOn3Phas) != 0)
			{
			/* "closing all the relay before proceeding" */
						RELAY1=0;					
						RELAY2=0; 
						RELAY4=0;
						RELAY5=0;
				
				Debug("\n\rMOTOR TRIP Low Voltage \n\r");
				nSTATE_STATUS_SMS = STATUS_MOTOR_TRIP_LOWVOLTAGE;
				spplowhighvoldelay++;
				Debug("\n\r*******spplowhighvoldelay ==%03d  *************\n\r",spplowhighvoldelay);
				if(SendLowVoltageHighVoltage == 0&& spplowhighvoldelay>=29)
				{
					SendLowVoltageHighVoltage = 1;
					SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
					spplowhighvoldelay=0;
					nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_LOWVOLTAGE_SMS;
				}
				Returnfromthisonly = 1;
				return;

			}
			else if(CheckHighVoltageHys(WorkingOn3Phas) != 0)
			{
			/* "closing all the relay before proceeding" */
						RELAY1=0;					
						RELAY2=0; 
						RELAY4=0;
						RELAY5=0;
				
				Debug("\n\rMOTOR TRIP High Voltage \n\r");
				nSTATE_STATUS_SMS = STATUS_MOTOR_TRIP_HIGHVOLTAGE;
				spplowhighvoldelay++;
				Debug("\n\r*******spplowhighvoldelay ==%03d  *************\n\r",spplowhighvoldelay);
				if(SendLowVoltageHighVoltage == 0&& spplowhighvoldelay>=29)
				{
					SendLowVoltageHighVoltage = 1;
					SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
					spplowhighvoldelay =0;
					nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_HIGHVOLTAGE_SMS;
				}
				Returnfromthisonly = 1;
				return;
			}
			else
			{
				SendLowVoltageHighVoltage = 0;
				SendSPPLowVoltageHighVoltage = 0;
				nSTATE_MOTOR_SMS =(STATE_MOTOR_SMS)STATUS_MOTOROF_SMS;
			}

			if(CheckReversePhase() == 1 && WorkingOn3Phas == 1)
			{
				MotorReversePhse = 20;
				if(MotorReversePhasePl++>=20)
				{
					/* "closing all the relay before proceeding" */
						RELAY1=0;					
						RELAY2=0; 
						RELAY4=0;
						RELAY5=0;
					
						Debug("\n\rMOTOR TRIP REVERSE PHASE \n\r");
						nSTATE_STATUS_SMS = STATUS_MOTOR_TRIP_REVERSEPHASE;
						spplowhighvoldelay++;
						Debug("\n\r*******spplowhighvoldelay ==%03d  *************\n\r",spplowhighvoldelay);
						if(MotorReversePhaseSMS == 0 && MotorReversePhasePl>=10&& spplowhighvoldelay>=29)
						{
							MotorReversePhaseSMS = 1;
							spplowhighvoldelay=0;
							SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
							nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_REVERSEPHASE_SMS;
						}
				}
				Returnfromthisonly = 1;
				return;
			}
			else
			{
				if(MotorReversePhse>=1)
				{
					MotorReversePhse--;
					Returnfromthisonly = 1;
					return;
				}
				else
				{
					MotorReversePhse = 0;
				}
			}
			ReadSettingsFile();
			ReadTimerSettings();
			spplowhighvoldelay=0;
			PowerOnDelayComPleted = 0;
			ScrDelayCompleted = 0;
			pfccompleted=0;
			relayTimer=0;
			//scrrelayTimer=0;
			if(nCYCTimer == ON_DELAY || nCYCTimer == NO_TCOND)
				nSTATE_MOTOR = STATE_MOTOR_POWERONDELAY;
			else
			{
				SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
				nSTATE_MOTOR_SMS = STATE_MOTOR_CYCLIC_TRIP_SMS;
				nSTATE_MOTOR =  STATE_MOTOR_TRIP_OFFDELAY;
				nSTATE_STATUS_SMS =STATUS_MOTOR_CYCLIC_TRIP_SMS;
			}
	if(nMoTr.ActMaxRunTimer>=nMoTr.MaxRunTimer && nMoTr.MaxRunTimer != 0)
			{
				SendSmsToAll = 1;
				nSTATE_MOTOR_SMS = STATE_MOTOR_MAX_TRIP_SMS;
				nSTATE_MOTOR = STATE_MOTOR_TRIP_MAXTIME;
			}
			for(Tp=0;Tp<=30;Tp++)
			{
				CheckUpperTank();
			}
			if(CheckUpperTank() == 1)
			{
			SendSmsToAll = 1;
            nSTATE_MOTOR_SMS = STATE_MOTOR_UPPERTANK_TRIP_SMS;
			nSTATE_MOTOR = STATE_MOTOR_TRIP_UPPERTANK;
			Debug("\n\rMotor Off Because of upper Tank\n\r");
			}
				for(Tp=0;Tp<=30;Tp++)
			{
				CheckLowerTank();
			}
			if(CheckLowerTank() == 1)
			{
			SendSmsToAll = 1;
            nSTATE_MOTOR_SMS = STATE_MOTOR_LOWERTANK_TRIP_SMS;
			nSTATE_MOTOR = STATE_MOTOR_TRIP_LOWERTANK;
			Debug("\n\rMotor Off Because of lower Tank\n\r");
			}
	 	/*	if(nMoTr.ActMaxRunTimer>=nMoTr.MaxRunTimer && nMoTr.MaxRunTimer != 0)
			{
				SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
				nSTATE_MOTOR_SMS = STATE_MOTOR_MAX_TRIP_SMS;
				nSTATE_MOTOR = STATE_MOTOR_TRIP_MAXTIME;
			} */
	/*		if(nVaTr.cyclecompleted==1 && nVaTr.cycrestartonof==0)
			{
				SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
				nVaTr.REMTIM=0;
				nSTATE_MOTOR_SMS = STATE_MOTOR_VCYCCOMPLE_TRIP_SMS;
				nSTATE_MOTOR = STATE_MOTOR_TRIP_VCYCCOMPLETE;
				RecheckCounterLT1=0;
			}
			if(nVaTr.reset_nocom_flag==1)
			{
			 if(nVaTr.no_fbk_flag==1 )
			{
				SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
				//nVaTr.REMTIM=0;
				nSTATE_MOTOR_SMS = STATE_MOTOR_NOCOMMUNICATION_TRIP_SMS;
				nSTATE_MOTOR = STATE_MOTOR_TRIP_NOCOMMUNICATION;
				RecheckCounterLT1=0;
			}
			}*/



			PrvPowCond = PowerCondition;
			PrvOnOff = OnOff;
			//spplowhighvoldelay=0;
		}
		NoElePowerOfTimer = 0;
	  //	spplowhighvoldelay=0;
		//aj sAPI_GetRealTimeClock(&datetime);
		//if(WorkingOn3Phas == 0 && PowerOnDelayComPleted == 1 && ScrDelayCompleted == 0)

		if(SCRPowerOnDelay == 1)
		{

		  if(datetime.tm_sec != ActPoScrPrvSec)
			{
				nMoTr.ActPoScrdl++;
				ActPoScrPrvSec = datetime.tm_sec;
			}  
			Debug("nMoTr.ActPoScrdl = %ld  nMoTr.PoScrdl = %ld\n\r",nMoTr.ActPoScrdl,nMoTr.PoScrdl);
			if(nMoTr.ActPoScrdl>=nMoTr.PoScrdl)
			{
					SCRPowerOnDelay = 2;
					/* OUT_DEBUG3(textBuf,"$R,3,1\n\r"); */
            nMoTr.ActScrdl=0;
		        RELAY3=1;
			}

