AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
		}
		nTimerSettings.vpfcvolt=nTimerSettings.pfcvolt-20;
		if(debugon == 1)
		Debug("\nPowerOnDelayComPleted %d \n ScrDelayCompleted %d \nnTimerSettings.pfcOnOff %d \npfccompleted %d \n nTimerSettings.pfcvolt %d \n nCurretnCond.BRVoltage %f" ,PowerOnDelayComPleted,ScrDelayCompleted,nTimerSettings.pfcOnOff,pfccompleted,nTimerSettings.pfcvolt,nCurretnCond.BRVoltage);
		if(PowerOnDelayComPleted == 1 && ScrDelayCompleted == 1 && nTimerSettings.pfcOnOff==1&&nTimerSettings.pfcvolt<nCurretnCond.BRVoltage&&pfccompleted==1)
		{
		   RELAY3=0;               //PFC relay turned off
		   pfccompleted=0;
		}
		else if(WorkingOn3Phas == 0&&PowerOnDelayComPleted == 1 && ScrDelayCompleted == 1  && nTimerSettings.pfcOnOff==1&& nTimerSettings.vpfcvolt>nCurretnCond.BRVoltage&&pfccompleted==0)
		{
 		  RELAY3=1;                //PFC relay turned on
			pfccompleted=1;
		 
		}
		else if((nTimerSettings.pfcOnOff==0||WorkingOn3Phas==1)&&PowerOnDelayComPleted == 1 && ScrDelayCompleted == 1&& pfccompleted==1)
		{
			RELAY3=0;
			RELAY2=0;		 
		  pfccompleted=0;
		}
		
		if(PowerOnDelayComPleted == 1 && ScrDelayCompleted == 0 && SCRPowerOnDelay == 2)
		{

			if(datetime.tm_sec != ActScrPrvSec)
			{
				nMoTr.ActScrdl++;
				ActScrPrvSec = datetime.tm_sec;
			}  
			Debug("nMoTr.ActScrdl = %ld  nMoTr.Scrdl = %ld\n\r",nMoTr.ActScrdl,nMoTr.Scrdl);			
			if(nMoTr.ActScrdl>=nMoTr.Scrdl)
			{
				 RELAY2=0;
				if(scrrelayTimer++>3)
				{		 
					ScrDelayCompleted = 1;
					SCRPowerOnDelay = 0;
					//SendSmsToAll = 1;
					NoAcceptSMS=0;
				}
			}
		}
	/*	if(PowerOnDelayComPleted == 1 && ScrDelayCompleted == 1)      
		{
				OUT_DEBUG3(textBuf,"$R,3,0\n\r");
				OUT_DEBUG3(textBuf,"$R,3,0\n\r");
				OUT_DEBUG3(textBuf,"$R,3,0\n\r");
		}*/

		//else if(WorkingOn3Phas != 0)
		//{
		//	ScrDelayCompleted = 1;
		//}

		MotorReversePhaseSMS = 0;
		SendLowVoltageHighVoltage = 0;
		SendSPPLowVoltageHighVoltage = 0;
		switch(nSTATE_MOTOR)
		{
			case STATE_MOTOR_POWERONDELAY:
				{
					//NoAcceptSMS = 1;
					Page = 0;
					nSTATE_STATUS_ONDELAY_SD = STATUS_MOTOR_AT_POWERONDELAY; 
					
					if(datetime.tm_sec != ActOnDelayPrvSec)
					{
						nMoTr.ActOnDelay++;
						ActOnDelayPrvSec = datetime.tm_sec;
						
						if(nMoTr.ActOnDelay<=nMoTr.OnDelay)
						RemainingTime = nMoTr.OnDelay-nMoTr.ActOnDelay;
						 
						value = RemainingTime;
						TpHr = value/3600;
						value = value%3600;
						TpMin = value/60;
						value = value%60;
						TpSec = value;
						if(TpSec<=0)
						TpSec=0;
//						sprintf((char *)lcd_row[0],"ONDEL = %02d:%02d:%02d",TpHr,TpMin,TpSec);
//						FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//						Debug((char *)lcd_row[1],"VRB:%03.0f AMP:%s     ",BigSMS,nCurretnCond.BRVoltage,TpStr);
							sprintf((char *)lcd_row[0],"ON DELAY");
							sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							print_lcd(lcd_row);
						 
						//aj strcpy(DIS_BUF,BigSMS);
						//aj	sAPI_UartWrite(SC_UART, BigSMS, strlen(BigSMS)); 
					
					}

					Debug("\n\rnMoTr.ActOnDelay = %ld  nMoTr.OnDelay = %ld\n\r",nMoTr.ActOnDelay,nMoTr.OnDelay);			 
					 
					 

					if(nMoTr.ActOnDelay>=nMoTr.OnDelay)
					{
					    scrrelayTimer=0;
							relayTimer++;
						/*iret = sAPI_GpioSetValue(RELAY2, SC_GPIORC_HIGH);
					//	iret = sAPI_GpioSetValue(RELAY1, SC_GPIORC_HIGH);*/
						if(WorkingOn3Phas == 0 )
						{
							if(relayTimer>=0 && relayTimer>=8)
							{								
								RELAY5=1;
							}
							if(relayTimer>=18 && relayTimer>=26)
							{
								RELAY2=1;
								SCRPowerOnDelay = 2;
								ScrDelayCompleted = 0;							
								pfccompleted=0;
							}
						}
						else
						{
							if(relayTimer>=0 && relayTimer>=9)
						  {
							 RELAY5=0;
							}
				      if(relayTimer>=20 && relayTimer>=29)
							SCRPowerOnDelay = 1; 
						}


						if(relayTimer>=11 && relayTimer>=18)
						{
							RELAY4=1;
						}
						if(relayTimer>=34)
						{
							RELAY1=1;
						}
						if(relayTimer>=37)
						{
							nSTATE_MOTOR = STATE_MOTOR_STARDELTADELAY;
							Debug("\n\rOn Delay Completed\n\r");
							PowerOnDelayComPleted = 1 ;
							relayTimer=0;
						}
						nMoTr.ActDrRunRestart = 0;
						nMoTr.ActScrdl=0;
						MRunTimer=0;
						MRunflow=0;
					//	pfccompleted=1;   //dg_check
					}
				}
				break;
			case STATE_MOTOR_STARDELTADELAY:
				{
					//NoAcceptSMS = 1;
					nSTATE_STATUS_ONDELAY_SD = STATUS_MOTOR_AT_STARDELTA;
					if(datetime.tm_sec != ActStarDetaPrvSec)
					{
						nMoTr.ActStarDetaDelay++;
						ActStarDetaPrvSec = datetime.tm_sec;
						RemainingTime = nMoTr.StarDetaDelay-nMoTr.ActStarDetaDelay;
						value = RemainingTime;
						TpHr = value/3600;
						value = value%3600;
						TpMin = value/60;
						value = value%60;
						TpSec = value;
						if(TpSec<=0)
						TpSec=0;
						
						if(SCRPowerOnDelay == 2) {
							//sprintf((char *)lcd_row[0],"SDDL = %02d:%02d:%02d ",TpHr,TpMin,TpSec);
							sprintf((char *)lcd_row[0],"SD DELAY");
						}
						else 
							sprintf((char *)lcd_row[0],"LVL SCAN");
//						sprintf((char *)lcd_row[0],"LEVEL SCAN.....");
//						FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//						Debug((char *)lcd_row[1],"VRB:%03.0f AMP:%s      ",BigSMS,nCurretnCond.BRVoltage,TpStr);						    
							sprintf((char *)lcd_row[1],"%02d:%02d:%02d",TpHr,TpMin,TpSec);					 
							print_lcd(lcd_row);
						
							/* sAPI_UartWrite(SC_UART, BigSMS, strlen(BigSMS)); */
							// strcpy(textBuf,"$R,2,1\n\r");
							//aj   strcpy(DIS_BUF,BigSMS);
							//aj sAPI_UartWrite(SC_UART, BigSMS, strlen(BigSMS));
					}

					Debug("\n\rnMoTr.ActStarDetaDelay = %ld  nMoTr.StarDetaDelay = %ld\n\r",nMoTr.ActStarDetaDelay,nMoTr.StarDetaDelay);
				 
					/*sprintf(buf,"%s\n\r",BigSMS);
					Debug(buf);*/
					if(nMoTr.ActStarDetaDelay>=nMoTr.StarDetaDelay)
					{
					relayTimer++;
					livedataflag1 = 1;
					livedataflagcount1=0;
						if(nMoTr.StarDetaDelay<=30)
						{
						RELAY1=0;
						}
						else
						{
						/* OUT_DEBUG3(textBuf,"$R,6,0\n\r");
						OUT_DEBUG3(textBuf,"$R,2,1\n\r"); */
							RELAY4=0;
							RELAY1=0;
						}
						if(WorkingOn3Phas == 0)
						{	
							RELAY5=1;
						}
						else
						{	
							RELAY5=0;
						}


						SendSmsflag=1;
						if(relayTimer>=3)
						{
						SendSmsToAll = 1;
						NoAcceptSMS=0;
						relayTimer=0;
						nSTATE_STATUS_ONDELAY_SD = STATUS_MOTOR_ON_PROPERLY;
						nSTATE_MOTOR_SMS = STATE_MOTORON_SMS;
						nSTATE_MOTOR = STATE_MOTOR_ON;
           
						lcd_init(); //reinit LCD whenever Motor On/off 	
							
						CatchDrAccor =1;
						if(CatchDrAccor == 1)
						{
							if(nTimerSettings.DrOccurOnOff == 1)
							{
								CurActDrRunTimer = (datetime.tm_hour*3600)+(datetime.tm_min*60)+datetime.tm_sec;
								ActDrRunTimer = CurActDrRunTimer;
							}
							CatchDrAccor = 0;
						}
						}
						if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_ONDELAY)
						{

