AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
						}
						else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_GRTC)
						{

						}
						else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_RTC1)
						{

						}
						else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_RTC2)
						{

						}
						else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_RTC3)
						{

						}
						else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_RTC4)
						{

						}
						else if(nSTATE_MOTOR_ON_SMS==STATE_MOTOR_ON_SWITCH_SMS)
						{

						}
						else if(nSTATE_MOTOR_ON_SMS == STATE_MOTOR_ON_TARGET)
						{

						}
						else
						{
							nSTATE_MOTOR_ON_SMS=STATE_MOTOR_ON_DEFAULT;
							nSTATE_STATUS_SMS =STATUS_MOTOR_ON_DEFAULT;
						}
					Debug("\n\rStar Delta Completed\n\r");

					}
				}

				break;
			case STATE_MOTOR_ON:
				{
                    
					  DryRunOccUpdate = 0;

					  if(ScrDelayCompleted == 1)
						{
								if(SendSmsflag == 1 )
								{
										RELAY1=0;
										if(delayCounterSms++>=10)
										{
											//SendSmsToAll=1;
											SendSmsflag=0;
											delayCounterSms=0;
										}
								}
								NoAcceptSMS =0;
						}  	

					if(SetToGreenFlag == 1)
					{
						Debug("\n\r==========SetToGreenFlag %d   Stg3FirstTimer %d   WorkingOn3Phas %d ========\n\r",SetToGreenFlag,
						                                                                                              Stg3FirstTimer,WorkingOn3Phas);					 
					}

					if(SetToGreenFlag == 1 && Stg3FirstTimer == 0 && WorkingOn3Phas == 0)
					{
						//TpCur = (nCurretnCond.Rcurrent+nCurretnCond.Ycurrent+nCurretnCond.Bcurrent)/3;
						ReadTimerSettings();
						TpCur=nCurretnCond.Rcurrent;
						TpCur+=nCurretnCond.Ycurrent;
						TpCur+=nCurretnCond.Bcurrent;
						TpCur = TpCur/3;
						nTimerSettings.OlAmpsII =(double)TpCur*1.5;
						nTimerSettings.DrAmpsII =(double)TpCur*0.7;
						//sprintf(buf,"\n\rTpCur = %f\n\r nTimerSettings.OlAmpsIII = %f\n\r nTimerSettings.DrAmpsIII = %f\n\r",TpCur,nTimerSettings.OlAmpsIII,nTimerSettings.DrAmpsIII);

						nTimerSettings.OlOnOff = 1;
						nTimerSettings.OlScanHr = 0;
						nTimerSettings.OlScanMin = 0;
						nTimerSettings.OlScanSec = 10;
						nTimerSettings.DrScOnOf = 1;
						nTimerSettings.DrScHr = 0;
						nTimerSettings.DrScMin = 0;
						nTimerSettings.DrScSec = 20;
						nMSettings.DryRunOnOff = 1;
						SetToGreenFlag = 0;
						Stg3FirstTimer = 1;
						SendSmsToAll = 1;
						nSTATE_MOTOR_SMS =(STATE_MOTOR_SMS)STATE_STGII_SMS;

						WriteTimerSettings();
						ReadTimerSettings();
					}
					else if(SetToGreenFlag == 1 && Stg2FirstTimer == 0 && WorkingOn3Phas == 1)
					{

						ReadTimerSettings();
						TpCur=nCurretnCond.Rcurrent;
						TpCur+=nCurretnCond.Ycurrent;
						TpCur+=nCurretnCond.Bcurrent;
						TpCur = TpCur/3;
						nTimerSettings.OlAmpsIII = (double)TpCur*1.5;
						nTimerSettings.DrAmpsIII = (double)TpCur*0.7;
						//sprintf(buf,"\n\rTpCur = %f\n\r nTimerSettings.OlAmpsIII = %f\n\r nTimerSettings.DrAmpsIII = %f\n\r",TpCur,nTimerSettings.OlAmpsIII,nTimerSettings.DrAmpsIII);
						// Debug(buf);

						nTimerSettings.OlOnOff = 1;
						nTimerSettings.OlScanHr = 0;
						nTimerSettings.OlScanMin = 0;
						nTimerSettings.OlScanSec = 10;
						nTimerSettings.DrScOnOf = 1;
						nTimerSettings.DrScHr = 0;
						nTimerSettings.DrScMin = 0;
						nTimerSettings.DrScSec = 20;
						nMSettings.DryRunOnOff = 1;
						SetToGreenFlag = 0;
						Stg2FirstTimer = 1;
						SendSmsToAll = 1;
						nSTATE_MOTOR_SMS =(STATE_MOTOR_SMS)STATE_STGIII_SMS;


						WriteTimerSettings();
						ReadTimerSettings();

					}
					else if(SetToGreenFlag == 1)
						SetToGreenFlag = 0;

					if(nTimerSettings.CycLicOnOf == 1)
					{
						nSTATE_STATUS_SMS =STATUS_MOTOR_ON_ONDELAY;
					}

					writetorecordfirsttime = 0;
					RelayConditionUpDateTimer++;
					if(RelayConditionUpDateTimer>=5 && ScrDelayCompleted==1)
					{
						RelayConditionUpDateTimer = 0;

						if(WorkingOn3Phas == 0)
						{	
							RELAY5=1;
						}
						else
						{
							RELAY5=0;
						}
						if(nMoTr.StarDetaDelay<=30)
						{
							RELAY4=1;
							RELAY1=0;
							if(pfccompleted==0)
							{
								RELAY3=0;
							}
							//pfccompleted=0;
						}
						else
						{
							RELAY4=0;
							RELAY1=1;
						}

					}
					RecheckTankStatus = 0;
					if(datetime.tm_sec != ActOnDelayPrvSec)
					{
						RunTimer++;
						MRunTimer++;
					/*	if(nVaTr.calflowrateonof==0)
						{
						Runflow = Runflow + (zone[nDripSettings.stp].runflowrate);
						MRunflow = MRunflow + (zone[nDripSettings.stp].runflowrate);
						}
						else
						{
						if(WorkingOn3Phas == 1)
						{
						Runflow = Runflow + nTimerSettings.calflow3;
						MRunflow = MRunflow + nTimerSettings.calflow3;
						}
						else
						{
						Runflow = Runflow + nTimerSettings.calflow2;
						MRunflow = MRunflow + nTimerSettings.calflow2;
						}
						}  */

						nMoTr.ActMaxRunTimer++;
						ActOnDelayPrvSec = datetime.tm_sec;
					}
					 
					if(nMoTr.ActMaxRunTimer>=nMoTr.MaxRunTimer && nMoTr.MaxRunTimer != 0)
					{
						SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
						nSTATE_MOTOR_SMS = STATE_MOTOR_MAX_TRIP_SMS;
						nSTATE_MOTOR = STATE_MOTOR_TRIP_MAXTIME;
					}			 
					
					else if(CyclicTimeron() == 0  )
					{

						nMoTr.ActCycLicOfDelay = 0;
						DISPLAYMsg = NO_COND;
						nCYCTimer = ON_DELAY;
						// Debug("\n\rGonna call checkmotor");
						CheckMotor();
						switch(nSTATE_MOTOR_PROBLEM)
						{
							case STATE_MOTOR_STARTER:
								{
									SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
									nSTATE_MOTOR_SMS = STATE_MOTOR_STARTER_TRIP_SMS;
									nSTATE_MOTOR = STATE_MOTOR_TRIP_STARTER;
									Debug("\n\rMotor Off Because of Strter Trip\n\r");
								}
								break;
							case STATE_MOTOR_NOLOAD:
								{
									nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN_SCAN;
									Debug("\n\rMotor No Load Scan Timer\n\r");
								}
								break;
							case STATE_MOTOR_OVERLOAD:
								{
									nSTATE_MOTOR = STATE_MOTOR_TRIP_OVERLOAD_SCAN;
									Debug("\n\rMotor ol Load Scan Timer\n\r");
								}
								break;
					 	case STATE_MOTOR_HIGHPRESS:
								{
									nSTATE_MOTOR = STATE_MOTOR_TRIP_HIGHPRESS_SCAN;
									Debug("\n\rMotor ol Load Scan Timer\n\r");
								}
								break;
								case STATE_MOTOR_LOWPRESS:
								{
									nSTATE_MOTOR = STATE_MOTOR_TRIP_LOWPRESS_SCAN;
									Debug("\n\rMotor ol Load Scan Timer\n\r");
								}
								break; 
							case STATE_MOTOR_SPP:
								{
									SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
									nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_SPP_SMS;
									nSTATE_MOTOR = STATE_MOTOR_TRIP_SPP;
									Debug("\n\rMotor No Load Scan Timer\n\r");
								}
								break;
							case STATE_MOTOR_CSPP:
								{
									SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
									nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_CURRENTSPP_SMS;
									nSTATE_MOTOR = STATE_MOTOR_TRIP_CURRENTSPP;
									Debug("\n\rMotor No Load Scan Timer\n\r");
								}
								break;
							case STATE_MOTOR_UPPERTANK:
								{
									SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
									nSTATE_MOTOR_SMS = STATE_MOTOR_UPPERTANK_TRIP_SMS;
									nSTATE_MOTOR = STATE_MOTOR_TRIP_UPPERTANK;
									Debug("\n\rMotor Off Because of upper Tank\n\r");
								}
								break;
							case STATE_MOTOR_LOWERTANK:
								{
									SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
									nSTATE_MOTOR_SMS = STATE_MOTOR_LOWERTANK_TRIP_SMS;
									nSTATE_MOTOR = STATE_MOTOR_TRIP_LOWERTANK;
									Debug("\n\rMotor Off Because of lower Tank\n\r");
								}
								break;
							case STATE_MOTOR_LOWVOLTAGE:
								{
									SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
									nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_LOWVOLTAGE_SMS;
									nSTATE_MOTOR = STATE_MOTOR_TRIP_LOWVOLTAGE;
									Debug("\n\rMotor Off Because of low Voltage\n\r");
								}
								break;
							case STATE_MOTOR_HIGHVOLTAGE:
								{
									SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
									nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_HIGHVOLTAGE_SMS;
									nSTATE_MOTOR = STATE_MOTOR_TRIP_HIGHVOLTAGE;
									Debug("\n\rMotor Off Because of High Voltage\n\r");
								}
								break;
							case STATE_MOTOR_OK:
								{
									nSTATE_MOTOR = STATE_MOTOR_ON;
								}
								break;
						}
					}
					else
					{
				        nCYCTimer = OF_DELAY;
						SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
						nSTATE_MOTOR_SMS = STATE_MOTOR_CYCLIC_TRIP_SMS;
						nSTATE_MOTOR =  STATE_MOTOR_TRIP_OFFDELAY;
						nSTATE_STATUS_SMS =STATUS_MOTOR_CYCLIC_TRIP_SMS;
					}
				}
				break;
			case STATE_MOTOR_TRIP_LOWVOLTAGE:
				{
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					SCRPowerOnDelay=0;
					if(writetorecordfirsttime == 0)
					{

						 
						//sAPI_GetRealTimeClock(&datetime);
						writetorecordfirsttime = 1;
						//ReadTripConditions();
						if(WorkingOn3Phas == 1)
						{
							//sprintf(buf,"GetLocalTime:%d/%d/%d %d:%d:%d\r\n",datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							// Debug(buf);
							if(WhichPhaseHaveingProblem == 1)
								sprintf(BigSMS,"MOTOR OFF BECAUSE LOW VOLTAGE-MOTOR RUNING AT III PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.LowVoltIII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 2)
								sprintf(BigSMS,"MOTOR OFF BECAUSE LOW VOLTAGE-MOTOR RUNING AT III PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.LowVoltIII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 3)
								sprintf(BigSMS,"MOTOR OFF BECAUSE LOW VOLTAGE-MOTOR RUNING AT III PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.LowVoltIII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

