AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
						}
						else
						{
							if(WhichPhaseHaveingProblem == 1)
								sprintf(BigSMS,"MOTOR OFF BECAUSE LOW VOLTAGE-MOTOR RUNING AT II PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%04d/%02d/%04d %02d:%02d:%02d",nTimerSettings.LowVoltII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 2)
								sprintf(BigSMS,"MOTOR OFF BECAUSE LOW VOLTAGE-MOTOR RUNING AT II PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%04d/%02d/%04d %02d:%02d:%02d",nTimerSettings.LowVoltII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 3)
								sprintf(BigSMS,"MOTOR OFF BECAUSE LOW VOLTAGE-MOTOR RUNING AT II PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%04d/%02d/%04d %02d:%02d:%02d",nTimerSettings.LowVoltII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

						}
//						sprintf(Triprec.Records[Triprec.TotalRecords],"%s",BigSMS);
//						Triprec.TotalRecords++;
//						WriteTripConditions();
					}


					nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_LOWVOLTAGE;
					nSTATE_MOTOR = STATE_MOTOR_TRIP_LOWVOLTAGE;
					if(CheckLowVoltageHys(WorkingOn3Phas) == 0)
					{
						nSTATE_MOTOR_ON_SMS = STATE_MOTOR_ON_LOWVOLTAGE;
						PrvOnOff = 0;
					}
					/*Tp = Check2Phase();
					if(Tp != WorkingOn3Phas)
						PrvOnOff = 0;*/
				}
				break;
			case STATE_MOTOR_TRIP_HIGHVOLTAGE:
				{
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					
					SCRPowerOnDelay=0;
					if(writetorecordfirsttime == 0)
					{
					 
					//sAPI_GetRealTimeClock(&datetime);
						writetorecordfirsttime = 1;
						//ReadTripConditions();
						if(WorkingOn3Phas == 1)
						{
							if(WhichPhaseHaveingProblem == 1)
								sprintf(BigSMS,"MOTOR OFF BECAUSE HIGH VOLTAGE-MOTOR RUNING AT III PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%04d/%02d/%04d %02d:%02d:%02d",nTimerSettings.HighVoltIII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 2)
								sprintf(BigSMS,"MOTOR OFF BECAUSE HIGH VOLTAGE-MOTOR RUNING AT III PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%04d/%02d/%04d %02d:%02d:%02d",nTimerSettings.HighVoltIII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 3)
								sprintf(BigSMS,"MOTOR OFF BECAUSE HIGH VOLTAGE-MOTOR RUNING AT III PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%04d/%02d/%04d %02d:%02d:%02d",nTimerSettings.HighVoltIII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

						}
						else
						{
							if(WhichPhaseHaveingProblem == 1)
								sprintf(BigSMS,"MOTOR OFF BECAUSE HIGH VOLTAGE-MOTOR RUNING AT II PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%04d/%02d/%04d %02d:%02d:%02d",nTimerSettings.HighVoltII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 2)
								sprintf(BigSMS,"MOTOR OFF BECAUSE HIGH VOLTAGE-MOTOR RUNING AT II PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%04d/%02d/%04d %02d:%02d:%02d",nTimerSettings.HighVoltII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 3)
								sprintf(BigSMS,"MOTOR OFF BECAUSE HIGH VOLTAGE-MOTOR RUNING AT II PHASE-SET VOLT=%03d-RPHASE  VOLT = %03d-%04d/%02d/%04d %02d:%02d:%02d",nTimerSettings.HighVoltII,(int)TripVoltage,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

						}
//						sprintf(Triprec.Records[Triprec.TotalRecords],"%s",BigSMS);
//						Triprec.TotalRecords++;
//						WriteTripConditions();
					}
					nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_HIGHVOLTAGE;
					nSTATE_MOTOR = STATE_MOTOR_TRIP_HIGHVOLTAGE;
					if(CheckHighVoltageHys(WorkingOn3Phas) == 0)
					{
						nSTATE_MOTOR_ON_SMS = STATE_MOTOR_ON_HIGHVOLTAGE;
						PrvOnOff = 0;
					}
					
					/*Tp = Check2Phase();
					if(Tp == 3)
					{
						if(WorkingOn3Phas != 1)
							PrvOnOff = 0;	
					}
					else if(Tp == 2)					
					{
						if(WorkingOn3Phas != 0)
							PrvOnOff = 0;	
					}
					else
						return;*/
				}
				break;
			case STATE_MOTOR_TRIP_SPP:
				{					 

					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					
					SCRPowerOnDelay=0;
					if(writetorecordfirsttime == 0)
					{
						 
						//sAPI_GetRealTimeClock(&datetime);
						writetorecordfirsttime = 1;
						//ReadTripConditions();
						sprintf(BigSMS,"MOTOR OFF BECAUSE VOLTAGE SPP-MOTOR RUNING AT III PHASE-%02d/%02d/%04d %02d:%02d:%02d",datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

						//sprintf(Triprec.Records[Triprec.TotalRecords],"%s",BigSMS);
						//Triprec.TotalRecords++;
						//WriteTripConditions();
					}
					nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_SPP;
					nSTATE_MOTOR = STATE_MOTOR_TRIP_SPP;
					if(CheckSpp() == 0)
					{
						nSTATE_MOTOR_ON_SMS = STATE_MOTOR_ON_SPP;
						PrvOnOff = 0;
					}
				/*	 Tp = Check2Phase();
					if(Tp == 3)
					{
						if(WorkingOn3Phas != 1)
							PrvOnOff = 0;
					}
					else if(Tp == 2)
					{
						if(WorkingOn3Phas != 0)
							PrvOnOff = 0;
					}
					else
						return; */
				}
				break;
			case STATE_MOTOR_TRIP_CURRENTSPP:
				{					 

					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					
					SCRPowerOnDelay=0;
					if(writetorecordfirsttime == 0)
					{
						 

						//sAPI_GetRealTimeClock(&datetime);
						writetorecordfirsttime = 1;
						//ReadTripConditions();
						sprintf(BigSMS,"MOTOR OFF BECAUSE CURRENT SPP-MOTOR RUNING AT III PHASE-%02d/%02d/%04d %02d:%02d:%02d",datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

