AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
						//sprintf(Triprec.Records[Triprec.TotalRecords],"%s",BigSMS);
						//Triprec.TotalRecords++;
						//WriteTripConditions();
					}
					nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_CURRENTSPP;
					nSTATE_MOTOR = STATE_MOTOR_TRIP_CURRENTSPP;
				}
				break;
			case STATE_MOTOR_TRIP_STARTER:
				{
					 
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;

					SCRPowerOnDelay=0;
					if(writetorecordfirsttime == 0)
					{
						 
						//sAPI_GetRealTimeClock(&datetime);
						writetorecordfirsttime = 1;
					//	ReadTripConditions();
						if(WorkingOn3Phas == 1)
							sprintf(BigSMS,"MOTOR OFF BECAUSE STARTER TRIP-MOTOR RUNING AT III PHASE-%02d/%02d/%04d %02d:%02d:%02d",datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
						else
							sprintf(BigSMS,"MOTOR OFF BECAUSE STARTER TRIP-MOTOR RUNING AT II PHASE-%02d/%02d/%04d %02d:%02d:%02d",datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

						//sprintf(Triprec.Records[Triprec.TotalRecords],"%s",BigSMS);
						//Triprec.TotalRecords++;
						//WriteTripConditions();
					}
					nSTATE_STATUS_SMS =STATUS_MOTOR_STARTER_TRIP_SMS;
					nSTATE_MOTOR = STATE_MOTOR_TRIP_STARTER;
					if(CyclicTimerof() == 1)
					{
						nCYCTimer = NO_TCOND;
						nMoTr.ActCycLicOnDelay = 0;
						PrvOnOff = 0;
					}

					if(MotorStarterTripCount<=1)
					{
						if(datetime.tm_sec != ActOnDelayPrvSec)
						{
							ActMotorStarterTripTimer++;
							Debug("\n\r***ActMotorStarterTripTimer = %d ************\n\r",ActMotorStarterTripTimer);							
							ActOnDelayPrvSec = datetime.tm_sec;
						}
						if(ActMotorStarterTripTimer>=180)
						{
							ActMotorStarterTripTimer = 0;
							MotorStarterTripCount++;
							OverAllStarterTrip++;
							if(OverAllStarterTrip>=2)
							{
								Debug("\n\r*** Starter Trip Restart Count OverAllStarterTrip = %d Reached************\n\r",OverAllStarterTrip);								
							}
							else
							{
								Debug("\n\r*** Starter Trip Restart Count OverAllStarterTrip = %d ************\n\r",OverAllStarterTrip);								
								Debug("\n\r*** Starter Trip Restart Count MotorStarterTripCount = %d ************\n\r",MotorStarterTripCount);								
								PrvOnOff = 0;
								ActMotorStarterTripTimer = 0;
							}
						}

					}

				}
				break;		 
			case STATE_MOTOR_TRIP_DRYRUN_SCAN:
				{
					PreviousTrip = NO_TRIP_FLAG;
					if(SetToGreenFlag == 1 && Stg3FirstTimer == 0 && WorkingOn3Phas == 0)
					{
						//TpCur = (nCurretnCond.Rcurrent+nCurretnCond.Ycurrent+nCurretnCond.Bcurrent)/3;
						ReadTimerSettings();
						TpCur=nCurretnCond.Rcurrent;
						TpCur+=nCurretnCond.Ycurrent;
						TpCur+=nCurretnCond.Bcurrent;
						TpCur = TpCur/3;
						nTimerSettings.OlAmpsII =(double) TpCur*1.5;
						nTimerSettings.DrAmpsII =(double)TpCur*0.7;
						//sprintf(buf,"\n\rTpCur = %f\n\r nTimerSettings.OlAmpsIII = %f\n\r nTimerSettings.DrAmpsIII = %f\n\r",TpCur,nTimerSettings.OlAmpsIII,nTimerSettings.DrAmpsIII);
						// Debug(buf);
						nTimerSettings.OlOnOff = 1;
						nTimerSettings.OlScanHr = 0;
						nTimerSettings.OlScanMin = 0;
						nTimerSettings.OlScanSec = 10;
						nTimerSettings.DrScOnOf = 1;
						nTimerSettings.DrScHr = 0;
						nTimerSettings.DrScMin = 0;
						nTimerSettings.DrScSec = 20;
						nMSettings.DryRunOnOff = 1;
						SetToGreenFlag = 0;
						Stg3FirstTimer = 1;
						SendSmsToAll = 1;
						nSTATE_MOTOR_SMS =(STATE_MOTOR_SMS) STATE_STGII_SMS;

						WriteTimerSettings();
						ReadTimerSettings();
					}
					else if(SetToGreenFlag == 1 && Stg2FirstTimer == 0 && WorkingOn3Phas == 1)
					{

						ReadTimerSettings();
						TpCur=nCurretnCond.Rcurrent;
						TpCur+=nCurretnCond.Ycurrent;
						TpCur+=nCurretnCond.Bcurrent;
						TpCur = TpCur/3;
						nTimerSettings.OlAmpsIII =(double) TpCur*1.2f;
						nTimerSettings.DrAmpsIII = (double)TpCur*0.7f;
						//sprintf(buf,"\n\rTpCur = %f\n\r nTimerSettings.OlAmpsIII = %f\n\r nTimerSettings.DrAmpsIII = %f\n\r",TpCur,nTimerSettings.OlAmpsIII,nTimerSettings.DrAmpsIII);
						// Debug(buf);

						nTimerSettings.OlOnOff = 1;
						nTimerSettings.OlScanHr = 0;
						nTimerSettings.OlScanMin = 0;
						nTimerSettings.OlScanSec = 10;
						nTimerSettings.DrScOnOf = 1;
						nTimerSettings.DrScHr = 0;
						nTimerSettings.DrScMin = 0;
						nTimerSettings.DrScSec = 20;
						nMSettings.DryRunOnOff = 1;
						SetToGreenFlag = 0;
						Stg2FirstTimer = 1;
						SendSmsToAll = 1;
						nSTATE_MOTOR_SMS =(STATE_MOTOR_SMS)STATE_STGIII_SMS;


						WriteTimerSettings();
						ReadTimerSettings();

					}
					else if(SetToGreenFlag == 1)
						SetToGreenFlag = 0;



					DISPLAYMsg = NO_LOAD;
					// Debug("\n\rGonna Checkmotor 25");
					CheckMotor();
					if(nSTATE_MOTOR_PROBLEM == STATE_MOTOR_NOLOAD)
					{



						if(datetime.tm_sec != ActStarDetaPrvSec)
						{
							nMoTr.ActDrRunScan++;
							ActStarDetaPrvSec = datetime.tm_sec;
						}
					  Debug("\n\rnMoTr.ActDrRunScan = %ld  nMoTr.DrRunScan = %ld\n\r",nMoTr.ActDrRunScan,nMoTr.DrRunScan);
					
						if(nTimerSettings.DrOccurOnOff == 1)
						{
							if(DryRunOccUpdate == 0)
							{
								SetDrRunTimer = (nTimerSettings.DrOccurTimHr*3600)+(nTimerSettings.DrOccurTimMin*60)+nTimerSettings.DrOccurTimSec;
								CurActDrRunTimer = (datetime.tm_hour*3600)+(datetime.tm_min*60)+datetime.tm_sec;
								if(SetDrRunTimer>=(CurActDrRunTimer-ActDrRunTimer))
								{
									Debug("\n\r DryRun Occ  ActDrRunCount= %d\n\r",ActDrRunCount);
									
									if(ActDrRunCount>=nTimerSettings.DrOccurNum)
									{
										SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
										nSTATE_STATUS_SMS =STATUS_MOTOR_DRYRUN_TRIP_SMS;
										nSTATE_MOTOR_SMS = STATE_MOTOR_DRYRUN_TRIP_SMS;
										nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
										Debug("\n\r Trip Because of DryRun Occorance\n\r");
									}
									else
										ActDrRunCount++;
								}
								DryRunOccUpdate = 1;
							}
						}

						if(nMoTr.ActDrRunScan>=nMoTr.DrRunScan)
						{
							SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
							nSTATE_STATUS_SMS =STATUS_MOTOR_DRYRUN_TRIP_SMS;
							nSTATE_MOTOR_SMS = STATE_MOTOR_DRYRUN_TRIP_SMS;
							nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
							Debug("\n\rDry Run SCAN Completed\n\r");
						}
					}
					else
					{
						CatchDrAccor =1;
						if(CatchDrAccor == 1)
						{
							if(nTimerSettings.DrOccurOnOff == 1)
							{
								CurActDrRunTimer = (datetime.tm_hour*3600)+(datetime.tm_min*60)+datetime.tm_sec;
								ActDrRunTimer = CurActDrRunTimer;
							}
							CatchDrAccor = 0;
						}
						nMoTr.ActDrRunScan = 0;
						nSTATE_MOTOR = STATE_MOTOR_ON;
					}

