AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
				}
				break;
			case STATE_MOTOR_TRIP_OVERLOAD_SCAN:
				{
					PreviousTrip = NO_TRIP_FLAG;
					if(SetToGreenFlag == 1 && Stg3FirstTimer == 0 && WorkingOn3Phas == 0)
					{
						//TpCur = (nCurretnCond.Rcurrent+nCurretnCond.Ycurrent+nCurretnCond.Bcurrent)/3;
						ReadTimerSettings();
						TpCur=nCurretnCond.Rcurrent;
						TpCur+=nCurretnCond.Ycurrent;
						TpCur+=nCurretnCond.Bcurrent;
						TpCur = TpCur/3;
						nTimerSettings.OlAmpsII =(double) TpCur*1.2f;
						nTimerSettings.DrAmpsII =(double)TpCur*0.7f;
						//sprintf(buf,"\n\rTpCur = %f\n\r nTimerSettings.OlAmpsIII = %f\n\r nTimerSettings.DrAmpsIII = %f\n\r",TpCur,nTimerSettings.OlAmpsIII,nTimerSettings.DrAmpsIII);
						// Debug(buf);
						nTimerSettings.OlOnOff = 1;
						nTimerSettings.OlScanHr = 0;
						nTimerSettings.OlScanMin = 0;
						nTimerSettings.OlScanSec = 10;
						nTimerSettings.DrScOnOf = 1;
						nTimerSettings.DrScHr = 0;
						nTimerSettings.DrScMin = 0;
						nTimerSettings.DrScSec = 20;
						nMSettings.DryRunOnOff = 1;
						SetToGreenFlag = 0;
						Stg3FirstTimer = 1;
						SendSmsToAll = 1;
						nSTATE_MOTOR_SMS =(STATE_MOTOR_SMS)STATE_STGII_SMS;

						WriteTimerSettings();
						ReadTimerSettings();
					}
					else if(SetToGreenFlag == 1 && Stg2FirstTimer == 0 && WorkingOn3Phas == 1)
					{

						ReadTimerSettings();
						TpCur=nCurretnCond.Rcurrent;
						TpCur+=nCurretnCond.Ycurrent;
						TpCur+=nCurretnCond.Bcurrent;
						TpCur = TpCur/3;
						nTimerSettings.OlAmpsIII =(double)TpCur*1.2f;
						nTimerSettings.DrAmpsIII =(double)TpCur*0.7f;
						//sprintf(buf,"\n\rTpCur = %f\n\r nTimerSettings.OlAmpsIII = %f\n\r nTimerSettings.DrAmpsIII = %f\n\r",TpCur,nTimerSettings.OlAmpsIII,nTimerSettings.DrAmpsIII);
						// Debug(buf);

						nTimerSettings.OlOnOff = 1;
						nTimerSettings.OlScanHr = 0;
						nTimerSettings.OlScanMin = 0;
						nTimerSettings.OlScanSec = 10;
						nTimerSettings.DrScOnOf = 1;
						nTimerSettings.DrScHr = 0;
						nTimerSettings.DrScMin = 0;
						nTimerSettings.DrScSec = 20;
						nMSettings.DryRunOnOff = 1;
						SetToGreenFlag = 0;
						Stg2FirstTimer = 1;
						SendSmsToAll = 1;
						nSTATE_MOTOR_SMS =(STATE_MOTOR_SMS)STATE_STGIII_SMS;
						
						WriteTimerSettings();
						ReadTimerSettings();

					}
					else if(SetToGreenFlag == 1)
						SetToGreenFlag = 0;

					DISPLAYMsg = OV_LOAD;
					CheckMotor();
					if(nSTATE_MOTOR_PROBLEM == STATE_MOTOR_OVERLOAD)
					{
						if(datetime.tm_sec != ActStarDetaPrvSec)
						{
							nMoTr.ActOlScan++;
							ActStarDetaPrvSec = datetime.tm_sec;
						}

						Debug("\n\rnMoTr.ActOlScan = %ld  nMoTr.ActOlScan = %ld\n\r",nMoTr.ActOlScan,nMoTr.ActOlScan);					
						if(nMoTr.ActOlScan>=nMoTr.OlScan)
						{
							SendSmsToAll = 1;livedataflagcount1=0;livedataflag1=1;
							nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_OVERLOAD;
							nSTATE_MOTOR_SMS = STATE_MOTOR_TRIP_OVERLOAD_SMS;
							nSTATE_MOTOR = STATE_MOTOR_TRIP_OVERLOAD;
							Debug("\n\rOver Load SCAN Completed\n\r");

							Debug("\n\rMotor Trip Over Load\n\r");
						}
					}
					else
					{
						nMoTr.ActOlScan = 0;
						nSTATE_MOTOR = STATE_MOTOR_ON;
					}

				}
				break;
		 
			case STATE_MOTOR_TRIP_OVERLOAD:
				{
					 
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					
				   SCRPowerOnDelay=0;
					if(writetorecordfirsttime == 0)
					{
						//sAPI_GetRealTimeClock(&datetime);
						writetorecordfirsttime = 1;
						//ReadTripConditions();
						if(WorkingOn3Phas == 1)
						{
						if(WhichPhaseHaveingProblem == 1)
						{
							FloatroString1Dig(TpStr,nTimerSettings.OlAmpsIII);
							sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNING AT III PHASE-SET AMPS=%s",TpStr);
							FloatroString1Dig(TpStr,TripCurrent);
							//sprintf(BigSMS,"%s-RPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
						}
						else if(WhichPhaseHaveingProblem == 2)
						{
							FloatroString1Dig(TpStr,nTimerSettings.OlAmpsIII);
							sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNING AT III PHASE-SET AMPS=%s",TpStr);
							FloatroString1Dig(TpStr,TripCurrent);
							sprintf(BigSMS,"%s-YPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
						}
						//sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNIING AT III PHASE-SET AMPS=%03.1f-YPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.OlAmpsIII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
						else if(WhichPhaseHaveingProblem == 3)
						{
							FloatroString1Dig(TpStr,nTimerSettings.OlAmpsIII);
							sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNING AT III PHASE-SET AMPS=%s",TpStr);
							FloatroString1Dig(TpStr,TripCurrent);
							sprintf(BigSMS,"%s-BPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
						}
						//sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNIING AT III PHASE-SET AMPS=%03.1f-BPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.OlAmpsIII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

						}
						else
							{
							if(WhichPhaseHaveingProblem == 1)
							{
								FloatroString1Dig(TpStr,nTimerSettings.OlAmpsII);
								sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNING AT II PHASE-SET AMPS=%s",TpStr);
								FloatroString1Dig(TpStr,TripCurrent);
								sprintf(BigSMS,"%s-BPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							}
							//sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNIING AT II PHASE-SET AMPS=%03.1f-RPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.OlAmpsII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 2)
							{
								FloatroString1Dig(TpStr,nTimerSettings.OlAmpsII);
								sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNING AT II PHASE-SET AMPS=%s",TpStr);
								FloatroString1Dig(TpStr,TripCurrent);
								sprintf(BigSMS,"%s-BPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							}
							//sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNIING AT II PHASE-SET AMPS=%03.1f-YPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.OlAmpsII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 3)
							{
								FloatroString1Dig(TpStr,nTimerSettings.OlAmpsII);
								sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNING AT II PHASE-SET AMPS=%s",TpStr);
								FloatroString1Dig(TpStr,TripCurrent);
								sprintf(BigSMS,"%s-BPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							}
							//sprintf(BigSMS,"MOTOR OFF BECAUSE OVER LOAD-MOTOR RUNIING AT II PHASE-SET AMPS=%03.1f-BPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.OlAmpsII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

