AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
							}
						//sprintf(Triprec.Records[Triprec.TotalRecords],"%s",BigSMS);
					  //Triprec.TotalRecords++;
						//WriteTripConditions();
					}
					PreviousTrip = OV_LOAD_TRIP_FLAG;
					nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_OVERLOAD;
					nSTATE_MOTOR = STATE_MOTOR_TRIP_OVERLOAD;
					if(nTimerSettings.OlRstVolOnoff == 1 && WorkingOn3Phas == 0)
					{
						if(nCurretnCond.RVoltage>nTimerSettings.OlRstVol)
						{

						}
						else if(nCurretnCond.YVoltage>nTimerSettings.OlRstVol)
						{

						}
						else if(nCurretnCond.BVoltage>nTimerSettings.OlRstVol)
						{

						}
						else
						{
							RecheckOlRstState++;
							if(RecheckOlRstState>=5)
							{
								Debug("\n\rMotor Will on Because of Olrst\n\r");
								nSTATE_MOTOR_ON_SMS = STATE_MOTOR_ON_OLVOLTAGE;
								PrvOnOff = 0;
							}
						}
					}
				}
				break;
			case STATE_MOTOR_TRIP_DRYRUN:
				{					 

					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					
                SCRPowerOnDelay=0;
					if(writetorecordfirsttime == 0)
					{
						//sAPI_GetRealTimeClock(&datetime);
						writetorecordfirsttime = 1;
				   		//ReadTripConditions();
						if(WorkingOn3Phas == 1)
						{
							if(WhichPhaseHaveingProblem == 1)
							{
								FloatroString1Dig(TpStr,nTimerSettings.DrAmpsIII);
								sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNING AT III PHASE-SET AMPS=%s",TpStr);
								FloatroString1Dig(TpStr,TripCurrent);
								sprintf(BigSMS,"%s-RPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
						  }
								//sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNIING AT III PHASE-SET AMPS=%03.1f-RPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.DrAmpsIII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 2)
							{
								FloatroString1Dig(TpStr,nTimerSettings.DrAmpsIII);
								sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNING AT III PHASE-SET AMPS=%s",TpStr);
								FloatroString1Dig(TpStr,TripCurrent);
								sprintf(BigSMS,"%s-YPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
						  }
								//sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNIING AT III PHASE-SET AMPS=%03.1f-YPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.DrAmpsIII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 3)
							{
								FloatroString1Dig(TpStr,nTimerSettings.DrAmpsIII);
								sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNING AT III PHASE-SET AMPS=%s",TpStr);
								FloatroString1Dig(TpStr,TripCurrent);
								sprintf(BigSMS,"%s-BPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
						  }
								//sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNIING AT III PHASE-SET AMPS=%03.1f-BPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.DrAmpsIII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
            }
						else
						{
							if(WhichPhaseHaveingProblem == 1)
							{
								FloatroString1Dig(TpStr,nTimerSettings.DrAmpsII);
								sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNING AT II PHASE-SET AMPS=%s",TpStr);
								FloatroString1Dig(TpStr,TripCurrent);
								sprintf(BigSMS,"%s-RPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							}
								//sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNIING AT II PHASE-SET AMPS=%03.1f-RPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.DrAmpsII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 2)
							{
								FloatroString1Dig(TpStr,nTimerSettings.DrAmpsII);
								sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNING AT II PHASE-SET AMPS=%s",TpStr);
								FloatroString1Dig(TpStr,TripCurrent);
								sprintf(BigSMS,"%s-YPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							}
								//sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNIING AT II PHASE-SET AMPS=%03.1f-YPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.DrAmpsII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							else if(WhichPhaseHaveingProblem == 3)
							{
								FloatroString1Dig(TpStr,nTimerSettings.DrAmpsII);
								sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNING AT II PHASE-SET AMPS=%s",TpStr);
								FloatroString1Dig(TpStr,TripCurrent);
								sprintf(BigSMS,"%s-BPHASE CURRENT = %s-%02d/%02d/%04d %02d:%02d:%02d",BigSMS,TpStr,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
							}
								//sprintf(BigSMS,"MOTOR OFF BECAUSE NO LOAD-MOTOR RUNIING AT II PHASE-SET AMPS=%03.1f-BPHASE CURRENT = %0.1f-%02d/%02d/%04d %02d:%02d:%02d",nTimerSettings.DrAmpsII,TripCurrent,datetime.tm_mday,datetime.tm_mon,datetime.tm_year, datetime.tm_hour, datetime.tm_min, datetime.tm_sec);

						}
						//sprintf(Triprec.Records[Triprec.TotalRecords],"%s",BigSMS);
						//Triprec.TotalRecords++;
						//WriteTripConditions();
					}
						 PreviousTrip = DYRUN_LOAD_TRIP_FLAG;
						//nSTATE_STATUS_SMS =STATUS_MOTOR_TRIP_OVERLOAD;
						//nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
					if(nTimerSettings.DrReOnOf == 1)
					{
						nTimerSettings.Drrestartpoweronof=1;
						if(datetime.tm_sec != ActStarDetaPrvSec)
						{
							nMoTr.ActDrRunRestart++;
							ActStarDetaPrvSec = datetime.tm_sec;
						}
						Debug("\n\rnnMoTr.ActDrRunRestart = %ld  nMoTr.DrRunRestart = %ld\n\r",nMoTr.ActDrRunRestart,nMoTr.DrRunRestart);						
						RemainingDrTime = nMoTr.DrRunRestart-nMoTr.ActDrRunRestart;
						if(nMoTr.ActDrRunRestart>=nMoTr.DrRunRestart)
						{
							nSTATE_MOTOR = STATE_MOTOR_TRIP_RESTART;
							Debug("\n\rReStart Time Completed\n\r");
							nTimerSettings.Drrestartpoweronof=0;
						}
						else
						{
							nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
						}
					}
					else
					{
						nSTATE_MOTOR = STATE_MOTOR_TRIP_DRYRUN;
					}

					nCYCTimer = OF_DELAY;
					if(CyclicTimerof() == 1)
					{
						nCYCTimer = NO_TCOND;
						nMoTr.ActCycLicOnDelay = 0;
						PrvOnOff = 0;
					}

