AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
				}
				break;
			case STATE_MOTOR_TRIP_UPPERTANK:
				{
					nSTATE_STATUS_SMS = STATUS_MOTOR_UPPERTANK_TRIP_SMS;
				 
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					
					SCRPowerOnDelay=0;
				 	if(CheckUpperTank() == 0)
					{
						RecheckTankStatus++;
						if(RecheckTankStatus>=5)
						{
							nSTATE_STATUS_SMS = STATUS_MOTOR_ON_UPPERTANK;
							nSTATE_MOTOR_ON_SMS = STATE_MOTOR_ON_UPPERTANK;
							PrvOnOff = 0;

						}
					}
					else
						RecheckTankStatus = 0;
					if(CyclicTimerof() == 1)
					{
						nCYCTimer = NO_TCOND;
						nMoTr.ActCycLicOnDelay = 0;
						PrvOnOff = 0;
					}	
				}
				break;
			case STATE_MOTOR_TRIP_LOWERTANK:
				{
					nSTATE_STATUS_SMS = STATUS_MOTOR_LOWERTANK_TRIP_SMS;
			   	RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					
				  SCRPowerOnDelay=0;
					if(CheckLowerTank() == 0)
					{
						RecheckTankStatus++;
						if(RecheckTankStatus>=5)
						{
							nSTATE_STATUS_SMS = STATUS_MOTOR_ON_LOWERTANK;
							nSTATE_MOTOR_ON_SMS = STATE_MOTOR_ON_LOWERTANK;
							PrvOnOff = 0; 
						}
					}
					else
						RecheckTankStatus = 0;
					nCYCTimer = OF_DELAY;
					if(CyclicTimerof() == 1)
					{
						nCYCTimer = NO_TCOND;
						nMoTr.ActCycLicOnDelay = 0;
						PrvOnOff = 0;
					}
				}
				break;
			case STATE_MOTOR_TRIP_TARGET:
				{ 
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					SCRPowerOnDelay=0;
				}
				break;
			case STATE_MOTOR_TRIP_RESTART:
				{
					nSTATE_STATUS_SMS = STATUS_ON_RESTART_NOLOAD; 
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					PrvOnOff = 0;
					SCRPowerOnDelay=0;
				}
				break;
			case STATE_MOTOR_TRIP_MAXTIME:
				{
					nSTATE_MOTOR = STATE_MOTOR_TRIP_MAXTIME;
					nSTATE_STATUS_SMS = STATUS_MOTOR_MAX_TRIP_SMS;
					
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
					
				SCRPowerOnDelay=0;
				}
				break;			 
			case STATE_MOTOR_TRIP_NOCOMMUNICATION:
				
						nSTATE_MOTOR = STATE_MOTOR_TRIP_NOCOMMUNICATION;
						nSTATE_STATUS_SMS = STATUS_MOTOR_NOCOMMUNICATION_TRIP_SMS;

						RELAY1=0;
						RELAY2=0;
						RELAY4=0;
						RELAY5=0;
						break;
			case STATE_MOTOR_TRIP_OFFDELAY:
				{					 
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
				  SCRPowerOnDelay=0;
					nCYCTimer = OF_DELAY;
					if(CyclicTimerof() == 1)
					{
						nCYCTimer = NO_TCOND;
						nMoTr.ActCycLicOnDelay = 0;
						PrvOnOff = 0;
					}
				}
				break;
			case STATE_MOTOR_OFF:
				{
				 
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
				SCRPowerOnDelay=0;
					nCYCTimer = OF_DELAY;
					if(CyclicTimerof() == 1)
					{
						nCYCTimer = NO_TCOND;
						nMoTr.ActCycLicOnDelay = 0;
						PrvOnOff = 0;
					}
				}
				break;
			default:
				 
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
				SCRPowerOnDelay=0;
				break;
		}

	}
	else
	{
		RelayConditionUpDateTimer++;
		if(RelayConditionUpDateTimer>=5)
		{
			RelayConditionUpDateTimer = 0;
			 
					RELAY1=0;
					RELAY2=0;
					RELAY4=0;
					RELAY5=0;
		}
		PrvPowCond = PowerCondition;
		nSTATE_STATUS_ONDELAY_SD = STATUS_MOTOR_AT_OFF;
		if(PowerCondition == 1)
		{
			if(datetime.tm_sec != prvNoElePowerOfTimersec)
		{
			NoElePowerOfTimer++;
			nMoTr.ActnopowerRunTimer++;
			nMoTr.ActofpowerRunTimer++;

			prvNoElePowerOfTimersec = datetime.tm_sec;
			Debug("NoElePowerOfTimer=%ld\n\r",NoElePowerOfTimer);       
			
		}
			nSTATE_STATUS_SMS = STATUS_NO_ELECTRICICY;
			//NoElePowerOfTimer++;
			//nMoTr.ActnopowerRunTimer++;
			//nMoTr.ActofpowerRunTimer++;
			NowRestartMe = 0;
		}
		else
		{
			if(	nSTATE_STATUS_SMS != STATUS_MOTOR_GRTCOF_TRIP_SMS &&
			    nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF1_TRIP_SMS &&
				nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF2_TRIP_SMS &&
				nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF3_TRIP_SMS &&
				nSTATE_STATUS_SMS != STATUS_MOTOR_RTCOF4_TRIP_SMS &&
				nSTATE_STATUS_SMS != STATUS_MOTOR_ON_SWITCH_TRIP_SMS )
					nSTATE_STATUS_SMS = STATUS_MOTOROF_SMS;
			if(MotorTriedToStart == 1)
			{
				NowRestartMe = 1;
				MotorTriedToStart = 0;
			}
		}
		nSTATE_MOTOR_ON_SMS=STATE_MOTOR_ON_DEFAULT;



		if(PrvOnOff != OnOff && PowerCondition == 0)
		{
			nMoTr.ActCycLicOnDelay = 0;
			nMoTr.ActCycLicOfDelay = 0;

			NowRestartMe = 1;
			if(nSTATE_MOTOR_SMS != STATE_MOTOR_GRTCOF_TRIP_SMS && nSTATE_MOTOR_SMS != STATE_MOTOR_RTCOF1_TRIP_SMS &&
				nSTATE_MOTOR_SMS != STATE_MOTOR_RTCOF2_TRIP_SMS && nSTATE_MOTOR_SMS != STATE_MOTOR_RTCOF3_TRIP_SMS &&
				nSTATE_MOTOR_SMS != STATE_MOTOR_RTCOF4_TRIP_SMS && nSTATE_STATUS_SMS != STATE_MOTOR_OFF_TARGET)
				{
					SendSmsToAll = 1;
					nSTATE_MOTOR_SMS = STATE_MOTOROF_SMS;
					Debug("STATE_MOTOROF_SMS loaded");
				}
		}
		//if(PrvOnOff != OnOff)
		//	PreviousTrip = NO_TRIP_FLAG;

			nSTATE_MOTOR = STATE_MOTOR_OFF;
			if(PowerCondition == 0)
				PrvOnOff = 0;
			SendLowVoltageHighVoltage = 0;
			SendSPPLowVoltageHighVoltage = 0;
			MotorReversePhaseSMS = 0;
			ActDrRunTimer = 0;
			ActDrRunCount = 0;
			CurActDrRunTimer = 0;
			SetDrRunTimer = 0;
			CatchDrAccor = 0;
	}
  #endif
  
}
void DisplayRountine(void){
#if 1
	char TpStr[20]="nimish";
	long TpHr,TpMin,TpSec,value;
	 
	checkpower=Check2Phase();


	if(MassageReceived == 0)
	{
		
		if(Page == 0)
		{
			#if 1
			Displaydelay++;
			if(Displaydelay>=2)
			{
				Displaydelay = 0;
				switch(nSTATE_STATUS_SMS)
				{

					 case STATUS_MOTOR_ON_SWITCH_TRIP_SMS:
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
								if(checkpower == 2) {
//									sprintf((char *)lcd_row[0],"MOB MOTOR OFF II ");
//									sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s  ",nCurretnCond.BRVoltage,TpStr);
									
									  sprintf((char *)lcd_row[0]," MOTOR  ");
			              sprintf((char *)lcd_row[1],"OFF  II ");
								}
								else {
//									sprintf((char *)lcd_row[0],"MOB MOTOR OFFIII ");
//									sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s  ",nCurretnCond.BRVoltage,TpStr);
										sprintf((char *)lcd_row[0]," MOTOR  ");
										sprintf((char *)lcd_row[1],"OFF III ");
								} 
					break;
					case STATUS_MOTOROF_SMS:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s   ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s  ",nCurretnCond.BRVoltage,TpStr);
								
								sprintf((char *)lcd_row[0],"SD DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
								if(checkpower == 2)
								{
//									sprintf((char *)lcd_row[0],"MOB MOTOR OFF II   " );
//									sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s  ",nCurretnCond.BRVoltage,TpStr);
									
									  sprintf((char *)lcd_row[0]," MOTOR  ");
			              sprintf((char *)lcd_row[1],"OFF II  ");
								      
