AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
								}
								else{
									//sprintf((char *)lcd_row[0],"MOB MOTOR OFF III  " );									 
									//sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s     ",nCurretnCond.BRVoltage,TpStr);
									
									sprintf((char *)lcd_row[0]," MOTOR  ");
			            sprintf((char *)lcd_row[1],"OFF III ");
									 
								}
							}							 
						}
						break;
					case STATUS_NO_ELECTRICICY:
						{
							 sprintf((char *)lcd_row[0],"NO SUPPLY");    
							 sprintf((char *)lcd_row[1],"TO MODEM ");							
						}
						break;
					case STATUS_ON_RESTART_NOLOAD:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld     ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s     ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s    ",nCurretnCond.BRVoltage,TpStr);
								
								sprintf((char *)lcd_row[0],"SD DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}							 
						}
						break;
					case STATUS_MOTOR_STARTER_TRIP_SMS:
						{
							if(WorkingOn3Phas == 0)
							{
//								sprintf((char *)lcd_row[0],"  MOTOR OFF II  "); 
//								sprintf((char *)lcd_row[1],"STARTER TRIP:%d ",(OverAllStarterTrip+1));
								sprintf((char *)lcd_row[0],"STARTER"); 
								sprintf((char *)lcd_row[1]," TRIP:%d ",(OverAllStarterTrip+1));
							}
							else
							{
//								sprintf((char *)lcd_row[0]," MOTOR OFF III  ");
//								sprintf((char *)lcd_row[1],"STARTER TRIP:%d ",(OverAllStarterTrip+1));
								sprintf((char *)lcd_row[0],"STARTER"); 
								sprintf((char *)lcd_row[1]," TRIP:%d ",(OverAllStarterTrip+1));
							}
						}
						break;
					case STATUS_MOTOR_UPPERTANK_TRIP_SMS:
						{
							if(WorkingOn3Phas == 0)
							{
//								sprintf((char *)lcd_row[0]," MOTOR OFF II     ");
//								sprintf((char *)lcd_row[1],"UPPER TANK FULL  ");
								  sprintf((char *)lcd_row[0],"  TANK  ");
								  sprintf((char *)lcd_row[1],"  FULL  ");
							}
							else
							{
//								sprintf((char *)lcd_row[0]," MOTOR OFF III     ");
//								sprintf((char *)lcd_row[1],"UPPER TANK FULL   ");
									sprintf((char *)lcd_row[0],"  TANK  ");
								  sprintf((char *)lcd_row[1],"  FULL  ");
							}
						}
						break;
					case STATUS_MOTOR_LOWERTANK_TRIP_SMS:
						{
							if(WorkingOn3Phas == 0)
							{
//								sprintf((char *)lcd_row[0]," MOTOR OFF II    ");
//								sprintf((char *)lcd_row[1],"SUMP TANK EMPTY  ");
								sprintf((char *)lcd_row[0],"  SUMP  ");
								sprintf((char *)lcd_row[1]," EMPTY  ");
							}
							else
							{
//								sprintf((char *)lcd_row[0]," MOTOR OFF III   ");
//								sprintf((char *)lcd_row[1],"SUMP TANK EMPTY  ");
								sprintf((char *)lcd_row[0],"  SUMP  ");
								sprintf((char *)lcd_row[1]," EMPTY  ");								
							}
						}
						break;
					case STATUS_MOTOR_DRYRUN_TRIP_SMS:
						{

							/*if(WhichPhaseHaveingProblem == 1)
								sprintf(BigSMS,"RPHASE: %0.1f",TripCurrent);
							else if(WhichPhaseHaveingProblem == 2)
								sprintf(BigSMS,"YPHASE: %0.1f\n",TripCurrent);
							else if(WhichPhaseHaveingProblem == 3)
								sprintf(BigSMS,"BPHASE: %0.1f\n",TripCurrent);*/
							if(WorkingOn3Phas == 0)
							{
								if(nTimerSettings.DrReOnOf == 1)
								{
									value = RemainingDrTime;
									TpHr = value/3600;
									value = value%3600;
									TpMin = value/60;
									value = value%60;
									TpSec = value;
//									sprintf((char *)lcd_row[0],"RS:%02ld:%02ld MOT OFF",TpHr,TpMin);
//									sprintf((char *)lcd_row[1],"DRY RUN TRIP II");
									
									sprintf((char *)lcd_row[0],"  DRT II  ");
									sprintf((char *)lcd_row[1]," %02ld:%02ld  ",TpHr,TpMin);
								}
								else
								{
//									sprintf((char *)lcd_row[0],"  MOTOR OFF II   ");
//									sprintf((char *)lcd_row[1],"  DRY RUN TRIP   ");
									sprintf((char *)lcd_row[0],"DRY RUN ");
									sprintf((char *)lcd_row[1],"TRIP II ");
									
								}
							}
							else
							{
								if(nTimerSettings.DrReOnOf == 1)
								{
									value = RemainingDrTime;
									TpHr = value/3600;
									value = value%3600;
									TpMin = value/60;
									value = value%60;
									TpSec = value;
//									sprintf((char *)lcd_row[0],"RS:%02ld:%02ld MOTOR OFF",TpHr,TpMin);
//									sprintf((char *)lcd_row[1],"DRYRUN TRIP III ");
									sprintf((char *)lcd_row[0],"  DRT III ");
									sprintf((char *)lcd_row[1]," %02ld:%02ld  ",TpHr,TpMin);
								}
								else
								{
//									sprintf((char *)lcd_row[0]," MOTOR OFF III  ");
//									sprintf((char *)lcd_row[1],"  DRY RUN TRIP  ");
									sprintf((char *)lcd_row[0],"DRY RUN ");
									sprintf((char *)lcd_row[1],"TRIP III");
								}
							}						 
						}
						break;
						 
					    case STATUS_MOTOR_TRIP_OVERLOAD:
						{
							/*if(WhichPhaseHaveingProblem == 1)
								sprintf(BigSMS,"RPHASE: %0.1f",TripCurrent);
							else if(WhichPhaseHaveingProblem == 2)
								sprintf(BigSMS,"YPHASE: %0.1f\n",TripCurrent);
							else if(WhichPhaseHaveingProblem == 3)
								sprintf(BigSMS,"BPHASE: %0.1f\n",TripCurrent);*/
							if(WorkingOn3Phas == 0)
							{
//								sprintf((char *)lcd_row[0],"  MOTOR OFF II  ");
//								sprintf((char *)lcd_row[1]," OVER LOAD TRIP ");
								sprintf((char *)lcd_row[0],"OVR LOAD");
								sprintf((char *)lcd_row[1],"TRIP  II");
							}
							else
							{
//								sprintf((char *)lcd_row[0]," MOTOR OFF III  ");
//								sprintf((char *)lcd_row[1],"OVER LOAD TRIP  ");
								sprintf((char *)lcd_row[0],"OVR LOAD");
								sprintf((char *)lcd_row[1],"TRIP III");
							}
						}
						break;
					case STATUS_MOTOR_TRIP_SPP:
						{
//							sprintf((char *)lcd_row[0]," MOTOR OFF III  ");
//							sprintf((char *)lcd_row[1],"   SPP FAULT    ");
								sprintf((char *)lcd_row[0],"VOLTAGE ");
								sprintf((char *)lcd_row[1],"  SPP   ");
						}
						break;
					case STATUS_MOTOR_TRIP_REVERSEPHASE:
						{
//							sprintf((char *)lcd_row[0]," MOTOR OFF III  "); 
//							sprintf((char *)lcd_row[1]," REVERSE PHASE   ");
								sprintf((char *)lcd_row[0],"REVERSE "); 
								sprintf((char *)lcd_row[1]," PHASE  ");
						}
						break;
					case STATUS_MOTOR_TRIP_CURRENTSPP:
						{
//							sprintf((char *)lcd_row[0]," MOTOR OFF III  ");
//							sprintf((char *)lcd_row[1],"  CURRENT SPP   ");
								sprintf((char *)lcd_row[0],"CURRENT ");
								sprintf((char *)lcd_row[1],"  SPP   ");
						}
						break;
					case STATUS_MOTOR_TRIP_LOWVOLTAGE:
						{

							if(WorkingOn3Phas == 0)
							{
								if(WhichPhaseHaveingProblem == 1)
								{
									sprintf((char *)lcd_row[0]," LOW VOL TRIP II ");
									sprintf((char *)lcd_row[1],"     RY: %3.0f        ",TripVoltage);
								}
								else if(WhichPhaseHaveingProblem == 2)
								{
									sprintf((char *)lcd_row[0],"LOW VOL TRIP II ");
									sprintf((char *)lcd_row[1],"    YB: %3.0f       ",TripVoltage);
								}
								else if(WhichPhaseHaveingProblem == 3)
								{
									sprintf((char *)lcd_row[0],"LOW VOL TRIP II ");
									sprintf((char *)lcd_row[1],"     BR: %3.0f       ",TripVoltage);
								}
							}
							else
							{
								if(WhichPhaseHaveingProblem == 1)
								{
									sprintf((char *)lcd_row[0],"LOW VOL TRIP III ");     
									sprintf((char *)lcd_row[1],"      RY: %3.0f        ",TripVoltage);
								}
								else if(WhichPhaseHaveingProblem == 2)
								{
									sprintf((char *)lcd_row[0],"LOW VOL TRIP III ");     
									sprintf((char *)lcd_row[1],"      YB: %3.0f        ",TripVoltage);
								}
								else if(WhichPhaseHaveingProblem == 3)
								{
									sprintf((char *)lcd_row[0],"LOW VOL TRIP III ");
									sprintf((char *)lcd_row[1],"      BR: %3.0f        ",TripVoltage);
								}
							}
						}
						break;
					case STATUS_MOTOR_TRIP_HIGHVOLTAGE:
						{
							if(WorkingOn3Phas == 0)
							{
								if(WhichPhaseHaveingProblem == 1)
								{
									sprintf((char *)lcd_row[0],"HIGH VOL TRIP II  ");
									sprintf((char *)lcd_row[1],"    RY: %3.0f        ",TripVoltage);
								}
								else if(WhichPhaseHaveingProblem == 2)
								{
									sprintf((char *)lcd_row[0],"HIGH VOL TRIP II  ");
									sprintf((char *)lcd_row[1],"    YB: %3.0f        ",TripVoltage);
								}
								else if(WhichPhaseHaveingProblem == 3)
								{
									sprintf((char *)lcd_row[0],"HIGH VOL TRIP II  ");     
									sprintf((char *)lcd_row[1],"    BR: %3.0f        ",TripVoltage);
								}
							}
							else
							{
								if(WhichPhaseHaveingProblem == 1)
								{
									sprintf((char *)lcd_row[0],"HIGH VOL TRIPIII  ");
									sprintf((char *)lcd_row[1],"    RY: %3.0f        ",TripVoltage);
								}
								else if(WhichPhaseHaveingProblem == 2)
								{
									sprintf((char *)lcd_row[0],"HIGH VOL TRIPIII");
									sprintf((char *)lcd_row[1],"    YB: %3.0f        ",TripVoltage);
								}
								else if(WhichPhaseHaveingProblem == 3)
								{
									sprintf((char *)lcd_row[0],"HIGH VOL TRIPIII");
									sprintf((char *)lcd_row[1],"    BR: %3.0f        ",TripVoltage);
								}
							}
						}
						break;
				   case STATUS_MOTOR_RTCOF1_TRIP_SMS:
						{
							FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
							sprintf((char *)lcd_row[0]," MOTOR OFF RTC1 ");
							sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
						}
						break;
					case STATUS_MOTOR_RTCOF2_TRIP_SMS:
						{
							FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
							sprintf((char *)lcd_row[0]," MOTOR OFF RTC2 ");
							sprintf((char *)lcd_row[1]," VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
						}
						break;
					case STATUS_MOTOR_RTCOF3_TRIP_SMS:
						{
							FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
							sprintf((char *)lcd_row[0]," MOTOR OFF RTC3 ");
							sprintf((char *)lcd_row[1]," VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
						}
						break;
					case STATUS_MOTOR_RTCOF4_TRIP_SMS:
						{
							FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
							sprintf((char *)lcd_row[0]," MOTOR OFF RTC4 ");
							sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);

