AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
						}
						break;
					case STATUS_MOTOR_CYCLIC_TRIP_SMS:
						{
							value = RemainingCyclicOfTime;
							TpHr = value/3600;
							value = value%3600;
							TpMin = value/60;
							value = value%60;
							TpSec = value;
							FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
							sprintf((char *)lcd_row[0],"CYT:%02ld:%02ld MOT OF ",TpHr,TpMin);
							sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s      ",nCurretnCond.BRVoltage,TpStr);
						}
						break;
					case STATUS_MOTOR_MAX_TRIP_SMS:
						{
//							sprintf((char *)lcd_row[0],"   MOTOR OFF    ");
//							sprintf((char *)lcd_row[1],"  MAXIMUM TIME  ");
								sprintf((char *)lcd_row[0],"MAX TIME");
								sprintf((char *)lcd_row[1],"REACHED ");
						}
						break;					 
					  case STATUS_MOTOR_ON_DEFAULT:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s      ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld   ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s      ",nCurretnCond.BRVoltage,TpStr);
								
								sprintf((char *)lcd_row[0]," SDDEL  ");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								if(DISPLAYMsg == NO_COND)
								{
									FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);									 
                  if(WorkingOn3Phas == 0)
									{
//										sprintf((char *)lcd_row[0],"  MOTOR ON II   ");
//										sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s       ",nCurretnCond.BRVoltage,TpStr);
											sprintf((char *)lcd_row[0]," MOTOR  ");
											sprintf((char *)lcd_row[1]," ON II  ");
									}
									else
									{
//										sprintf((char *)lcd_row[0],"  MOTOR ON III  ");
//										sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s       ",nCurretnCond.BRVoltage,TpStr);
											sprintf((char *)lcd_row[0]," MOTOR  ");
											sprintf((char *)lcd_row[1]," ON III ");
									}

								}							 
								else if(DISPLAYMsg == NO_LOAD)
								{
											FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//										sprintf((char *)lcd_row[0],"  DRY RUN TIME  ");
//										sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
											sprintf((char *)lcd_row[0],"DRY RUN ");
											sprintf((char *)lcd_row[1],"  TIME  ");
								}
								else if(DISPLAYMsg == OV_LOAD)
								{
										FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//									sprintf((char *)lcd_row[0]," OVER LOAD TIME ");
//									sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
										sprintf((char *)lcd_row[0],"OVR LOAD");
										sprintf((char *)lcd_row[1],"  TIME  ");
								}
							}							 
						}
						break;
					case STATUS_MOTOR_ON_ONDELAY:
						{

							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s    ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s      ",nCurretnCond.BRVoltage,TpStr);
								
								sprintf((char *)lcd_row[0],"SD DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingCyclicOnTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[0],"CYT:%02ld:%02ld MOT ON  ",TpHr,TpMin);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								  sprintf((char *)lcd_row[0],"CT:%02ld:%02ld",TpHr,TpMin);
								  sprintf((char *)lcd_row[1],"MOTOR ON");
							}							 
						}
						break;
						 

					case STATUS_MOTOR_ON_RTC1:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld   ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s      ",nCurretnCond.BRVoltage,TpStr);	
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s      ",nCurretnCond.BRVoltage,TpStr);
								
								sprintf((char *)lcd_row[0],"SD DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingRTC1Time;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
								sprintf((char *)lcd_row[0],"RTC1:%02ld:%02ldMOT ON  ",TpHr,TpMin);
								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
							}							 
						}
						break;
						case STATUS_MOTOR_ON_TARGET:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld   ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);		
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s       ",nCurretnCond.BRVoltage,TpStr);
								
								sprintf((char *)lcd_row[0],"SD DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingRTC2Time;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
									if(WorkingOn3Phas == 0)
									{
										sprintf((char *)lcd_row[0],"TAR MOT ON   II ");
										sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
									}
									else
									{
										sprintf((char *)lcd_row[0],"TAR MOT ON  III ");
										sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s         ",nCurretnCond.BRVoltage,TpStr);
									}
							}							 
						}
						break;
					case STATUS_MOTOR_ON_SWITCH:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								
								sprintf((char *)lcd_row[0],"SD DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingRTC2Time;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
								if(WorkingOn3Phas == 0)
								{
//									sprintf((char *)lcd_row[0],"AUTO MOT ON   II ");
//									sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
									sprintf((char *)lcd_row[0],"AUTO MOT ");
									sprintf((char *)lcd_row[1],"  ON II  ");
								}
								else
								{
//									sprintf((char *)lcd_row[0],"AUTO MOT ON  III ");
//									sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
									  sprintf((char *)lcd_row[0],"AUTO MOT ");
									  sprintf((char *)lcd_row[1]," ON III ");									  
								}
							}
							 
