AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
						}
						break;
					case STATUS_MOTOR_ON_RTC2:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);	
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0]," SDDEL  ");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingRTC2Time;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
								sprintf((char *)lcd_row[0],"RTC2:%02ld:%02ldMOT ON  ",TpHr,TpMin);
								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s       ",nCurretnCond.BRVoltage,TpStr);
							}							 
						}
						break;
					case STATUS_MOTOR_ON_RTC3:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);		
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);	
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s       ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0]," SDDEL  ");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingRTC3Time;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
								sprintf((char *)lcd_row[0],"RTC3:%02ld:%02ldMOT ON  ",TpHr,TpMin);
								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
							}							 
						}
						break;
					case STATUS_MOTOR_ON_RTC4:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s       ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0]," SDDEL  ");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingRTC4Time;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
								sprintf((char *)lcd_row[0],"RTC4:%02ld:%02ldMOT ON",TpHr,TpMin);
								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
							}						 
						}
						break;
					case STATUS_MOTOR_ON_UPPERTANK:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s       ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"SD DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingRTC1Time;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[0],"   MOTOR ON     ");
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"MOTOR ON");
								sprintf((char *)lcd_row[1],"        ");
							}
 
