AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
						}
						break;
					case STATUS_MOTOR_ON_LOWERTANK:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s       ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"SD DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingRTC1Time;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
									if(WorkingOn3Phas == 0)
									{
//										sprintf((char *)lcd_row[0],"  MOTOR ON  II  ");
//										sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
										sprintf((char *)lcd_row[0]," MOTOR  ");
										sprintf((char *)lcd_row[1]," ON II  ");
									}
									else
									{
//										sprintf((char *)lcd_row[0],"  MOTOR ON III  ");
//										sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
										sprintf((char *)lcd_row[0]," MOTOR  ");
										sprintf((char *)lcd_row[1]," ON III ");
									}
							}							 
						}
						break;
					case STATUS_MOTOR_ON_RESTARTTIMER:
						{
							if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_POWERONDELAY)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"ONDEL = %02ld:%02ld:%02ld  ,",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"ON DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
								break;
							}
							else if(nSTATE_STATUS_ONDELAY_SD == STATUS_MOTOR_AT_STARDELTA)
							{
								value = RemainingTime;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
//								sprintf((char *)lcd_row[0],"SDDL = %02ld:%02ld:%02ld  ",TpHr,TpMin,TpSec);
//								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
//								sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s       ",nCurretnCond.BRVoltage,TpStr);
								sprintf((char *)lcd_row[0],"SD DELAY");
								sprintf((char *)lcd_row[1],"%02ld:%02ld:%02ld",TpHr,TpMin,TpSec);
							}
							else
							{
								value = RemainingRTC1Time;
								TpHr = value/3600;
								value = value%3600;
								TpMin = value/60;
								value = value%60;
								TpSec = value;
								FloatroString1Dig(TpStr,nCurretnCond.Bcurrent);
								if(WorkingOn3Phas == 0)
								{
//									sprintf((char *)lcd_row[0],"  MOTOR ON  II ");
//									sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
										sprintf((char *)lcd_row[0]," MOTOR  ");
										sprintf((char *)lcd_row[1]," ON II  ");
								}
								else
								{
//									sprintf((char *)lcd_row[0]," MOTOR ON III  ");
//									sprintf((char *)lcd_row[1],"VRB:%03.0f AMP:%s        ",nCurretnCond.BRVoltage,TpStr);
									  sprintf((char *)lcd_row[0]," MOTOR  ");
									  sprintf((char *)lcd_row[1]," ON III ");
								}
							}
							 
						}
						break;
					default:
						{
							sprintf(BigSMS2,"Worning Malfunction Please Contact Support");
						}
						break;
				}
				
			}
			 
			#endif
			
		}	   	
		else if(Page == 1)
		{
			Displaydelay++;
			if(Displaydelay>=1)
			{
				Displaydelay = 0;
				sprintf((char *)lcd_row[0],"%03.0fRN      %03.0fYN   ",nCurretnCond.RVoltage,nCurretnCond.YVoltage);
				sprintf((char *)lcd_row[1],"%03.0fBN     VOLTS      ",nCurretnCond.BVoltage);    
				 
			}
		}
		else if(Page == 2)
		{
			Displaydelay++;
			if(Displaydelay>=1)
			{
				Displaydelay = 0;
				sprintf((char *)lcd_row[0],"%03.0fRY    %03.0fYB    ",nCurretnCond.RYVoltage,nCurretnCond.YBVoltage);
				sprintf((char *)lcd_row[1],"%03.0fBR    VOLTS       ",nCurretnCond.BRVoltage);    
				 
			}
		}
		else if(Page == 3)
		{
			Displaydelay++;
			if(Displaydelay>=1)
			{
			  FloatroString1Dig((char *)TpS1tr,nCurretnCond.Rcurrent);
				FloatroString1Dig((char *)TpS2tr,nCurretnCond.Ycurrent);
			  FloatroString1Dig((char *)TpS3tr,nCurretnCond.Bcurrent);
				Displaydelay = 0;
				sprintf((char *)lcd_row[0],"%sR    %sY      ",TpS1tr,TpS2tr);
				sprintf((char *)lcd_row[1],"%sB    AMPS       ",TpS3tr); 
				 
			}
		}
		else if(Page == 4)
		{
			Displaydelay++;
			if(Displaydelay>=1)
			{ 

			float SignalStrength=0;
			int sstrength=0;
			SignalStrength = (float)(CSQ*3.2258);
			if(SignalStrength>100)
			SignalStrength = 100;
			else if(SignalStrength<0)
			SignalStrength = 0;
			sstrength=SignalStrength; 

				Displaydelay = 0;
				sprintf((char *)lcd_row[0],"SIGNAL STRENGTH   ");
			  sprintf((char *)lcd_row[1],"  %03d PERCENT     ",sstrength);
				 
			}
		}
		else if(Page == 5)
		{
			Displaydelay++;
			if(Displaydelay>=1)
			{
				Displaydelay = 0;				
				sprintf((char *)lcd_row[0],"DATE:%02d/%02d/%04d   ",datetime.tm_mday,datetime.tm_mon,datetime.tm_year);
				sprintf((char *)lcd_row[1],"TIME:%02d:%02d:%02d   ",datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
			 
