AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			}
		}
		else if(Page == 6)
		{
			Displaydelay++;
			if(Displaydelay>=1)
			{
				Displaydelay = 0;			 
				sprintf((char *)lcd_row[0],"ORO-PUMP %s      ",Version );
				sprintf((char *)lcd_row[1],"Build :%s          ",Build);
				 
			}
		}
		else if(Page == 7)
		{
			Displaydelay++;
			if(Displaydelay>=1)
			{
				Displaydelay = 0;			 			 
				sprintf((char *)lcd_row[0],"      SMSM           ");
				sprintf((char *)lcd_row[1],"   %s                ",StoredPhoneNumber[0]);
				 
			}
		}
		else if(Page == 8)
		{
			Displaydelay++;
			if(Displaydelay>=3)
			{
				Displaydelay = 0;			 				 
				sprintf((char *)lcd_row[0],"      IMEI          ");
				//sprintf((char *)lcd_row[1],"   %s                ",IMEI);
				sprintf((char *)lcd_row[1],"864180050432315 ");
				 
			}
		}
		else if(Page == 9)
		{
			Displaydelay++;
			if(Displaydelay>=12)
			{
				Displaydelay = 0;				 
				switch (SubPage)
				{
					case 0:
					{ 
						nMSettings.shwvolt =0;
						if(nMSettings.shwvolt == 1) {
						sprintf((char *)lcd_row[0],"  VPH   ");
						sprintf((char *)lcd_row[1]," RN:231 ");						 
						SubPage++;
						}
						else{
							SubPage++;
							Displaydelay=13;
						}
						break;
					}
					case 1:
					{ 
						nMSettings.shwvolt =0;
						if(nMSettings.shwvolt == 1) {
						sprintf((char *)lcd_row[0]," YN:233 ");
						sprintf((char *)lcd_row[1]," BN:235 ");						 
						SubPage++;
						}
						else{
							SubPage++;
							Displaydelay=13;
						}
						break;
					}
					case 2:
					{ 
						nMSettings.shwvolt =0;
						if(nMSettings.shwvolt == 1) {
						sprintf((char *)lcd_row[0],"   VL   ");
						sprintf((char *)lcd_row[1]," RY:401 ");						 
						SubPage++;
						}
						else{
							SubPage++;
							Displaydelay=13;
						}
						break;
					}
					case 3:
					{ 
						nMSettings.shwvolt =0;
						if(nMSettings.shwvolt == 1) {
						sprintf((char *)lcd_row[0]," YB:402  ");
						sprintf((char *)lcd_row[1]," BR:402  ");						 
						SubPage++;
						}
						else{
							SubPage++;
							Displaydelay=13;
						}
						break;
					}
					case 4:
					{ 
						nMSettings.shwcur =1;
						if(nMSettings.shwcur == 1){
						sprintf((char *)lcd_row[0],"  AMPS  ");
						sprintf((char *)lcd_row[1],"RC:15.3 ");						 
						SubPage++;
						}
						else {
						 SubPage++;
						 Displaydelay=13;
						}
						break;
					}
					case 5:
					{ 
						nMSettings.shwcur =1;
						if(nMSettings.shwcur == 1){
						sprintf((char *)lcd_row[0],"YC:15.7 ");
						sprintf((char *)lcd_row[1],"BC:15.7 ");						 
						SubPage++;						
						} 
						else {
						 SubPage++;
						 Displaydelay=13;
						}
						break;
					}
					case 6:
					{ 					 					 
              sprintf((char *)lcd_row[0],"%02d:%02d:%02d",datetime.tm_hour,datetime.tm_min,datetime.tm_sec);
		          sprintf((char *)lcd_row[1],"%02d/%02d/%02d",datetime.tm_mday,datetime.tm_mon,datetime.tm_year);							
							SubPage++; 
						  break;
					}
					case 7:
					{  
						sprintf((char *)lcd_row[0]," SIGNAL ");
						sprintf((char *)lcd_row[1],"  %d%%   ",85);						 
						SubPage++; 
						break;
					}
					case 8:
					{  
						sprintf((char *)lcd_row[0],"8641800 ");
						sprintf((char *)lcd_row[1],"50432523 ");						 
						SubPage++; 
						break;
					}
					
					case 9:
					{ 
						Page=0; 
						break;
					}
					default:
					{
					}
				}
			}
		}
		#if 0 
		else if(Page == 9)
		{
			Displaydelay++;
			if(Displaydelay>=10)
			{
				Displaydelay = 0;				 
				switch (SubPage)
				{
					case 0:
					{
						if(nTimerSettings.OlOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"  OVER LOAD ON   ");
							sprintf((char *)lcd_row[1],"  TIM:%02d:%02d:%02d     ",nTimerSettings.OlScanHr,nTimerSettings.OlScanMin,nTimerSettings.OlScanSec);
						}
						else
						{
							sprintf((char *)lcd_row[0],"  OVER LOAD OFF ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 1:
					{
						FloatroString1Dig((char *)TpS3tr,nTimerSettings.OlAmpsII);
						sprintf((char *)lcd_row[0],"  OL II %s      ",TpS3tr);
						FloatroString1Dig((char *)TpS3tr,nTimerSettings.OlAmpsIII);
						sprintf((char *)lcd_row[1],"  OL III %s      ",TpS3tr);
						
						SubPage++;
						break;
					}
					case 2:
					{
						if(nMSettings.DryRunOnOff == 1)
						{
							sprintf((char *)lcd_row[0]," DRY RUN SCAN ON  ");
							sprintf((char *)lcd_row[1]," TIM:%02d:%02d:%02d         ",nTimerSettings.DrScHr,nTimerSettings.DrScMin,nTimerSettings.DrScSec);
						}
						else
						{
							sprintf((char *)lcd_row[0],"DRY RUN SCAN OFF");
							sprintf((char *)lcd_row[1],"                 ");
						}
						SubPage++;
						break;
					}
					case 3:
					{
					  FloatroString1Dig((char *)TpS3tr,nTimerSettings.DrAmpsII);
						sprintf((char *)lcd_row[0],"DRY RUN II %s     ",TpS3tr);
						FloatroString1Dig((char *)TpS3tr,nTimerSettings.DrAmpsIII);
						sprintf((char *)lcd_row[1],"DRY RUN III %s        ",TpS3tr);
						
						SubPage++;
						break;
					}
					case 4:
					{						 
						if(nTimerSettings.LowVoltOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"   LOW VOLT ON      ");
							sprintf((char *)lcd_row[1],"II:%03d  III:%03d   ",nTimerSettings.LowVoltII,nTimerSettings.LowVoltIII);
						}
						else
						{
							sprintf((char *)lcd_row[0],"  LOW VOLT OFF    ");
							sprintf((char *)lcd_row[1],"                ");
						}
						
						SubPage++;
						break;
					}
					case 5:
					{						 
						if(nTimerSettings.LowVoltOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"  HIGH VOLT ON  ");
							sprintf((char *)lcd_row[1],"II:%03d  III:%03d      ",nTimerSettings.HighVoltII,nTimerSettings.HighVoltIII);
						}
						else
						{
							sprintf((char *)lcd_row[0]," HIGH VOLT OFF  ");
							sprintf((char *)lcd_row[1],"                 ");
						}
						
						SubPage++;
						break;
					}
					case 6:
					{
						 
						sprintf((char *)lcd_row[0]," IMBALANCE VOLT ");
						sprintf((char *)lcd_row[1],"    Val:%03d       ",nTimerSettings.ImbVolt);
						
						SubPage++;
						break;
					}
					case 7:
					{
						 
						sprintf((char *)lcd_row[0],"   ON DELAY     ");
						sprintf((char *)lcd_row[1],"TIM:%02d:%02d:%02d   ",nTimerSettings.POnHr,nTimerSettings.POnMin,nTimerSettings.POnSec);
						
						SubPage++;
						break;
					}
					case 8:
					{
						 
