AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
						sprintf((char *)lcd_row[0],"STAR DELTA DELAY ");
						sprintf((char *)lcd_row[1],"TIM:%02d:%02d:%02d   ",nTimerSettings.SDHr,nTimerSettings.SDMin,nTimerSettings.SDSec);
						
						SubPage++;
						break;
					}
					case 9:
					{
						if(nTimerSettings.ScrDlOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"  SCR TIMER ON  ");
							sprintf((char *)lcd_row[1],"  TIM:%02d:%02d:%02d  ",nTimerSettings.ScrDlHr,nTimerSettings.ScrDlMin,nTimerSettings.ScrDlSec);
						}
						else
						{
							sprintf((char *)lcd_row[0],"  SCR TIMER OFF ");
							sprintf((char *)lcd_row[1],"                ");
						}						
						SubPage++;
						break;
					}
					case 10:
					{
						 
						if(nTimerSettings.PoScrDlOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"  SCR DELAY ON   ");
							sprintf((char *)lcd_row[1],"  TIM:%02d:%02d:%02d   ",nTimerSettings.PoScrDlHr,nTimerSettings.PoScrDlMin,nTimerSettings.PoScrDlSec);
						}
						else
						{
							sprintf((char *)lcd_row[0],"  SCR DELAY OFF ");
							sprintf((char *)lcd_row[1],"                ");					
						}
						SubPage++; 
						break;
					}
					
					case 11:
					{
						 
						if(nMSettings.SecOnOf == 1)
						{
							sprintf((char *)lcd_row[0],"  SECURITY ON   ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[1],"  SECURITY OFF  ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 12:
					{
						 
						if(nTimerSettings.MaxRnOnOf == 1)
						{
							sprintf((char *)lcd_row[0],"  MAX TIMER ON  ");
							sprintf((char *)lcd_row[1],"TIM:%02d:%02d:%02d  ",nTimerSettings.MaxRnHr,nTimerSettings.MaxRnMin,nTimerSettings.MaxRnSec);
						}
						else
						{
							sprintf((char *)lcd_row[0]," MAX TIMER OFF  ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 13:
					{
            
						if(nTimerSettings.DrReOnOf == 1)
						{							 
							sprintf((char *)lcd_row[0]," DRY RUN RST ON ");
							sprintf((char *)lcd_row[1],"TIM:%02d:%02d:%02d    ",nTimerSettings.DrReHr,nTimerSettings.DrReMin,nTimerSettings.DrReSec);
						}
						else
						{
							sprintf((char *)lcd_row[0],"DRY RUN RST OFF ");
							sprintf((char *)lcd_row[1],"                ");									
						}
						SubPage++;
						break;
					}
					case 14:
					{
						 
						if(nTimerSettings.CycLicOnOf == 1)
						{
							sprintf((char *)lcd_row[0],"  CYT TIMER ON  ");
							sprintf((char *)lcd_row[1],"%02d:%02d   %02d:%02d  ",nTimerSettings.CycLicOnHr,nTimerSettings.CycLicOnMin,nTimerSettings.CycLicOfHr,nTimerSettings.CycLicOfMin);

						}
						else
						{
							sprintf((char *)lcd_row[0]," CYT TIMER OFF  ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 15:
					{
						 
						if(nTimerSettings.RTCOnOf == 1)
						{
							sprintf((char *)lcd_row[0]," RTC1 TIMER ON  "); 
							sprintf((char *)lcd_row[1],"%02d:%02d   %02d:%02d  ",nTimerSettings.RTCOnHr[1],nTimerSettings.RTCOnMin[1],nTimerSettings.RTCOfHr[1],nTimerSettings.RTCOfMin[1]);
						}
						else
						{
							sprintf((char *)lcd_row[0]," RTC TIMER OFF  ");
							sprintf((char *)lcd_row[1],"                ");
							SubPage = 19;
							break;
						}				
						SubPage++;
						break;
						
					}
					case 16:
					{
            
						sprintf((char *)lcd_row[0]," RTC2 TIMER ON  ");
						sprintf((char *)lcd_row[1],"%02d:%02d    %02d:%02d     ",nTimerSettings.RTCOnHr[2],nTimerSettings.RTCOnMin[2],nTimerSettings.RTCOfHr[2],nTimerSettings.RTCOfMin[2]);
						SubPage++;
						break;
					}
					case 17:
					{
             
						sprintf((char *)lcd_row[0]," RTC3 TIMER ON  ");
						sprintf((char *)lcd_row[1],"%02d:%02d    %02d:%02d     ",nTimerSettings.RTCOnHr[3],nTimerSettings.RTCOnMin[3],nTimerSettings.RTCOfHr[3],nTimerSettings.RTCOfMin[3]);
						SubPage++;
						break;
					}
					case 18:
					{
             
						sprintf((char *)lcd_row[0]," RTC4 TIMER ON  ");
						sprintf((char *)lcd_row[1],"%02d:%02d   %02d:%02d      ",nTimerSettings.RTCOnHr[4],nTimerSettings.RTCOnMin[4],nTimerSettings.RTCOfHr[4],nTimerSettings.RTCOfMin[4]);
						SubPage++;
						break;
					}
					case 19:
					{
						sprintf((char *)lcd_row[0],"DATE:%02d/%02d/%04d    ",datetime.tm_mday,datetime.tm_mon,datetime.tm_year);
						sprintf((char *)lcd_row[1],"TIME:%02d:%02d:%02d    ",datetime.tm_hour, datetime.tm_min, datetime.tm_sec);
						SubPage++;
						break;
					}
					case 20:
					{
						 
						if(nMSettings.VBFOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"  VOICE FEB ON  ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"  VOICE FEB OFF ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 21:
					{
						 
						if(nMSettings.SumpOnOff == 1)
						{
							sprintf((char *)lcd_row[0]," SUMP LEVEL ON  ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{							
							sprintf((char *)lcd_row[0]," SUMP LEVEL OFF ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 22:
					{
						 
						if(nMSettings.TankOnOff == 1)
						{
							sprintf((char *)lcd_row[0]," TANK LEVEL ON  ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0]," TANK LEVEL OFF ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						
						SubPage++;
						break;
					}
					case 23:
					{
						 
						if(nMSettings.TargetOnOff == 1)
						{
							sprintf((char *)lcd_row[0]," TARGET CALL ON ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"TARGET CALL OFF ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 24:
					{
						 
						if(nTimerSettings.RvePhOnoff == 1)
						{
							sprintf((char *)lcd_row[0],"REVERS PHASE ON ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"REVERS PHASE OFF");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 25:
					{
						 
						if(nTimerSettings.CurSppOnOff == 1)
						{
							sprintf((char *)lcd_row[0]," CURRENT SPP ON ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"CURRENT SPP OFF ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 26:
					{
						 
						if(nTimerSettings.SppOnoff == 1)
						{
							sprintf((char *)lcd_row[0],"  VOLT SPP ON   ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"  VOLT SPP OFF  ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;	
						break;
					}
					case 27:
					{
						 
						if(nMSettings.SMSOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"     SMS ON     ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"     SMS OFF    ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;

