AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
					}
					case 28:
					{
						 
						if(nMSettings.SfbOnOff == 1)
						{
							sprintf((char *)lcd_row[0]," STARTER FEB ON ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"STARTER FEB OFF ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 29:
					{
						 
						if(nMSettings.RelayControlOnCall == 1)
						{
							sprintf((char *)lcd_row[0],"  CALL REC ON   ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"  CALL REC OFF  ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 30:
					{
						 
						if(nTimerSettings.AutoStIIOnOff == 1)
						{
							sprintf((char *)lcd_row[0]," AUTO SET II ON ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0]," AUTO SET II OFF");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 31:						
					{
						 
						if(nTimerSettings.AutoStIIIOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"AUTO SET III ON ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"AUTO SET III OFF");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 32:
					{
						 
						if(nTimerSettings.AutoOlDrRstIIOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"   OL RST ON    ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"   OL RST OFF   ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 33:
					{
						 
						if(nTimerSettings.AutoDrRunRstIIOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"   DY RST ON    ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"   DY RST OFF   ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}

					case 34:
					{
						 
						if(nTimerSettings.ManualOnOff == 1)
						{
							sprintf((char *)lcd_row[0],"   MANUAL ON    ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"   MANUAL OFF   ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 35:
					{
						 
						if(nTimerSettings.OlRstVolOnoff == 1)
						{
							sprintf((char *)lcd_row[0]," OL RST VOLT ON ");
							sprintf((char *)lcd_row[1],"VOL:%03d        ",nTimerSettings.OlRstVol);
						}
						else
						{
							sprintf((char *)lcd_row[0]," OL RST VOLT OFF");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 36:
					{
						 
						if(nTimerSettings.DrOccurOnOff == 1)
						{
							sprintf((char *)lcd_row[0]," DRY RUN OCC ON ");
							sprintf((char *)lcd_row[1],"TIM:%02d:%02d-%02d        ",nTimerSettings.DrOccurTimHr,nTimerSettings.DrOccurTimMin,nTimerSettings.DrOccurNum);
						}
						else
						{
							sprintf((char *)lcd_row[0],"DRY RUN OCC OFF ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 37:
					{
						 
						if(nTimerSettings.CTRonoff == 1)
						{
							sprintf((char *)lcd_row[0],"    CT R ON    ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"    CT R OFF    ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 38:
					{
						 
						if(nTimerSettings.CTYonoff == 1)
						{
							sprintf((char *)lcd_row[0],"    CT Y ON    ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"    CT Y OFF    ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 39:
					{
						 
						if(nTimerSettings.CTBonoff == 1)
						{							
							sprintf((char *)lcd_row[0],"    CT B ON    ");
							sprintf((char *)lcd_row[1],"                ");
						}
						else
						{
							sprintf((char *)lcd_row[0],"    CT B OFF   ");
							sprintf((char *)lcd_row[1],"                ");						
						}
						SubPage++;
						break;
					}
					case 40:
					{						 
						sprintf((char *)lcd_row[0],"STAR TRIP DELAY ");
						sprintf((char *)lcd_row[1],"TIM:%02d:%02d:%02d           ",nTimerSettings.SfbHr,nTimerSettings.SfbMin,nTimerSettings.SfbSec);
						SubPage++;
						break;
					}
					case 41:
					{
						SubPage = 0;
						Page = 0;
						break;
					}
				}

			}
			
		}
    #endif
    
	}
	
	else if(MassageReceived == 1)
	{ 
		 
		sprintf((char *)lcd_row[0],"SETTING");
		sprintf((char *)lcd_row[1],"RECEIVED");
		 
		Displaydelay++;
		if(Displaydelay>=5)
		{
			Displaydelay = 0;		 
			MassageReceived = 0;
		}
	}
	else if(MassageReceived == 2)
	{		 
		sprintf((char *)lcd_row[0],"MESSAGE ");
		sprintf((char *)lcd_row[1],"SENT... ");
		 
		Displaydelay++;
		if(Displaydelay>=5)
		{
			Displaydelay = 0;
			MassageReceived = 0;
		}
	}
 
	 print_lcd(lcd_row); 
 
	#endif
}

uint8_t Process_Received_Settings(void){
	#if 1
		char ProcessBuf[200]={0};
		char* Pch1=NULL;char*p=NULL;
		uint16_t length=0;
		//Debug("\nReceived uart data:[%s]\n",ModemString);
		if(ModemString[0] == '$')
		{
				memcpy(ProcessBuf,(char*)ModemString+1,(strlen((char*)ModemString)-2));	
				/*after copy clr the modem buffer*/
				memset((char*)ModemString,NULL,sizeof(ModemString));
				//Debug("\n#ProcessBuf:[%s]\n",ProcessBuf);
				
				/*convert to lowercase*/
				p = ProcessBuf;
			length=strlen(ProcessBuf);
			for (i = 0; i <length; i++)  
			{
				if(*p>='A' && *p<='Z')
				*p = (*p+'a')-'A';
				p++;
			}
			/*split data with ','*/
			Pch1 = strtok((char *)ProcessBuf, (char *)"," );
			StrTokStrVer = 0;
			while( Pch1 != NULL )
			{
				strcpy(StrTokStr[StrTokStrVer],Pch1);
				StrTokStrVer++;
				Pch1 = strtok( NULL, "," );
			}
			
