AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			//if(debugon==1)
			Debug("\nUART DATA:{%s}\n",StrTokStr[0]);
      printf("\nUART DATA:{%s}\n",StrTokStr[0]); 			
			/*sending ack after receiving the data*/
			printf(ACK);
			//Uart_Send_with_crc(ACK);
			/*settings process starts here*/
			
			if(strstr(StrTokStr[0],"motoron") != 0)
          {motoron(PhoneNumber);}
      if(strstr(StrTokStr[0],"motorof") != 0)
          {motorof(PhoneNumber);}
		  if(strstr(StrTokStr[0],"mtron") != 0)
          {motoron(PhoneNumber);}
      if(strstr(StrTokStr[0],"mtrof") != 0)
          {motorof(PhoneNumber);}
					
			if(strstr(StrTokStr[0],"+rxdtmf") != 0 )
				{
					/*call function handle */
					DTMF_Proccessor(StrTokStr[0]);
				}					
			else if(strstr(StrTokStr[0],"debugon") != 0 )
				{
				debugon=1;
				nMSettings.ndebugonof=1;
			}
			else if(strstr(StrTokStr[0],"test1") != 0 )
				{				
				char  buf[50] ="test string";				 
				Uart_Send_with_crc(buf);	
        				
			}
			else if(strstr(StrTokStr[0],"prodset") != 0 )
				{
				prodset();
			}
		  else if(strstr(StrTokStr[0],"voltagcal") != 0)
				{
				float TpVoltR,TpVoltY,TpVoltB;
				float TpTmp;

				ReadTimerSettings();
			 
				TpVoltR = myatof(StrTokStr[1]);
				TpVoltY = myatof(StrTokStr[2]);
				TpVoltB = myatof(StrTokStr[3]);
        Debug("%f,%f,%f",TpVoltR,TpVoltY,TpVoltB);
				TpTmp = (TpVoltR/nCurretnCond.RVoltage);
				Debug(":%f,%f,",TpTmp,nTimerSettings.CalRVoltage);
				nTimerSettings.CalRVoltage =(double)(TpTmp)*nTimerSettings.CalRVoltage;
				TpTmp = (TpVoltY/nCurretnCond.YVoltage);
				nTimerSettings.CalYVoltage =(double)(TpTmp)*nTimerSettings.CalYVoltage;
				TpTmp = (TpVoltB/nCurretnCond.BVoltage);
				nTimerSettings.CalBVoltage = (double)(TpTmp)*nTimerSettings.CalBVoltage;
				 
				WriteTimerSettings();			 
				//SendSMSViewCal(1,SmsNumber[0]);				 
				ReadTimerSettings();
			}  			 		
		  
		  else if(strstr(StrTokStr[0],"dt") != 0 && isDtValidLength(StrTokStr[1]) == 1)
				{
		      int8_t retv;
          struct _rtc timevar;				
         	int hour,min,sec,year,mon,day;       
			
					Debug("\n\rD&T:[%s]\n\r",StrTokStr[1]);		  
					sscanf((char* )StrTokStr[1],"%02d/%02d/%02d/%02d/%02d/%02d",&year,&mon,&day,&hour,&min,&sec);
					timevar.tm_hour=hour;
					timevar.tm_min=min;
					timevar.tm_sec=sec;
          timevar.tm_mday=day;
					timevar.tm_mon =mon;
					timevar.tm_year=year;              
					 
		  
				  Debug("Before Set TIME:[%02d:%02d:%02d]\n",timevar.tm_hour,timevar.tm_min,timevar.tm_sec);
	        Debug("DATE:[%02d-%02d-%02d]\n",timevar.tm_mday,timevar.tm_mon,timevar.tm_year);
					 
					
					if((timevar.tm_hour < 0 && timevar.tm_min < 0 && timevar.tm_sec <0 )|| (timevar.tm_mday <= 0 || timevar.tm_mon <= 0 || timevar.tm_year <=0))
					{
						Debug("\r\n{set time format error!}\r\n");
					}
					else
					{
						retv=SetDateTime(timevar);
						if(retv < 0)
							Debug("\r\n{set time failed }!\r\n");
						else			
							Debug("\r\n{set time successed!}\r\n");		
				  }
		  
		      if(nMSettings.responseOnOf==1) {
					  STATE_SENDSMS=STATE_DATETIME_SMS;
					  SendSmsToAll = 1;
					}

				}   
			else if(strstr(StrTokStr[0],"dramps3") != 0 && strlen(StrTokStr[0]) == 12)
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][7]-'0';
					Tp1 = StrTokStr[0][8]-'0';
					Tp2 = StrTokStr[0][9]-'0';
					Tp3 = StrTokStr[0][11]-'0';
					nTimerSettings.DrAmpsIII = (Tp*1000)+(Tp1*100)+(Tp2*10)+Tp3;
					//Debug("\n\r Got Value of nTimerSettings.DrAmpsIII = %0.1f\n\r",nTimerSettings.DrAmpsIII);				 
					nTimerSettings.DrAmpsIII = (nTimerSettings.DrAmpsIII)/10;
					//Debug("\n\r Got Value of nTimerSettings.DrAmpsIII = %0.1f\n\r",nTimerSettings.DrAmpsIII);					 
					//Debug("\n\r Got Value of textBuf = %s\n\r",textBuf);					
					Debug("\n\r Got Value of nTimerSettings.DrAmpsIII = %0.1f\n\r",nTimerSettings.DrAmpsIII);					  
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_DRAMPIII_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}	

			else if(strstr(StrTokStr[0],"dramps2") != 0 && strlen(StrTokStr[0]) == 12 )
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][7]-'0';
					Tp1 = StrTokStr[0][8]-'0';
					Tp2 = StrTokStr[0][9]-'0';
					Tp3 = StrTokStr[0][11]-'0';
					nTimerSettings.DrAmpsII = (Tp*1000)+(Tp1*100)+(Tp2*10)+Tp3;
					//sAPI_Sprintf(buf,"\n\r Got Value of textBuf = %s\n\r",textBuf);
					// PrintfResp(buf);
					nTimerSettings.DrAmpsII = nTimerSettings.DrAmpsII/10;
					Debug("\n\r Got Value of nTimerSettings.DrAmpsII = %0.1f\n\r",nTimerSettings.DrAmpsII);					
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_DRAMPII_SMS;
						SendSmsToAll = 1;						
					}	
					ReadTimerSettings();

				}		
				
			else if(strstr(StrTokStr[0],"olamps3") != 0 && strlen(StrTokStr[0]) == 12 )
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][7]-'0';
					Tp1 = StrTokStr[0][8]-'0';
					Tp2 = StrTokStr[0][9]-'0';
					Tp3 = StrTokStr[0][11]-'0';
					nTimerSettings.OlAmpsIII = (Tp*1000)+(Tp1*100)+(Tp2*10)+Tp3;
					nTimerSettings.OlAmpsIII = nTimerSettings.OlAmpsIII/10;

					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_OLAMPSIII_SMS;
						SendSmsToAll = 1;
						Debug("\n\r Got Value of nTimerSettings.OlAmpsII = %0.1f\n\r",nTimerSettings.OlAmpsII);						 
					}
					ReadTimerSettings();
				}			
				
			else if(strstr(StrTokStr[0],"olamps2") != 0 && strlen(StrTokStr[0]) == 12 )
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][7]-'0';
					Tp1 = StrTokStr[0][8]-'0';
					Tp2 = StrTokStr[0][9]-'0';
					Tp3 = StrTokStr[0][11]-'0';
					nTimerSettings.OlAmpsII = (Tp*1000)+(Tp1*100)+(Tp2*10)+Tp3;
					nTimerSettings.OlAmpsII = nTimerSettings.OlAmpsII/10;

					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_OLAMPSII_SMS;
						SendSmsToAll = 1;
						//nTimerSettings.OlAmpsII = (nTimerSettings.OlAmpsII*100)+(Tp*10)+Tp3;
						//sAPI_Sprintf(buf,"\n\r Got Value of textBuf = %s\n\r",textBuf);
						// PrintfResp(buf);
						Debug("\n\r Got Value of nTimerSettings.OlAmpsII = %2.1f\n\r",nTimerSettings.OlAmpsII);						 
					}
					ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"ondelay") != 0 && strlen(StrTokStr[0]) == 13)
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][7]-'0';
					Tp3 = StrTokStr[0][8]-'0';
					nTimerSettings.POnHr = (Tp*10)+Tp3;

					Tp = StrTokStr[0][9]-'0';
					Tp3 = StrTokStr[0][10]-'0';
					nTimerSettings.POnMin = (Tp*10)+Tp3;

					Tp = StrTokStr[0][11]-'0';
					Tp3 = StrTokStr[0][12]-'0';

					nTimerSettings.POnSec = (Tp*10)+Tp3;

					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						//cpbrsearchend =0;
						STATE_SENDSMS=STATE_ONDELAY_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();

