AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
				}	

			else if(strstr(StrTokStr[0],"sddelay") != 0 && strlen(StrTokStr[0]) == 13)
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][7]-'0';
					Tp3 = StrTokStr[0][8]-'0';
					nTimerSettings.SDHr = (Tp*10)+Tp3;

					Tp = StrTokStr[0][9]-'0';
					Tp3 = StrTokStr[0][10]-'0';
					nTimerSettings.SDMin = (Tp*10)+Tp3;

					Tp = StrTokStr[0][11]-'0';
					Tp3 = StrTokStr[0][12]-'0';

					nTimerSettings.SDSec = (Tp*10)+Tp3;

					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_SDDELAY_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		
      else if(strstr(StrTokStr[0],"sfbdelay") != 0)
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][8]-'0';
					Tp3 = StrTokStr[0][9]-'0';
					nTimerSettings.SfbHr = (Tp*10)+Tp3;

					Tp = StrTokStr[0][10]-'0';
					Tp3 = StrTokStr[0][11]-'0';
					nTimerSettings.SfbMin = (Tp*10)+Tp3;

					Tp = StrTokStr[0][12]-'0';
					Tp3 = StrTokStr[0][13]-'0';

					nTimerSettings.SfbSec = (Tp*10)+Tp3;
					WriteSettingsFile();
          if(nMSettings.responseOnOf==1){
					STATE_SENDSMS=STATE_SFBDELAY_SMS;
					SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}
			else if(strstr(StrTokStr[0],"scrdelay") != 0 && strlen(StrTokStr[0]) == 14)
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][8]-'0';
					Tp3 = StrTokStr[0][9]-'0';
					nTimerSettings.ScrDlHr = (Tp*10)+Tp3;

					Tp = StrTokStr[0][10]-'0';
					Tp3 = StrTokStr[0][11]-'0';
					nTimerSettings.ScrDlMin = (Tp*10)+Tp3;

					Tp = StrTokStr[0][12]-'0';
					Tp3 = StrTokStr[0][13]-'0';

					nTimerSettings.ScrDlSec = (Tp*10)+Tp3;

					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_SCRDEL_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		

			else if(strstr(StrTokStr[0],"scrdelayon") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.ScrDlOnOff = 1;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_SCRDLONOF_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"scrdelayof") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.ScrDlOnOff = 0;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_SCRDLONOF_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}
				
			else if(strstr(StrTokStr[0],"drrestart") != 0 && isValidDRTFormat(StrTokStr[0])==1)
				{
						ReadTimerSettings();
						Tp = StrTokStr[0][9]-'0';
						Tp3 = StrTokStr[0][10]-'0';
						nTimerSettings.DrReHr = (Tp*10)+Tp3;

						Tp = StrTokStr[0][11]-'0';
						Tp3 = StrTokStr[0][12]-'0';
						nTimerSettings.DrReMin = (Tp*10)+Tp3;

						Tp = StrTokStr[0][13]-'0';
						Tp3 = StrTokStr[0][14]-'0';

						nTimerSettings.DrReSec = (Tp*10)+Tp3;

						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_DRRST_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
				}		
						
			else if(strstr(StrTokStr[0],"cyclictimonof") != 0 && isValidCyclicTimerFormat(StrTokStr[1])==1 && isValidCyclicTimerFormat(StrTokStr[2])==1) 
				{
						ReadTimerSettings();
					
   					Tp1= StrTokStr[1][0]-'0';
						Tp2= StrTokStr[1][1]-'0';
						nTimerSettings.CycLicOnHr=(Tp1*10)+Tp2;
						Tp1= StrTokStr[1][2]-'0';
						Tp2= StrTokStr[1][3]-'0';
						nTimerSettings.CycLicOnMin=(Tp1*10)+Tp2;
						Tp1= StrTokStr[2][0]-'0';
						Tp2= StrTokStr[2][1]-'0';
						nTimerSettings.CycLicOfHr=(Tp1*10)+Tp2;
						Tp1= StrTokStr[2][2]-'0';
						Tp2= StrTokStr[2][3]-'0';
						nTimerSettings.CycLicOfMin=(Tp1*10)+Tp2;
						nTimerSettings.CycLicOnSec=0;
						nTimerSettings.CycLicOfSec=0;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_CYCLICONOF_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
				}		

			else if(strstr(StrTokStr[0],"cyclicon") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.CycLicOnOf = 1;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_CYCLICONOF_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}

			else if(strstr(StrTokStr[0],"cyclicof") != 0)
				{
						ReadTimerSettings();
						nTimerSettings.CycLicOnOf = 0;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_CYCLICONOF_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
				}			
				
			else if(strstr(StrTokStr[0],"olrestartvolt") != 0 && strlen(StrTokStr[0])== 16)
				{
						ReadTimerSettings();
						nTimerSettings.OlRstVol = StrTokStr[0][13]-'0';
						Tp = StrTokStr[0][14]-'0';
						Tp3 = StrTokStr[0][15]-'0';
						nTimerSettings.OlRstVol = (nTimerSettings.OlRstVol*100)+(Tp*10)+Tp3;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_OLRSTVOL_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
				}	

			else if(strstr(StrTokStr[0],"olrestartvolton") != 0)
				{
						ReadTimerSettings();
						nTimerSettings.OlRstVolOnoff= 1;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_OLRSTVOLONOFF_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
				}	

			else if(strstr(StrTokStr[0],"olrestartvoltof") != 0)
				{
						ReadTimerSettings();
						nTimerSettings.OlRstVolOnoff = 0;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_OLRSTVOLONOFF_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"drrestarton") != 0)
				{
						ReadTimerSettings();
						nTimerSettings.DrReOnOf = 1;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){	
							STATE_SENDSMS=STATE_DRRST_SMS;
							SendSmsToAll = 1;
						}	
						ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"drrestartof") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.DrReOnOf = 0;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_DRRST_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}

			else if(strstr(StrTokStr[0],"volsppon") != 0)
				{
						ReadTimerSettings();
						nTimerSettings.SppOnoff = 1;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_SPP_SMS;
							SendSmsToAll = 1;
						}
					ReadTimerSettings();
				}		

			else if(strstr(StrTokStr[0],"volsppof") != 0)
				{
						ReadTimerSettings();
						nTimerSettings.SppOnoff = 0;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_SPP_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"currentsppon") != 0)
				{
						ReadTimerSettings();
						nTimerSettings.CurSppOnOff = 1;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_CURSPP_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
				}	

			else if(strstr(StrTokStr[0],"currentsppof") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.CurSppOnOff = 0;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_CURSPP_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}	

			else if(strstr(StrTokStr[0],"reversephaseon") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.RvePhOnoff = 1;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_REVPHASE_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"reversephaseof") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.RvePhOnoff = 1;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_REVPHASE_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"droccurtim") != 0  && strlen(StrTokStr[0])==16)
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][10]-'0';
					Tp3 = StrTokStr[0][11]-'0';
					nTimerSettings.DrOccurTimHr = (Tp*10)+Tp3;

					Tp = StrTokStr[0][12]-'0';
					Tp3 = StrTokStr[0][13]-'0';
					nTimerSettings.DrOccurTimMin = (Tp*10)+Tp3;

