AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
					Tp = StrTokStr[0][14]-'0';
					Tp3 = StrTokStr[0][15]-'0';

					nTimerSettings.DrOccurTimSec = (Tp*10)+Tp3;

					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_DROCCTIM_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}				
				
			else if(strstr(StrTokStr[0],"droccuron") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.DrOccurOnOff= 1;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_DROCCONOFF_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}
				
			else if(strstr(StrTokStr[0],"droccurof") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.DrOccurOnOff = 0;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_DROCCONOFF_SMS;
						SendSmsToAll = 1;
					}	
					ReadTimerSettings();
				}		

			else if(strstr(StrTokStr[0],"lowvolt2") != 0 && strlen(StrTokStr[0])==11)
				{
					ReadTimerSettings();
					nTimerSettings.LowVoltII = StrTokStr[0][8]-'0';
					Tp = StrTokStr[0][9]-'0';
					Tp3 = StrTokStr[0][10]-'0';

					nTimerSettings.LowVoltII = (nTimerSettings.LowVoltII*100)+(Tp*10)+Tp3;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_LOWVOLTII_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"lowvolt3") != 0 && strlen(StrTokStr[0])==11)
				{
					ReadTimerSettings();
					nTimerSettings.LowVoltIII = StrTokStr[0][8]-'0';
					Tp = StrTokStr[0][9]-'0';
					Tp3 = StrTokStr[0][10]-'0';

					nTimerSettings.LowVoltIII = (nTimerSettings.LowVoltIII*100)+(Tp*10)+Tp3;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_LOWVOLTIII_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		

			else if(strstr(StrTokStr[0],"highvolt2") != 0 && strlen(StrTokStr[0])==12 )
				{
					ReadTimerSettings();
					nTimerSettings.HighVoltII = StrTokStr[0][9]-'0';
					Tp = StrTokStr[0][10]-'0';
					Tp3 = StrTokStr[0][11]-'0';

					nTimerSettings.HighVoltII = (nTimerSettings.HighVoltII*100)+(Tp*10)+Tp3;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_HIGHVOLTII_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"highvolt3") != 0 && strlen(StrTokStr[0])==12)
				{
					ReadTimerSettings();
					nTimerSettings.HighVoltIII = StrTokStr[0][9]-'0';
					Tp = StrTokStr[0][10]-'0';
					Tp3 = StrTokStr[0][11]-'0';

					nTimerSettings.HighVoltIII = (nTimerSettings.HighVoltIII*100)+(Tp*10)+Tp3;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_HIGHVOLTIII_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}				
				
			else if(strstr(StrTokStr[0],"diffvolt2") != 0 && strlen(StrTokStr[0])==12)
				{
					ReadTimerSettings();
					nTimerSettings.DiffVoltII = StrTokStr[0][9]-'0';
					Tp = StrTokStr[0][10]-'0';
					Tp3 = StrTokStr[0][11]-'0';

					nTimerSettings.DiffVoltII = (nTimerSettings.DiffVoltII*100)+(Tp*10)+Tp3;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_DIFFVOLTII_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		

			else if(strstr(StrTokStr[0],"diffvolt3") != 0 && strlen(StrTokStr[0])==12)
				{
					ReadTimerSettings();
					nTimerSettings.DiffVoltIII = StrTokStr[0][9]-'0';
					Tp = StrTokStr[0][10]-'0';
					Tp3 = StrTokStr[0][11]-'0';

					nTimerSettings.DiffVoltIII = (nTimerSettings.DiffVoltIII*100)+(Tp*10)+Tp3;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_DIFFVOLTIII_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"imbvolt") != 0 && strlen(StrTokStr[0])== 10)
				{
					ReadTimerSettings();
					nTimerSettings.ImbVolt = StrTokStr[0][7]-'0';
					Tp = StrTokStr[0][8]-'0';
					Tp3 = StrTokStr[0][9]-'0';

					nTimerSettings.ImbVolt = (nTimerSettings.ImbVolt*100)+(Tp*10)+Tp3;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_IMBVOLT_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}		
				
			else if(strstr(StrTokStr[0],"drscan") != 0 && strlen(StrTokStr[0])== 12)
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][6]-'0';
					Tp3 = StrTokStr[0][7]-'0';
					nTimerSettings.DrScHr = (Tp*10)+Tp3;

					Tp = StrTokStr[0][8]-'0';
					Tp3 = StrTokStr[0][9]-'0';
					nTimerSettings.DrScMin = (Tp*10)+Tp3;

					Tp = StrTokStr[0][10]-'0';
					Tp3 = StrTokStr[0][11]-'0';

					nTimerSettings.DrScSec = (Tp*10)+Tp3;

					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_DRSCAN_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}	
			
			else if(strstr(StrTokStr[0],"olscan") != 0 && strlen(StrTokStr[0])== 12)
				{
					ReadTimerSettings();
					Tp = StrTokStr[0][6]-'0';
					Tp3 = StrTokStr[0][7]-'0';
					nTimerSettings.OlScanHr = (Tp*10)+Tp3;

					Tp = StrTokStr[0][8]-'0';
					Tp3 = StrTokStr[0][9]-'0';
					nTimerSettings.OlScanMin = (Tp*10)+Tp3;

					Tp = StrTokStr[0][10]-'0';
					Tp3 = StrTokStr[0][11]-'0';

					nTimerSettings.OlScanSec = (Tp*10)+Tp3;

					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_OLSCAN_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}			
				
			else if(strstr(StrTokStr[0],"sfbon") != 0)
				{
					ReadSettingsFile();
					nMSettings.SfbOnOff = 1;
					WriteSettingsFile();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS = STATE_SFB_SMS;
						SendSmsToAll = 1;
					}	
					ReadSettingsFile();
				}			

			else if(strstr(StrTokStr[0],"sfbof") != 0)
				{
						ReadSettingsFile();
						nMSettings.SfbOnOff = 0;
						WriteSettingsFile();
					if(nMSettings.responseOnOf==1){
								STATE_SENDSMS = STATE_SFB_SMS;
								SendSmsToAll = 1;
					}
						ReadSettingsFile();
				}				
			else if(strstr(StrTokStr[0],"pfcseton") != 0)
				{
					ReadSettingsFile();
					nTimerSettings.pfcOnOff = 1;
					WriteSettingsFile();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_POWERFACTOR_SMS;
						SendSmsToAll = 1;
					}
					ReadSettingsFile();
				}
				
