AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
			else if(strstr(StrTokStr[0],"pfcsetof") != 0)
				{
					ReadSettingsFile();
					nTimerSettings.pfcOnOff = 0;
					WriteSettingsFile();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_POWERFACTOR_SMS;
						SendSmsToAll = 1;
					}
					ReadSettingsFile();
				}				
			else if(strstr(StrTokStr[0],"sumpon") != 0)
				{
				ReadSettingsFile();
				nMSettings.SumpOnOff = 1;
				WriteSettingsFile();
				ReadSettingsFile();
				if(nMSettings.responseOnOf==1){	
					STATE_SENDSMS = STATE_SUMP_SMS;			
					SendSmsToAll = 1;
				}			
			}
			else if(strstr(StrTokStr[0],"sumpof") != 0)
				{
				ReadSettingsFile();
				nMSettings.SumpOnOff = 0;				
				WriteSettingsFile();
				ReadSettingsFile();
				
			  if(nMSettings.responseOnOf==1){
				  STATE_SENDSMS = STATE_SUMP_SMS;
				  SendSmsToAll = 1;
			  }
				
			}
		  else if(strstr(StrTokStr[0],"tankon") != 0)
				{
				ReadSettingsFile();
				nMSettings.TankOnOff = 1;
				WriteSettingsFile();				
				ReadSettingsFile();
				if(nMSettings.responseOnOf==1){
					STATE_SENDSMS = STATE_TANK_SMS;
					SendSmsToAll = 1;
				}				
			}
			else if(strstr(StrTokStr[0],"tankof") != 0)
				{
				ReadSettingsFile();
				nMSettings.TankOnOff = 0;				
				WriteSettingsFile();
				ReadSettingsFile();				
				if(nMSettings.responseOnOf==1){
					STATE_SENDSMS = STATE_TANK_SMS;
					SendSmsToAll = 1;
				}
				
			}
			else if(strstr(StrTokStr[0],"pwrvbof") != 0)
				{				 
					ReadSettingsFile();
					nMSettings.pwrvfbOnOf = 0;				
					WriteSettingsFile();				
					ReadSettingsFile();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS = STATE_PWRVFB_SMS;
						SendSmsToAll = 1;
					}
			 
				}
			else if(strstr(StrTokStr[0],"vfbon") != 0)
				{
					ReadSettingsFile();
					nMSettings.VBFOnOff = 1;				
					ReadSettingsFile();
					WriteSettingsFile();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS = STATE_VFB_SMS;			
						SendSmsToAll = 1;
					}
				}
			else if(strstr(StrTokStr[0],"vfbof") != 0)
				{
					ReadSettingsFile();
					nMSettings.VBFOnOff = 0;				
					WriteSettingsFile();				
					ReadSettingsFile();				
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS = STATE_VFB_SMS;
						SendSmsToAll = 1;
					}
				}	
			else if(strstr(StrTokStr[0],"maxtim") != 0)
				{
						ReadTimerSettings();
						Tp = StrTokStr[0][6]-'0';
						Tp3 = StrTokStr[0][7]-'0';
						nTimerSettings.MaxRnHr = (Tp*10)+Tp3;

						Tp = StrTokStr[0][8]-'0';
						Tp3 = StrTokStr[0][9]-'0';
						nTimerSettings.MaxRnMin = (Tp*10)+Tp3;

						Tp = StrTokStr[0][10]-'0';
						Tp3 = StrTokStr[0][11]-'0';

						nTimerSettings.MaxRnSec = (Tp*10)+Tp3;

						WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
							STATE_SENDSMS=STATE_MAXTIM_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
				}
		
		else if(strstr(StrTokStr[0],"maxtimon") != 0)
			{
				ReadTimerSettings();
				nTimerSettings.MaxRnOnOf = 1;
				WriteTimerSettings();
				if(nMSettings.responseOnOf==1){		
					STATE_SENDSMS=STATE_MAXTIM_SMS;
					SendSmsToAll = 1;
				}
				ReadTimerSettings();
			}
		
		else if(strstr(StrTokStr[0],"maxtimof") != 0)
			{
				ReadTimerSettings();
				nTimerSettings.MaxRnOnOf = 0;
				WriteTimerSettings();
				if(nMSettings.responseOnOf==1){
					STATE_SENDSMS=STATE_MAXTIM_SMS;
					SendSmsToAll = 1;
				}
				ReadTimerSettings();
			}
				else if(strstr(StrTokStr[0],"rtctimonof") != 0 )
				{
							i = StrTokStr[0][10]-'0';
					
							if(i>=1&&i<=4)
							{							 

							Tp1= StrTokStr[1][0]-'0';
							Tp2= StrTokStr[1][1]-'0';
							nTimerSettings.RTCOnHr[i]=(Tp1*10)+Tp2;
							Tp1= StrTokStr[1][2]-'0';
							Tp2= StrTokStr[1][3]-'0';
							nTimerSettings.RTCOnMin[i]=(Tp1*10)+Tp2;
							Tp1= StrTokStr[2][0]-'0';
							Tp2= StrTokStr[2][1]-'0';
							nTimerSettings.RTCOfHr[i]=(Tp1*10)+Tp2;
							Tp1= StrTokStr[2][2]-'0';
							Tp2= StrTokStr[2][3]-'0';
							nTimerSettings.RTCOfMin[i]=(Tp1*10)+Tp2;

							WriteTimerSettings();
							ReadTimerSettings();
								
							if(nMSettings.responseOnOf==1){	
									if(i==1)
									STATE_SENDSMS=STATE_RTCTIMON1_SMS;
									if(i==2)
									STATE_SENDSMS=STATE_RTCTIMON2_SMS;
									if(i==3)
									STATE_SENDSMS=STATE_RTCTIMON3_SMS;
									if(i==4)
									STATE_SENDSMS=STATE_RTCTIMON4_SMS;
									SendSmsToAll = 1;
								}
							}
				}
			else if(strstr(StrTokStr[0],"rtcon") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.RTCOnOf = 1;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_RTCONOF_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}				
			else if(strstr(StrTokStr[0],"rtcof") != 0)
				{
					ReadTimerSettings();
					nTimerSettings.RTCOnOf = 0;
					WriteTimerSettings();
					if(nMSettings.responseOnOf==1){
						STATE_SENDSMS=STATE_RTCONOF_SMS;
						SendSmsToAll = 1;
					}
					ReadTimerSettings();
				}
			else if(strstr(StrTokStr[0],"lowvolton") != 0)
					{
						ReadTimerSettings();
						nTimerSettings.LowVoltOnOff = 1;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){	
							STATE_SENDSMS=STATE_LOWVOLTONOFF_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
					}
					
				else if(strstr(StrTokStr[0],"lowvoltof") != 0)
					{
						ReadTimerSettings();
						nTimerSettings.LowVoltOnOff = 0;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){	
							STATE_SENDSMS=STATE_LOWVOLTONOFF_SMS;
							SendSmsToAll = 1;
						}
							ReadTimerSettings();
					}
				else if(strstr(StrTokStr[0],"highvolton") != 0)
					{
						ReadTimerSettings();
						nTimerSettings.HighVoltOnOff = 1;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){	
							STATE_SENDSMS=STATE_HIGHVOLTONOFF_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
					}					
				else if(strstr(StrTokStr[0],"highvoltof") != 0)
					{
						ReadTimerSettings();
						nTimerSettings.HighVoltOnOff = 0;
						WriteTimerSettings();
						if(nMSettings.responseOnOf==1){	
							STATE_SENDSMS=STATE_HIGHVOLTONOFF_SMS;
							SendSmsToAll = 1;
						}
						ReadTimerSettings();
					}
				else if(strstr(StrTokStr[0],"hidiffvolt2") != 0)
						{
								ReadTimerSettings();
								nTimerSettings.HiDiffVoltII = StrTokStr[0][11]-'0';
								Tp = StrTokStr[0][12]-'0';
								Tp3 = StrTokStr[0][13]-'0';

