AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
								nTimerSettings.HiDiffVoltII = (nTimerSettings.HiDiffVoltII*100)+(Tp*10)+Tp3;
								WriteTimerSettings();
								if(nMSettings.responseOnOf==1){
									STATE_SENDSMS=STATE_HIDIFFVOLTII_SMS;
									SendSmsToAll = 1;
								}
								ReadTimerSettings();
						}		
						
				else if(strstr(StrTokStr[0],"hidiffvolt3") != 0)
						{
								ReadTimerSettings();
								nTimerSettings.HiDiffVoltIII = StrTokStr[0][11]-'0';
								Tp = StrTokStr[0][12]-'0';
								Tp3 = StrTokStr[0][13]-'0';
								Debug("\n\r High Volt = %d %d %d\n\r",nTimerSettings.HiDiffVoltIII,Tp,Tp3);						 
								nTimerSettings.HiDiffVoltIII = (nTimerSettings.HiDiffVoltIII*100)+(Tp*10)+Tp3;
								Debug("\n\r--------------- %d %d %d -------------------\n\r",nTimerSettings.HiDiffVoltIII,Tp,Tp3);
								WriteTimerSettings();
								if(nMSettings.responseOnOf==1){
									STATE_SENDSMS=STATE_HIDIFFVOLTIII_SMS;
									SendSmsToAll = 1;
								}
								ReadTimerSettings();
						}	
        else if(strstr(StrTokStr[0],"pfcvolt") != 0)
						{
							ReadSettingsFile();
							nTimerSettings.pfcvolt = StrTokStr[0][7]-'0';
							Tp = StrTokStr[0][8]-'0';
							Tp3 = StrTokStr[0][9]-'0';

							nTimerSettings.pfcvolt = (nTimerSettings.pfcvolt*100)+(Tp*10)+Tp3;
							WriteSettingsFile();
							if(nMSettings.responseOnOf==1){
								STATE_SENDSMS=STATE_PFCVOLT_SMS;
								SendSmsToAll = 1;
							}
							ReadSettingsFile();
						}  
				else if(strstr(StrTokStr[0],"imbvolt") != 0)
						{
							ReadTimerSettings();
							nTimerSettings.ImbVolt = StrTokStr[0][7]-'0';
							Tp = StrTokStr[0][8]-'0';
							Tp3 = StrTokStr[0][9]-'0';

							nTimerSettings.ImbVolt = (nTimerSettings.ImbVolt*100)+(Tp*10)+Tp3;
							WriteTimerSettings();
							if(nMSettings.responseOnOf==1){
								STATE_SENDSMS=STATE_IMBVOLT_SMS;
								SendSmsToAll = 1;
							}
							ReadTimerSettings();
						}
				else if(strstr(StrTokStr[0],"olon") != 0)
						{
							ReadTimerSettings();
							nTimerSettings.OlOnOff = 1;
							WriteTimerSettings();
							if(nMSettings.responseOnOf==1){
								STATE_SENDSMS=STATE_OLINOFF_SMS;
								SendSmsToAll = 1;
							}
							ReadTimerSettings();
						}		
						
				else if(strstr(StrTokStr[0],"olof") != 0)
						{
							ReadTimerSettings();
							nTimerSettings.OlOnOff = 0;
							WriteTimerSettings();
							if(nMSettings.responseOnOf==1){
								STATE_SENDSMS=STATE_OLINOFF_SMS;
								SendSmsToAll = 1;
							}	
							ReadTimerSettings();
						}
				else if(strstr(StrTokStr[0],"2phaseon") != 0)
						{
							ReadTimerSettings();
							nTimerSettings.AutoStIIOnOff = 1;
							WriteTimerSettings();
							if(nMSettings.responseOnOf==1){
								STATE_SENDSMS=STATE_AUTOSTII_SMS;
								SendSmsToAll = 1;
							}
							ReadTimerSettings();
						}
						
				else if(strstr(StrTokStr[0],"2phaseof") != 0)
						{
							ReadTimerSettings();
							nTimerSettings.AutoStIIOnOff = 0;
							WriteTimerSettings();
							if(nMSettings.responseOnOf==1){
								STATE_SENDSMS= STATE_AUTOSTII_SMS;
								SendSmsToAll = 1;
							}
							ReadTimerSettings();
						} 	
        else if(strstr(StrTokStr[0],"olrston") != 0)
						{
							ReadTimerSettings();
							nTimerSettings.AutoOlDrRstIIOnOff = 1;
							WriteTimerSettings();
							if(nMSettings.responseOnOf==1){
								STATE_SENDSMS=STATE_AUTOOLDRRST_SMS;
								SendSmsToAll = 1;
							}
							ReadTimerSettings();
						}
						
					else if(strstr(StrTokStr[0],"olrstof") != 0)
						{
							ReadTimerSettings();
							nTimerSettings.AutoOlDrRstIIOnOff = 0;
							WriteTimerSettings();
							if(nMSettings.responseOnOf==1){
								STATE_SENDSMS= STATE_AUTOOLDRRST_SMS;
								SendSmsToAll = 1;
							}
							ReadTimerSettings();
						}	
            else if(strstr(StrTokStr[0],"drrston") != 0)
								{
									ReadTimerSettings();
									nTimerSettings.AutoDrRunRstIIOnOff = 1;
									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=STATE_AUTODRRUNRST_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}
								
						else if(strstr(StrTokStr[0],"drrstof") != 0)
								{
									ReadTimerSettings();
									nTimerSettings.AutoDrRunRstIIOnOff = 0;
									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS= STATE_AUTODRRUNRST_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}
           else if(strstr(StrTokStr[0],"manualon") != 0)
								{
									ReadTimerSettings();
									nTimerSettings.ManualOnOff = 1;
									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=STATE_MANULONOF_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}
								
						else if(strstr(StrTokStr[0],"manualof") != 0)
								{
									ReadTimerSettings();
									nTimerSettings.ManualOnOff = 0;
									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=STATE_MANULONOF_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}	
            else if(strstr(StrTokStr[0],"droccurnbr") != 0)
								{
									ReadTimerSettings();
									Tp = StrTokStr[0][10]-'0';
									Tp3 = StrTokStr[0][11]-'0';
									nTimerSettings.DrOccurNum = (Tp*10)+Tp3;
									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=STATE_DROCCNUM_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								} 
            else if(strstr(StrTokStr[0],"ctron") != 0)
								{
									ReadTimerSettings();

									nTimerSettings.CTRonoff = 1;
									
									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=STATE_CTRON_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}
								
						else if(strstr(StrTokStr[0],"ctrof") != 0)
								{
									ReadTimerSettings();

									nTimerSettings.CTRonoff = 0;

									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=	STATE_CTROF_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}		

						else if(strstr(StrTokStr[0],"ctyon") != 0)
								{
									ReadTimerSettings();

									nTimerSettings.CTYonoff = 1;

									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=STATE_CTYON_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}
								
						else if(strstr(StrTokStr[0],"ctyof") != 0)
								{
									ReadTimerSettings();

									nTimerSettings.CTYonoff = 0;

									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=	STATE_CTYOF_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}		
						else if(strstr(StrTokStr[0],"ctbon") != 0)
								{
									ReadTimerSettings();

									nTimerSettings.CTBonoff = 1;

									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=STATE_CTBON_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}								
						else if(strstr(StrTokStr[0],"ctbof") != 0)
								{
									ReadTimerSettings();

