AJITH-ANANDHAN-04/OROPUMP_M483/EADC_SWTRG_Trigger/RunMotor.c
									nTimerSettings.CTBonoff = 0;

									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=	STATE_CTBOF_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}
						else if(strstr(StrTokStr[0],"autorst2on") != 0)
								{
									ReadTimerSettings();

									nTimerSettings.AutoRst2On = 1;

									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=	STATE_AUTORST2ONOFF_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}								
						else if(strstr(StrTokStr[0],"autorst2of") != 0)
								{
									ReadTimerSettings();

									nTimerSettings.AutoRst2On = 0;

									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=	STATE_AUTORST2ONOFF_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}								
						else if(strstr(StrTokStr[0],"mobilerston") != 0)
								{
									ReadTimerSettings();
									nTimerSettings.AutoRstOn = 1;

									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=	STATE_AUTORSTONOFF_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								}									
						else if(strstr(StrTokStr[0],"mobilerstof") != 0)
								{
									ReadTimerSettings();
									nTimerSettings.AutoRstOn = 0;

									WriteTimerSettings();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS=	STATE_AUTORSTONOFF_SMS;
										SendSmsToAll = 1;
									}
									ReadTimerSettings();
								} 
           else if(strstr(StrTokStr[0],"pwrvbon") != 0)
								{
									//char SendString[70] = "";
									ReadSettingsFile();
									nMSettings.pwrvfbOnOf = 1;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_PWRVFB_SMS;
										SendSmsToAll = 1;
										// sAPI_Sprintf(SendString,"POWER VFB ON\n");
										//sAPI_Sprintf(SendString,"%sREG S NO:%s\n",SendString,StoredPhoneNumber[11]);
										// simcom_sms_msg_send(ph_num, SendString, strlen(SendString),SmSCallback);
										// sAPI_Sprintf(buf,"\n\r smsbuffer %s\n\r",SendString);
										// PrintfResp(buf);
									}
									ReadSettingsFile();
								}		
								
						else if(strstr(StrTokStr[0],"pwrvbof") != 0)
								{
									//char SendString[70] = "";
									ReadSettingsFile();
									nMSettings.pwrvfbOnOf = 0;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_PWRVFB_SMS;										 
										SendSmsToAll = 1;
										//sAPI_Sprintf(SendString,"POWER VFB OFF\n");
										//simcom_sms_msg_send(ph_num, SendString, strlen(SendString),SmSCallback);
										// sAPI_Sprintf(buf,"\n\r smsbuffer %s\n\r",SendString);
										// PrintfResp(buf);
									}
									ReadSettingsFile();
								}		
								
						else if(strstr(StrTokStr[0],"vfbon") != 0)
								{
									ReadSettingsFile();
									nMSettings.VBFOnOff = 1;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_VFB_SMS;
										SendSmsToAll = 1;
									}
									ReadSettingsFile();
								}
										
						else if(strstr(StrTokStr[0],"vfbof") != 0)
								{
									ReadSettingsFile();
									nMSettings.VBFOnOff = 0;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_VFB_SMS;
										SendSmsToAll = 1;
									}
									ReadSettingsFile();
								}			
								
						else if(strstr(StrTokStr[0],"smson") != 0)
								{
										ReadSettingsFile();
										nMSettings.SMSOnOff = 1;
										WriteSettingsFile();
										if(nMSettings.responseOnOf==1){
											STATE_SENDSMS = STATE_SMSON_SMS;
											SendSmsToAll = 1;
											//simcom_sms_send(ph_num,smsbuffer,strlen(smsbuffer));
											//sAPI_Sprintf(smsbuffer,"SMS ON");										
										}
										ReadSettingsFile();	
								}	

						else if(strstr(StrTokStr[0],"smsof") != 0)
								{
									//char SendString[70] = "";
									ReadSettingsFile();
									nMSettings.SMSOnOff = 0;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_SMSON_SMS;
										SendSmsToAll = 1;			
										//	sprintf(SendString,"SMS OFF\n\r");
										//simcom_sms_send(ph_num, SendString, strlen(SendString));
									}
									ReadSettingsFile();
								}
						else if(strstr(StrTokStr[0],"stsmson") != 0)
								{
									ReadSettingsFile();
									nMSettings.staticSMSOnOff = 1;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_stSMSON_SMS;
										SendSmsToAll = 1;
									}
									ReadSettingsFile();
								}
								
						else if(strstr(StrTokStr[0],"stsmsof") != 0)
								{
									ReadSettingsFile();
									nMSettings.staticSMSOnOff = 0;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
									STATE_SENDSMS = STATE_stSMSON_SMS;
									SendSmsToAll = 1;
									}
									ReadSettingsFile();
								}
						else if(strstr(StrTokStr[0],"responseon") != 0)
								{
									ReadSettingsFile();
									nMSettings.responseOnOf= 1;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_RESP_SMS;
										SendSmsToAll = 1;
									}
									ReadSettingsFile();
								}	
           else if(strstr(StrTokStr[0],"responseof") != 0)
								{
									ReadSettingsFile();
									nMSettings.responseOnOf= 0;
									WriteSettingsFile();									 
									STATE_SENDSMS = STATE_RESP_SMS;
									SendSmsToAll = 1;									 
									ReadSettingsFile();
								}
           
					else if(strstr(StrTokStr[0],"loraon") != 0)
								{
									ReadSettingsFile();
									nMSettings.ModeSelect= 0;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_RESP_SMS;
										SendSmsToAll = 1;
									}
									ReadSettingsFile();
								}
					else if(strstr(StrTokStr[0],"gsmon") != 0)
								{
									ReadSettingsFile();
									nMSettings.ModeSelect= 1;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_RESP_SMS;
										SendSmsToAll = 1;
									}
									ReadSettingsFile();
								}	
					else if(strstr(StrTokStr[0],"wifion") != 0)
								{
									ReadSettingsFile();
									nMSettings.ModeSelect= 2;
									WriteSettingsFile();
									if(nMSettings.responseOnOf==1){
										STATE_SENDSMS = STATE_RESP_SMS;
										SendSmsToAll = 1;
									}
									ReadSettingsFile();
								}
        							
				
			/*clear the buffer after processed*/
			memset(ProcessBuf,NULL,sizeof(ProcessBuf));
			return 1;  //succeed
	}
	else {
			/*clear the buffer after processed*/
			memset(ProcessBuf,NULL,sizeof(ProcessBuf));
			memset((char*)ModemString,NULL,sizeof(ModemString));
			return 0;
	}
	#endif
}


